{
  "hexagrams": [
    {
      "number": 1,
      "name": "The Creative (乾 - Qián)",
      "heart": "Six unbroken lines, stacked like a ladder to the sky. Pure yang. The force that moves the stars without effort, that turns the seasons without hurry. Before any doing, there is this: the power simply to be, to generate, to begin. The Creative does not struggle—it creates by being itself, the way the sky does not try to be vast, it simply is.",
      "ancient": {
        "chinese": "乾。元亨利貞。",
        "rendering": "THE CREATIVE works sublime success, Furthering through perseverance."
      },
      "judgment": "There is a power in you that precedes all action. It is not something you earn or achieve—it is your birthright, the original energy that brought you here. When you act from this place, success follows not because you forced it, but because you aligned with something larger. The four virtues are one: origin that unfolds, flow that encounters no obstacle, nature that finds its true expression, and the firmness that endures. Do not mistake this for ambition. The Creative does not grasp; it radiates.",
      "image": "The movement of heaven is full of power. Thus the superior person makes themselves strong and untiring. Heaven does not pause. It does not rush. It simply moves, endlessly, like breath, like a heartbeat. To be strong and untiring is not to push against the world, but to remain so deeply yourself that you never need to stop. Like the sky that holds the stars without effort, you hold your center through all seasons.",
      "lines": [
        "Hidden dragon. Do not act. The power is there, coiled like a dragon beneath the earth, but the time is not yet ripe. To push now would be to break the sprout before it breaks the soil. Rest in the darkness. Let the roots grow. The world does not need to see you yet. It needs you to become real.",
        "Dragon appearing in the field. It furthers one to see the great person. Now the first green shoot appears. Not yet a tree, but unmistakably alive. You emerge into the field of human affairs, and those with eyes to see recognize something genuine in you. Do not mistake this for fame or status. It is simply the natural result of being real—others feel it, the way they feel sunlight without being told.",
        "All day long, the creative person is actively creating. At nightfall, their mind is still beset with cares. Danger. No blame. The work has begun, and it is good. But with doing comes the noise of doing—plans, worries, the endless chatter of 'what next.' This is the danger: that the activity consumes the stillness from which it came. The sage works all day, then returns to silence. Can you?",
        "Wavering flight over the depths. No blame. Now you have climbed high enough to see the abyss. Below you, the vast unknown. Two paths open: to soar higher into the world's view, or to dive deep into solitude and self-discovery. Neither is wrong. The only mistake is to choose from fear. Ask the depths which way is yours.",
        "Flying dragon in the heavens. It furthers one to see the great person. At last, full expression. The dragon that was hidden, then appearing, then active, then hovering, now flies free across the sky. This is not conquest—it is fulfillment. Like a tree that has reached its full height and now simply offers shade. Those who see you at this stage are blessed not by your power, but by your completion.",
        "Arrogant dragon will have cause to repent. The sky has no top. To keep climbing beyond yourself is to leave the earth entirely, to become nothing. The dragon that forgets it once came from the depths loses its way. Pride is not the fall—it is the forgetting that you were ever small. Stay connected to the ground, even in flight."
      ],
      "trigrams": {
        "lower": {
          "name": "Qián (Heaven)",
          "nature": "The creative, the originating, the power to begin"
        },
        "upper": {
          "name": "Qián (Heaven)",
          "nature": "The active, the moving, the power to continue"
        },
        "description": "Heaven above heaven. Movement generating more movement. This is not repetition, but the endless unfolding of what is genuine. Like one wave following another, each new, each the same ocean. The lower heaven is your inner source; the upper heaven is your outer expression. When they are the same, you live without division."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The Tao never acts, yet nothing is left undone.' Hexagram 1 is the living proof. Pure yang, pure creative power—yet it does not grasp, demand, or strive. It simply is, and in its being, all things arise. The dragon does not try to be powerful; it is powerful, and so it flies. The sky does not try to be vast; it is vast, and so it holds the stars. The sage does not try to lead; they are real, and so others follow—not because they are pushed, but because they recognize something they already carry within themselves. This is the teaching of The Creative: before any doing, be. And from that being, let action flow like water from an endless spring."
    },
    {
      "number": 2,
      "name": "The Receptive (坤 - Kūn)",
      "heart": "Six broken lines. Earth receiving heaven. The mare running across the endless plain, asking nothing, becoming everything. Where the Creative gives birth to ideas, the Receptive brings them into form. It does not initiate—it completes. It does not command—it supports. This is not weakness. The earth does not struggle to be fertile; it simply opens, and life springs forth.",
      "ancient": {
        "chinese": "坤。元亨利牝馬之貞。君子有攸往，先迷後得主，利。西南得朋，東北喪朋。安貞吉。",
        "rendering": "THE RECEPTIVE brings about sublime success, Furthering through the perseverance of a mare. If the superior person undertakes something and tries to lead, they go astray; but if they follow, they find guidance. It is favorable to find friends in the west and south, to forego friends in the east and north. Quiet perseverance brings good fortune."
      },
      "judgment": "There is a power in you that does not push—it receives. Like soil receiving rain, like the valley receiving the stream, like the mare running not to conquer the plain but to become one with it. This is the perseverance of the mare: not stubbornness, but faithful, steady movement within the whole. To try to lead here is to lose the way. To follow—not weakly, but with full presence—is to find guidance. The Receptive teaches that some things come only when we stop reaching for them. They arrive in the space we have held open.",
      "image": "The earth's condition is receptive devotion. Thus the superior person carries the outer world with broad virtue. The earth does not select what it receives. It accepts rain and drought, seed and stone, the footstep and the resting body. Its virtue is its vast capacity to hold all things without judgment. In the same way, the wise one develops a heart wide enough to contain the world—not to control it, but to support it. This is true strength: to carry without complaint, to hold without possessing.",
      "lines": [
        "Hoarfrost underfoot. Solid ice follows. The first sign—a chill in the air, frost on the grass. It seems small, insignificant. But frost is the beginning of ice. The Receptive teaches through accumulation. What you allow today, you invite tomorrow. Not as punishment, but as nature. Tend the small beginnings, for they become your ground.",
        "Straight, square, great. No need for practice, nothing that does not further. The earth is straight—it follows its nature without deviation. It is square—it contains all things within its four directions. It is great—it holds everything without exception. When you are simply yourself, fully, without pretense, your actions become like the earth: direct, containing, vast. You need not practice being what you already are.",
        "Hidden lines. One can remain persevering. If by chance you are in the service of a king, seek not works, but bring to completion. Sometimes the way is to be invisible. Not hidden because you are hiding, but hidden because the work does not need your name on it. Like the earth that supports the tree without needing to be seen in its branches, you complete things without claiming them. This is not self-effacement—it is the wisdom of knowing when your presence is the gift, not your label.",
        "A tied-up sack. No blame, no praise. There are times when the wise one binds themselves like a sack—closed, contained, revealing nothing. This is not fear; it is appropriateness. When the world is not ready to receive, or when your inner work requires silence, you close. No blame follows, because you have harmed nothing. But also no praise, because praise comes from opening. Learn when to tie the sack, and when to loosen it.",
        "A yellow lower garment. Supreme good fortune. Yellow is the color of earth, of the center, of balance. A lower garment is humble, close to the ground, yet essential. To wear yellow is to be rooted in the center. To wear the lower garment is to be content with what supports, not what shines. This is supreme good fortune: to be exactly where you belong, doing exactly what is yours to do, asking nothing more.",
        "Dragons fight in the meadow. Their blood is black and yellow. When the receptive forgets its nature and tries to become creative, conflict follows. Dragons—creatures of heaven—descend to the meadow, the realm of earth. They fight. Their blood, the mingling of heaven (black) and earth (yellow), stains the grass. This is what happens when yielding becomes striving, when supporting becomes competing. The blood is not punishment—it is the natural consequence of being what you are not. Stay in your ground."
      ],
      "trigrams": {
        "lower": {
          "name": "Kūn (Earth)",
          "nature": "Devoted, yielding, receptive"
        },
        "upper": {
          "name": "Kūn (Earth)",
          "nature": "Supporting, completing, containing"
        },
        "description": "Earth above earth. Devotion that deepens devotion. Not passivity, but active, faithful presence. The lower earth is your inner ground—your capacity to receive your own experience without judgment. The upper earth is your outer expression—your way of holding others with the same unconditional acceptance. When they are the same, you become ground for yourself and others."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The supreme good is like water. It benefits all things without contention. It stays in lowly places that others despise. Thus it is near the Tao.' Hexagram 2 is water's elder sister—earth itself. Even lower than water, even more receptive. Earth asks nothing, claims nothing, yet all things return to it in the end. This is the power of true humility: not thinking less of yourself, but thinking of yourself less. The mare does not try to be fast like the dragon; she runs her own run, and in that running, she is complete. The Receptive teaches that to follow is not to be less—it is to find the one thing you were always meant to complete, and to complete it without needing to be seen doing so."
    },
    {
      "number": 3,
      "name": "Difficulty at the Beginning (屯 - Zhūn)",
      "heart": "Thunder and rain. The storm that breaks the drought. Below, thunder stirs; above, rain falls. But between them, clouds still gather, confused, heavy. This is the moment after conception and before birth—the quickening, the first stirring, the struggle to emerge. Everything is here, potential fully present, but not yet delivered. Difficulty at the Beginning is not failure; it is the birth pangs of creation.",
      "ancient": {
        "chinese": "屯。元亨利貞。勿用有攸往。利建侯。",
        "rendering": "Difficulty at the Beginning works supreme success, Furthering through perseverance. Do not use this for undertaking. It is favorable to appoint helpers."
      },
      "judgment": "The seed has sprouted, but the soil is hard. Do not mistake this struggle for a sign that you are on the wrong path. The beginning of anything real meets resistance—the world does not part easily to let the new in. Supreme success is promised, but not yet. First comes the work of rooting, of pushing against the dark earth. Do not undertake great journeys now. Instead, gather helpers, those who can steady you while you find your footing. The noble one does not go it alone at the beginning.",
      "image": "Clouds and thunder. Thus the noble one weaves the fabric of order. Thunder stirs below, clouds gather above, but the rain has not yet fallen. All the elements are present, but not yet resolved. In this tension, the wise one begins to weave—bringing together what is separate, ordering what is chaotic. Not by force, but by patient interconnection. Like a spider spinning its first thread across emptiness, you begin with what you have, trusting the web will hold.",
      "lines": [
        "Hesitation and hindrance. It furthers one to remain persevering. It furthers one to appoint helpers. The first step is the hardest. The ground is uncertain, the way unclear. Do not charge forward blindly. Hesitation here is not weakness—it is the wise pause before commitment. Like testing the ice with one foot before trusting it with your whole weight, you wait, you feel, you gather those who can see what you cannot. The hesitation itself, when conscious, becomes part of the path.",
        "Difficulties pile up. Horse and wagon part. Not a robber, but a suitor. The maiden is chaste, she does not pledge herself. Ten years, then she pledges. Things fall apart—the horse leaves the wagon, what was joined now separates. But this is not disaster; it is the natural sorting of what does not belong together. Wait, like the maiden who will not give herself to the wrong one. Even if it takes ten years, the right alignment will come. Do not force what is not ready to join.",
        "Whoever hunts deer without the forester only enters the thicket. The noble one understands the signs of the times. It is better to give up than to continue. To pursue something without the proper guide, without understanding the territory, is to lose yourself in the thicket. The forester knows the land, knows the habits of the deer. If you hunt without them, you will stumble in blindness. There are times when giving up is not failure—it is the wisdom of recognizing you are not ready. The noble one reads the signs and knows when to wait.",
        "Horse and wagon part. Seek union. To go brings good fortune. Everything acts favorably. After the separation, the seeking. The horse that left now returns, or a new horse appears. The scattering was not permanent—it was the clearing of space for a truer joining. Now you can seek, and the seeking itself is blessed. The movement that was forbidden in the first line is now possible, because the ground has been tested, the helpers gathered, the timing matured. Go now.",
        "Difficulties in blessing. A little perseverance brings good fortune. Great perseverance brings misfortune. A small kindness offered at the right moment waters the struggling sprout. But to pour a flood on it, to try to force growth with great effort, drowns it. You are being blessed, but the blessing comes drop by drop. Accept the little that is given. Do not demand the full abundance before the plant can hold it. Patience in receiving is as important as patience in striving.",
        "Horse and wagon part. Bloody tears flow. When the breaking is final, when separation is complete, there is grief. Bloody tears—the kind that come from the deepest place. This line does not console; it witnesses. Some difficulties end not in union but in loss. And yet, even this has its place in the great turning. The tears themselves water something new, somewhere, in another season. Let them flow."
      ],
      "trigrams": {
        "lower": {
          "name": "Zhèn (Thunder)",
          "nature": "Arousing, stirring, the shock that initiates movement"
        },
        "upper": {
          "name": "Kǎn (Water)",
          "nature": "The abysmal, danger, the rain that has not yet fallen"
        },
        "description": "Thunder below, rain above. The stirring and the potential, but not yet the release. Thunder shakes the earth, rain gathers in clouds, but the downpour has not come. This is the moment of highest tension before creation breaks through. The thunder is your inner impulse to act; the water is the outer situation still forming. Both are real. Both are waiting."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The Tao gives birth to one. One gives birth to two. Two gives birth to three. Three gives birth to ten thousand things.' Hexagram 3 is the three—the firstborn of Heaven and Earth, the beginning of the ten thousand things. And what is birth but difficulty? The Tao does not promise easy beginnings. It promises that beginnings are possible, that even the hardest soil will yield if the seed is true. The sprout does not fight the earth; it grows through it, using the pressure to strengthen itself. Your difficulties at the beginning are not obstacles to your path—they are the path. The rain will fall when the clouds are full enough. The thunder has already sounded."
    },
    {
      "number": 4,
      "name": "Youthful Folly (蒙 - Méng)",
      "heart": "Every beginning is covered in mist. The mountain does not call the stream to itself—the stream finds its own way down, filling each hollow, learning the shape of the land as it flows. There is nothing wrong with not knowing. The trouble begins only when we pretend to know, or when we ask the same question again and again, hoping for a different answer.",
      "ancient": {
        "chinese": "蒙。亨。匪我求童蒙。童蒙求我。初筮告。再三瀆。瀆則不告。利貞。",
        "rendering": "Youthful folly has success. I do not seek the young and inexperienced; they seek me. At the first casting, I instruct. If they ask two or three times, that is troublesome. To the troublesome, I give no instruction. Perseverance furthers."
      },
      "judgment": "The Sage does not chase after students. Wisdom cannot be forced on anyone. But when a true seeker arrives—humble, open, ready—the teaching appears naturally, like water finding its level.",
      "image": "A spring rises at the foot of the mountain. The noble one nurtures character by being thorough in all things. The spring does not leap to the valley in one bound. It fills each depression, seeps through each layer of stone, moves steadily and patiently. In the same way, we develop ourselves by attending to each small thing, skipping nothing. Character builds not in grand gestures but in the patient filling of every hollow place.",
      "lines": [
        "Releasing ignorance. Using punishment to correct, removing the shackles. But persisting in punishment leads to regret. There is a time for discipline, for breaking the hard crust of old habits. But punishment alone cannot teach—it only restrains. The goal is to remove the shackles from the mind, not add more. If all you do is punish, you create a prisoner, not a student.",
        "Embracing the ignorant with patience brings good fortune. Receiving even the simplest teachings. Like a son who can sustain his family. True strength is gentle. The one who teaches does not disdain the simplest question or the humblest student. Like a son who has matured enough to care for his parents, the wise one holds space for growth without judgment. This 包容 (bāoróng)—the capacity to contain and accept what is still forming.",
        "Do not take this one as a companion. Seeing gold, they forget themselves. Nothing fruitful comes. This line warns against those who have no center. They chase after glitter, lose themselves in every new opportunity, and cannot be relied upon. But it also speaks to us: do not let your wanting exceed your integrity. When you forget yourself in pursuit of gain, you become someone no one should trust.",
        "Bound in the chains of ignorance. Regret. This is the ignorance that comes from isolation. Cut off from those who are solid, stuck only with others who also don't know, the fool becomes entrenched. Regret follows—not as punishment, but as the natural consequence of refusing to grow.",
        "Childlike ignorance. Good fortune. Here is the innocence we started with, but now it's chosen, not accidental. Complete openness. The mind that does not already know, so it can actually learn. This is the fertile emptiness the Tao Te Ching speaks of—the vessel that can be filled because it is not already full. Good fortune indeed.",
        "Striking the ignorant. No advantage in injury. Advantage in warding off harm. When ignorance hardens into arrogance, there is a temptation to strike, to force understanding through violence. This never works—it only creates more resistance. Better to protect the fool from the consequences of their own folly where possible, while letting them learn at their own pace. You cannot beat wisdom into anyone."
      ],
      "trigrams": {
        "lower": {
          "name": "Kan (Water)",
          "nature": "Flowing, seeking its level, adapting"
        },
        "upper": {
          "name": "Gen (Mountain)",
          "nature": "Solid, patient, unmoving"
        },
        "description": "Water flows down the mountain, finding its way around rocks, filling crevices. The mountain simply is—still, present, allowing. The student flows; the teacher rests. Both are necessary."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The wise are not learned; the learned are not wise.' Hexagram 4 honors a certain kind of not-knowing. Not the ignorance that refuses to learn, but the innocence that remains open. The spring does not know where it's going—it only knows how to flow, and the mountain teaches it the way by simply being there."
    },
    {
      "number": 5,
      "name": "Waiting (需 - Xū)",
      "heart": "Clouds rising into heaven. Rain that has not yet fallen. Above, the vast openness of the sky; below, the gathering moisture. Nothing is wrong. Everything is exactly as it should be. But not yet complete. Waiting is not emptiness—it is fullness in suspension. The field does not curse the clouds for not releasing; it simply receives the shadow, the coolness, the promise. Waiting is the space between the promise and its fulfillment, and that space is sacred.",
      "ancient": {
        "chinese": "需。有孚，光亨，貞吉。利涉大川。",
        "rendering": "Waiting. If you are sincere, you have light and success. Perseverance brings good fortune. It furthers one to cross the great water."
      },
      "judgment": "There is a time when the only right action is to wait. Not passive waiting, not anxious waiting—but sincere waiting, trust-filled waiting. You have done what needed doing; now the clouds must fill in their own time. This waiting has a quality of light. It is not dark, not desperate. It is the patient expectancy of a farmer after planting, of a lover before meeting, of a painter before the first brushstroke. To wait with sincerity is to remain present, open, unforced. When the time ripens, you will cross the great water—the great difficulty—as if it were nothing, because you did not exhaust yourself against it too soon.",
      "image": "Clouds rise up to heaven. The noble one eats and drinks, feasts with family and friends. The image is striking: clouds rise, but the rain does not fall. What does the wise one do? They do not stare anxiously at the sky. They do not pace and fret. They gather with those they love, share food, rest, nourish themselves. The waiting period is not empty time—it is time for replenishment. The fields cannot be forced to drink; the rain will come when the clouds are ready. Until then, tend to the human things. Eat. Drink. Be with your people. This waiting is itself a kind of harvest.",
      "lines": [
        "Waiting in the meadow. It furthers one to abide in what endures. No blame. The meadow is open, grassy, peaceful—but exposed. You wait here, not yet in danger, but not yet sheltered. The key is to abide in what endures: your center, your practice, your connection to what is real beyond circumstance. Do not fill the waiting with distraction. Stay present in the open field, trusting that the enduring ground beneath you will hold.",
        "Waiting on the sand. There is some gossip. The end brings good fortune. The sand shifts, washes away. It is less stable than the meadow. Words begin—gossip, criticism, the small irritations of those who do not understand your waiting. The sand does not hold footprints well, and neither do their words. Do not grasp at them. Let the gossip wash away like tide on sand. The end brings good fortune because you did not let the small disturbances move you from your center.",
        "Waiting in the mud brings about the arrival of the enemy. Mud is not water and not land—it is the in-between that traps. If you wait here, in ambiguity, in half-measures, in the place where you are neither fully committed nor fully released, you attract what you do not want. The enemy arrives not because you are wrong, but because you are unclear. The mud itself calls them. If you find yourself here, recognize: the problem is not the enemy, but the muddy ground you chose.",
        "Waiting in blood. Get out of the pit. Blood means wounding, the cost of waiting too long in the wrong place. Perhaps you waited in the mud, and the enemy came. Perhaps you waited in the sand, and the gossip cut deeper than you admitted. Now you are wounded, in the pit. The only instruction is: get out. Not by heroic effort, but by seeing clearly that you cannot stay. The pit does not release you—you release the pit. Climb. Any direction that is up.",
        "Waiting at meat and drink. Perseverance brings good fortune. Here is the return to the image: clouds above, feast below. You have found your way back to nourishment. Not escape, not denial, but genuine replenishment. The waiting continues—the rain still has not fallen—but now you wait in the right way: surrounded by what sustains you, giving and receiving, resting in the presence of those who matter. This is not a retreat from the waiting; it is its deepest practice.",
        "You fall into the pit. Three uninvited guests arrive. Honor them, and in the end there is good fortune. Even after waiting well, after feasting, after climbing out—you can fall again. The pit is always there, somewhere. But now, when you fall, guests come. Not enemies, not gossip, not mud—guests. They arrive uninvited, unexpected. And the instruction is: honor them. These are the helpers sent by the waiting itself, the ones who appear when you are least in control. Honor them, and the pit becomes a doorway."
      ],
      "trigrams": {
        "lower": {
          "name": "Qián (Heaven)",
          "nature": "The creative, the strong, the power to act"
        },
        "upper": {
          "name": "Kǎn (Water)",
          "nature": "The abysmal, danger, rain gathering"
        },
        "description": "Heaven below, water above. Strength waiting under danger. The creative power is present, fully capable of action, but above it hangs the abyss, the rain not yet fallen. This is not weakness—it is appropriateness. The strong one knows when to let the clouds gather. The water above is not a threat to heaven; it is heaven's nourishment, coming in its own time. The strong wait because they are strong enough to wait."
      },
      "taoist_reflection": "The Tao Te Ching says: 'Do you have the patience to wait till your mud settles and the water is clear? Can you remain unmoving till the right action arises by itself?' Hexagram 5 is the answer: yes. Waiting is not the absence of action—it is the deepest form of trust. The clouds do not struggle to become rain; they simply gather, thicken, darken, until their weight becomes release. Your waiting is the same. You are not stuck; you are gathering. You are not passive; you are filling. When the clouds are ready, the rain falls without effort. When you are ready, the great water will be crossed as if it were always already crossed. Until then, eat. Drink. Be with your people. The rain knows its time."
    },
    {
      "number": 6,
      "name": "Conflict (訟 - Sòng)",
      "heart": "Heaven above, water below. The upward drive of the creative, the downward pull of the abyss. They move against each other, not together. This is conflict—not necessarily war, but opposition, friction, the grating of two forces that cannot yet align. It arises when waiting fails, when patience is exhausted, when the clouds refuse to release and the earth grows dry. Conflict is not evil; it is the natural result of misalignment. But like fire, it can warm or it can burn.",
      "ancient": {
        "chinese": "訟。有孚窒惕，中吉，終凶。利見大人。不利涉大川。",
        "rendering": "Conflict. You are sincere but blocked. Be cautious in the middle, good fortune; to the end, misfortune. It furthers one to see the great person. It does not further one to cross the great water."
      },
      "judgment": "You feel the blockage. Your sincerity, your genuine intention, meets resistance. The other does not hear, does not yield. In the middle of conflict, if you remain conscious, there can be good fortune—not because you win, but because you learn. But if you pursue conflict to the end, seeking victory, seeking to be right, misfortune follows. The wise one, when conflict arises, seeks out the great person—the one who sees clearly, who holds the center. Do not try to cross the great water now. The crossing requires trust, and trust is what conflict has eroded. Wait. See the great person. Let their clarity become yours.",
      "image": "Heaven and water go their opposite ways. The noble one begins every undertaking with careful consideration. Heaven rises, water descends. Their paths diverge. This is the image of conflict: two forces moving in opposite directions. What can the noble one learn from this? To begin every undertaking with careful consideration. Before action, before commitment, weigh the direction. If two are to go together, they must first align. If alignment is not possible, better to know before the journey begins than to fight over which way to turn halfway through.",
      "lines": [
        "Do not perpetuate the conflict. There is some gossip, but in the end it is good fortune. The conflict is small, a whisper, a misunderstanding. Do not feed it. If you let it drop, it will dissolve. The gossip is like a spark—if you do not add fuel, it dies. To perpetuate it would be to make it real. Let it go, and good fortune follows.",
        "Unable to contend, return and flee. The people of his town, three hundred households, are without blame. There are battles you cannot win, conflicts you cannot resolve. To recognize this is not cowardice; it is wisdom. Return, flee, not in shame but in clarity. The people of your place—your community, your true companions—will understand. They do not blame you for refusing a fight that could only destroy. Survival is sometimes the highest virtue.",
        "Feed on old virtue. Perseverance brings danger. In the end, good fortune comes. If you follow the king's business, do not seek glory. Old virtue—what you have built before, the integrity you have already cultivated—can sustain you for a time. But if you rely on it alone, and persevere in conflict, danger comes. The line advises: in the midst of conflict, do not seek to be seen, to be honored. Do your work quietly. Let the old virtue be your ground, not your banner. In the end, good fortune comes because you did not make yourself a target.",
        "Unable to contend, you return and change your purpose. You find peace in perseverance. Good fortune. The conflict has shown you that your original aim was not possible, not right, not yours. So you return, not defeated but redirected. You change your purpose. This is not surrender; it is adaptation. Water does not fight the rock; it flows around it, and in flowing, finds its way to the sea. To find peace in perseverance—the perseverance of the changed course—is good fortune indeed.",
        "Contending before him. Supreme good fortune. Here, the great person appears. You bring your conflict before one who sees clearly, who holds no personal stake. In their presence, the truth emerges, and the conflict resolves not by victory but by clarity. This is supreme good fortune: to be seen truly, to have the knot untied by a steady hand. The great person does not take sides; they reveal the center.",
        "Even if by chance you receive the leather belt, by the end of the morning it will have been snatched from you three times. The leather belt is a symbol of rank, of victory, of having won. But in conflict, winning is not possessing. What you gain through contention you cannot hold. By the end of the morning—quickly, inevitably—it is taken. Three times, meaning completely. This is the ultimate teaching of Conflict: there is no victory in it that lasts. The only true resolution is the one that restores alignment, not the one that proves you right."
      ],
      "trigrams": {
        "lower": {
          "name": "Kǎn (Water)",
          "nature": "The abysmal, dangerous, flowing downward"
        },
        "upper": {
          "name": "Qián (Heaven)",
          "nature": "The creative, strong, moving upward"
        },
        "description": "Water below, heaven above. Water wants to descend, heaven wants to rise. They move in opposite directions. This is the geometry of conflict—not evil, but misalignment. The danger of water meets the strength of heaven. When forces pull apart, friction arises. The wise one reads this image and knows: before acting, consider direction. If two are to go together, they must first align."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The best warriors are not violent. The best fighters do not lose their temper. The greatest conquerors do not engage.' Hexagram 6 is the teaching of non-engagement. Not because you are weak, but because you understand that conflict, once entered, has its own momentum. It carries you toward the leather belt that will be snatched away by morning. The wise one does not win—they align. If alignment is not possible, they wait. If waiting is not possible, they seek the great person. Only when clarity replaces contention does the great water become crossable. The Tao does not fight; it flows around obstacles. In the end, the rock is still there, but the water has reached the sea."
    },
    {
      "number": 7,
      "name": "The Army (師 - Shī)",
      "heart": "Water flowing underground. Hidden, unseen, but moving with purpose. Above, the earth; below, the stream that nourishes it. This is the army—not the visible force, but the disciplined structure that supports from beneath. The army is not war; it is organization. It is the capacity to act together, to move as one, to bring order out of chaos. The true leader does not stand above, waving banners. They flow underground, unseen, making the earth fertile.",
      "ancient": {
        "chinese": "師。貞，丈人吉，无咎。",
        "rendering": "The Army. Perseverance. The old man brings good fortune. No blame."
      },
      "judgment": "There are times when collective action is necessary. Not for conquest, not for glory—but for protection, for order, for the survival of what matters. In such times, the leader must be like the old man: experienced, calm, without personal ambition. They do not seek the army; the army seeks them. They lead not because they want power, but because they know how to serve. Perseverance here means staying true to the purpose, not getting drunk on the power. If the leader remains a channel, not a source, there is good fortune and no blame.",
      "image": "Water flows underground. The noble one nurtures the people with generosity and protects them from harm. Water underground is invisible, but without it, the earth would be barren. The noble one, like this hidden water, nurtures without showing. They are generous—not with display, but with steady, reliable support. They protect—not with force visible, but with structure that holds. The army at its best is not seen; it is felt in the order it maintains, the safety it provides, the fields it allows to be planted in peace.",
      "lines": [
        "The army goes forth in proper order. If not, misfortune threatens. The first movement must be correct. Every step, every command, every soldier must know their place. Discipline is not punishment—it is the shared understanding that allows many to act as one. If the order is not proper, if there is confusion or favoritism, misfortune follows not as judgment but as consequence. The army that marches in chaos defeats itself before it meets any enemy.",
        "In the midst of the army, good fortune. No blame. The king bestows a triple commendation. The leader is not above the army; they are in its midst. They do not command from a distance, safe and separate. They are present, sharing the conditions, bearing the same risks. This presence is itself good fortune—the army feels it, trusts it. The king bestows triple commendation not because the leader sought it, but because true leadership, when witnessed, naturally calls forth honor. The leader accepts it without grasping.",
        "The army may carry corpses in the wagon. Misfortune. When the leader is weak, when they try to command without capacity, the army carries corpses—dead weight, useless orders, hollow authority. The wagon, meant for supplies, becomes a hearse. This is misfortune not because the enemy is strong, but because the leader is not. Better to have no army than an army led by one who cannot lead.",
        "The army retreats. No blame. There is no shame in knowing when advance is not possible. The army that retreats in good order, preserving its strength, its cohesion, its purpose, commits no fault. The blame is not in the movement but in the motivation. If retreat is strategy, it is wisdom. If retreat is fear disguised, it will show. The line does not judge; it observes. The wise commander knows the difference.",
        "There is game in the fields. It furthers one to capture them. No blame. The eldest son leads the army. The younger piles up corpses. Perseverance brings misfortune. When the purpose is clear—game in the fields, sustenance for the people—it is right to act. The eldest son, the capable one, leads. But if the younger, the unprepared, tries to take charge, they pile up corpses—waste, failure, unnecessary death. To persevere in this error brings misfortune. Know who should lead. Let them lead.",
        "The great ruler issues commands, founds states, invests families. Inferior people should not be employed. After the work is done, after the army has served its purpose, the great ruler returns to the ways of peace. They found states, not garrisons. They invest families, not soldiers. They issue commands for life, not death. And in all this, they remember: inferior people—those who love war, who seek power, who would make the army their career—should not be employed. The army exists to make itself unnecessary. The leader who forgets this becomes the very thing they were meant to oppose."
      ],
      "trigrams": {
        "lower": {
          "name": "Kǎn (Water)",
          "nature": "The abysmal, dangerous, hidden power"
        },
        "upper": {
          "name": "Kūn (Earth)",
          "nature": "The receptive, yielding, supportive ground"
        },
        "description": "Water underground. The hidden stream that nourishes the earth without showing itself. This is the true nature of organized force: not the visible army, but the discipline that flows beneath, making collective action possible. The water is dangerous—it can flood, it can drown—but underground, it is life. The army, when rightly led, is the same: hidden, disciplined, life-giving."
      },
      "taoist_reflection": "The Tao Te Ching says: 'A good leader is one who, when the work is done, the people say, \"We did this ourselves.\"' Hexagram 7 is the manual for that kind of leadership. The army that flows underground, unseen, does not need to be seen to be effective. The leader who is in the midst, not above, does not need to be praised to be followed. When the battle is over, when the state is founded, when the families are invested, the people do not say, 'What a great general.' They say, 'We did this. We were safe. We were fed. We lived.' And the leader, like water underground, has already moved on to the next place that needs nourishing. This is the highest art of the army: to make itself unnecessary, to return to the earth, to let the fields speak for themselves."
    },
    {
      "number": 8,
      "name": "Holding Together (比 - Bǐ)",
      "heart": "Water flowing to the earth. Not forced, not pushed—simply seeking its own level, finding the low places, joining with what is already there. This is holding together: the natural affinity that draws like to like, that creates community not by decree but by mutual recognition. The army organized; now it must unite. Not through command, but through the quiet gravity of shared purpose.",
      "ancient": {
        "chinese": "比。吉。原筮元永貞，无咎。不寧方來，後夫凶。",
        "rendering": "Holding Together brings good fortune. Consult the oracle further for the sublime, enduring perseverance, and no blame. Those who are uncertain gradually join. Those who come too late meet misfortune."
      },
      "judgment": "Good fortune. Not because holding together is easy, but because it is natural. Water seeks earth; earth receives water. This is the way of things. To hold together with others who share your center is not a compromise—it is a completion. Consult deeply before committing. Do not rush into alliance. Let the sublime, enduring perseverance guide you: is this true? Will it last? Can you give yourself to it without losing yourself? Those who are uncertain will come in their own time, drawn by the same gravity that brought you. But those who come too late, who wait until the bond is already formed and try to force their way in, meet misfortune. The circle closes. Timing is part of truth.",
      "image": "On the earth, water. The noble ones of old gave to the various kingdoms, befriended the feudal lords. Water on earth: it seeks the low places, fills the hollows, connects what is separate. The ancient rulers understood this image. They did not conquer; they gave. They did not control; they befriended. They honored the existing bonds of the kingdoms, the natural alliances of the lords. Holding together is not about creating bonds where none exist—it is about recognizing and honoring the bonds that are already there, and adding to them generously.",
      "lines": [
        "Hold to him in truth and loyalty. No blame. This truth is like the heart of the earth—steady, unmoving, reliable. In the beginning of any alliance, there is only this: truth and loyalty. Not grand promises, not elaborate contracts. Just the simple, unwavering commitment to be real with each other. From this, all else grows. No blame follows such a beginning.",
        "Hold to him inwardly. Perseverance brings good fortune. The bond is not for display. It does not need witnesses or ceremonies. It is inward, felt in the depths, known without being spoken. To hold inwardly is to carry the other in your heart, to be connected even when apart, to act in the world with their presence as a silent companion. This inward holding, if persevered in, brings good fortune—not as reward, but as the natural flowering of deep connection.",
        "You hold to such as are not your own kind. The bond you seek is with those who do not share your center, your values, your way. This is not necessarily wrong—sometimes we are called to bridge differences. But it is difficult, and the line offers no judgment, only observation. If you hold to those not your own kind, you must be prepared for the friction, the misunderstanding, the constant translation between worlds. It can be done, but it is not the same as the water-seeking-earth of true affinity.",
        "Outwardly holding to him. Perseverance brings good fortune. Sometimes the bond begins on the outside—through shared work, shared circumstance, shared necessity. This is not shallow; it is the path by which many deep alliances form. The farmer who helps the neighbor build a barn, the soldier who fights beside a stranger, the parent who meets another at the school gate—outward holding can become inward, over time, through perseverance. Good fortune follows not because the bond was deep from the start, but because it was given the chance to deepen.",
        "Manifestation of holding. The king takes the hunt in the encircling park. Those who come from within are not caught. Those who come from without are caught. The hunt: the king circles the game, driving it toward the center. But those who are already within the circle, who belong there by nature, are not caught—they are recognized. Those who come from without, who do not belong, are caught. This is the discernment of true holding. Not exclusion, but clarity. The circle knows who is inside and who is not. The king does not decide; the circle reveals.",
        "He finds no head for holding. Misfortune. To hold together without a head—without a center, without a leader, without a shared focal point—is to be a body without a spine. The bond dissolves into confusion. Each pulls in their own direction. What was meant to unite becomes a source of fragmentation. This is misfortune not because heads are necessary for their own sake, but because without one, the holding has nothing to hold to."
      ],
      "trigrams": {
        "lower": {
          "name": "Kūn (Earth)",
          "nature": "The receptive, yielding, the ground that receives"
        },
        "upper": {
          "name": "Kǎn (Water)",
          "nature": "The abysmal, dangerous, flowing water"
        },
        "description": "Water on earth. The water flows to the earth, finding the low places, filling the hollows, creating lakes and rivers and wetlands. This is not conquest—it is affinity. The earth does not resist the water; it receives it. The water does not force the earth; it seeks it. Their holding together is the most natural thing in the world. And from their union, life springs forth in abundance."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The highest goodness is like water. Water benefits all things and does not contend. It stays in lowly places that others despise. Thus it is near the Tao.' Hexagram 8 is water finding its level—not by contending, but by flowing. The bonds that hold are not forced; they are discovered. You do not create community; you recognize it. You do not manufacture loyalty; you embody it. Like water finding earth, you simply go where your nature leads, and there you find your people. Those who come late, who try to join after the bond is formed, meet misfortune—not because they are excluded, but because they mistook timing. The water was already there, already flowing. The wise one arrives when the water is still gathering, not after it has found the sea."
    },
    {
      "number": 9,
      "name": "Small Taming (小畜 - Xiǎo Chù)",
      "heart": "Wind moving across the sky. Invisible, yet gathering clouds. Unseen, yet bending trees. This is the small taming—not the dramatic victory, not the grand gesture, but the steady, patient influence that shapes things from within. The wind does not fight the sky; it moves through it. And in its moving, it gathers, accumulates, prepares. Something is being tamed here, but gently. Like training a young plant to grow straight, like teaching a stream to flow without flooding. Small taming, large results—but only if you do not rush.",
      "ancient": {
        "chinese": "小畜。亨。密雲不雨，自我西郊。",
        "rendering": "Small Taming has success. Dense clouds, no rain from our western region."
      },
      "judgment": "Success comes, but not through force. The clouds are dense, heavy with promise, but the rain has not yet fallen. This is the moment of gathering, of accumulating, of preparing. Do not mistake the delay for failure. The small taming is working—invisible, patient, persistent. Your influence is being felt, your actions are accumulating, but the result is not yet visible. Trust the process. The rain will fall when the clouds are full enough. Your western region—the place you come from, your own ground—has not yet released its fullness. Wait. Gather. Tame the small things, and the large will follow.",
      "image": "Wind moves across the sky. The noble one refines the outer appearance of their virtue. Wind across the sky: it touches everything, but changes nothing by force. It cools, it moves, it prepares. In the same way, the noble one refines their outer expression of virtue. Not the inner essence—that is already there. But the way it appears, the way it meets the world, the way it influences without forcing. This is the small taming: making your virtue accessible, attractive, gentle. Like wind, you cannot be seen, but you can be felt.",
      "lines": [
        "Return to the way. How could there be blame? Good fortune. You have wandered, perhaps, or simply forgotten. Now you return—not with fanfare, not with struggle, but with a quiet turning. This return is itself the first act of small taming. You do not need to fix everything at once. Just return. The way is still there, waiting. Good fortune follows not because you have achieved much, but because you have turned toward what is real.",
        "Allow yourself to be drawn back. Perseverance brings good fortune. Sometimes returning is not something you do—it is something you allow. You are drawn, pulled by invisible forces, by the accumulated weight of your own deeper knowing. Do not resist. Let yourself be drawn back to the center, to the practice, to the relationship, to the work. This allowing, this gentle yielding to the pull of what is right, is itself a form of taming. Persevere in this allowing, and good fortune follows.",
        "The wagon loses its axle. Husband and wife roll their eyes. When the connection breaks—the axle that held the wheels, the trust that held the marriage—movement stops. The wagon cannot go forward. The couple cannot see each other. This is what happens when small tamings are neglected, when the gentle accumulations are ignored. The breakdown seems sudden, but it was prepared by a thousand small omissions. The line does not despair; it observes. If you find yourself here, do not try to force the axle back in. First, see what was neglected. Then, begin again—with the smallest things.",
        "If you are sincere, blood vanishes and fear gives way. No blame. Sincerity is the most powerful small taming. Not loud promises, not dramatic gestures—just the steady, quiet truth of who you are and what you intend. When you are sincere, blood—conflict, wounding—vanishes. Not because you fought and won, but because your sincerity made fighting unnecessary. Fear gives way, not to courage, but to clarity. In the presence of genuine sincerity, there is nothing to fear. No blame follows such a life.",
        "If you are sincere and loyally attached, you are rich in your neighbor. The small taming works through closeness, through loyalty, through the quiet bonds that tie you to those around you. You become rich not in gold, but in neighbor—in the presence of those who know you, trust you, walk with you. This is wealth that cannot be stolen, that does not depreciate, that grows with every small act of loyalty. The sincere person, loyally attached, lacks nothing that matters.",
        "The rain comes, the rain rests. The full harvest is at hand. If you are sincere, the moon is nearly full. But if the superior person persists in their course, misfortune threatens. The clouds have finally released. The rain falls, then rests. The harvest is nearly ready. The moon is almost full. This is the moment of near-completion, the most dangerous time. If you persist now, if you try to push the last inch, to force the final drop, you invite misfortune. The small taming teaches: even at the threshold of fulfillment, remain gentle. The rain knows when to stop. The moon does not struggle to be full. Let completion come of itself."
      ],
      "trigrams": {
        "lower": {
          "name": "Qián (Heaven)",
          "nature": "The creative, the strong, the power to act"
        },
        "upper": {
          "name": "Xùn (Wind)",
          "nature": "The gentle, penetrating, the power to influence"
        },
        "description": "Heaven below, wind above. The creative power, strong and unwavering, lies beneath. Above it, the wind moves—gentle, persistent, penetrating. This is the small taming: strength tempered by gentleness, power guided by influence. The wind does not command heaven; it moves across it, gathering clouds, preparing rain. Heaven does not resist the wind; it receives it, lets it do its work. When strength and gentleness work together, the small tames the great."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The softest thing in the world rides over the hardest thing in the world. That which has no substance enters where there is no space. Thus I know the value of non-action.' Hexagram 9 is the living proof. Wind, the softest thing, moves across heaven, the hardest, and gathers clouds. It does not fight; it penetrates. It does not command; it influences. This is the small taming: not the force that breaks, but the gentleness that shapes. The rain falls when the clouds are ready, not when heaven demands it. The harvest comes when the grain is ripe, not when the farmer wills it. In your own life, the small taming works the same way. Be sincere. Be loyal. Be gentle. Let the small things accumulate. And when the rain comes, let it rest. The moon is nearly full. Do not reach for it. It will reach you."
    },
    {
      "number": 10,
      "name": "Treading (履 - Lǚ)",
      "heart": "Stepping on the tail of a tiger. The danger is real—the tiger could turn, could bite, could end you. But it does not. Not because you are lucky, but because you tread correctly. Your step is light, your intention pure, your awareness complete. The tiger feels no threat, so it does not react. This is treading: walking through a dangerous world with such presence, such alignment, that even the tiger lets you pass. The path is narrow, but it is there. And you are walking it.",
      "ancient": {
        "chinese": "履虎尾，不咥人，亨。",
        "rendering": "Treading on the tail of the tiger. It does not bite the person. Success."
      },
      "judgment": "The world is full of tigers—dangers, conflicts, powers greater than you. To walk through it without being bitten is not a matter of luck; it is a matter of tread. How do you step? Are you heavy, arrogant, unaware? Then the tiger will turn. Are you light, humble, present? Then it will let you pass. Success comes not from conquering the tiger, but from walking in such a way that the tiger does not feel threatened. This is the art of treading: to move through danger without provoking it, to be in the world without disturbing it, to follow the path so precisely that even the tiger respects your passage.",
      "image": "Heaven above, the lake below. The noble one distinguishes between high and low, and thus settles the will of the people. Heaven above, the lake below—the highest and the lowest, the most exalted and the most humble. Between them, all the levels of existence. The noble one looks at this image and understands: to tread correctly, you must see clearly. Distinguish what is high from what is low, what is worthy from what is base, what is lasting from what is fleeting. Not to judge, but to orient. When you see clearly, your will settles. When your will settles, your tread becomes steady. And the people, watching you, find their own will settled. This is leadership through right treading.",
      "lines": [
        "Treading in the simple way. Going forward without blame. The simplest path is the best. Not clever, not devious, not ambitious—just simple, direct, honest. You tread in the way that requires no explanation, no justification, no defense. This simplicity itself protects you. Going forward on this path, there is no blame. The tiger sees you coming, sees your simplicity, and does not bite. There is nothing to fear in one who has nothing to hide.",
        "Treading a smooth, level path. The perseverance of a dark person brings good fortune. The path is smooth, even, easy. This is not the time for great ambition or dramatic action. It is the time for steady, quiet perseverance—the perseverance of the dark person, the one who does not seek attention, who works in the shadows, who tends what is theirs without needing to be seen. This dark perseverance brings good fortune because it does not disturb the tiger. It simply walks, steadily, levelly, and the tiger sleeps on.",
        "A one-eyed person can see, a lame person can tread. But both tread on the tail of the tiger and are bitten. Misfortune. This is the warrior acting for the great ruler. You have some ability—one eye sees, one leg walks—but not enough. You go forward anyway, and the tiger bites. The misfortune is not in your limitation; it is in your failure to recognize it. The warrior who acts for the great ruler must see clearly, must tread steadily. If you cannot, do not act. Wait. Heal. Find another way. The tiger does not make exceptions for good intentions.",
        "Treading on the tail of the tiger. Caution and care lead to good fortune in the end. Finally, you are treading directly on the tail. Not near it, not beside it—on it. The danger is maximum, the risk absolute. But you are cautious, careful, fully present. Every step is measured, every breath conscious. Because of this, the tiger does not bite. In the end, good fortune follows—not because the danger passed, but because you met it with such complete awareness that it could not harm you. The tiger is still there. You are still on its tail. But you are treading correctly, so you pass.",
        "Treading decisively. Perseverance brings danger. You have reached a point where decision is required. Not hesitation, not caution—decisive tread. But the line warns: perseverance in this decisiveness brings danger. Because decisiveness, if prolonged, becomes rigidity. The tiger feels your hardness and stirs. The wise one knows when to be decisive and when to yield. If you must tread decisively, do it, then soften. Do not make a habit of it. The tiger respects flexibility more than force.",
        "Look to your conduct and weigh the signs. When the cycle is complete, there is supreme good fortune. The end of the journey. You have trodden the whole path, through simplicity, through darkness, through danger, through decision. Now look back. Weigh your conduct. Read the signs your own passage has left. The cycle is complete—not because you reached a destination, but because you have walked the whole way with awareness. This looking back, this weighing, this completion—this is supreme good fortune. Not the fortune of arrival, but the fortune of having trodden well."
      ],
      "trigrams": {
        "lower": {
          "name": "Duì (Lake)",
          "nature": "The joyful, the reflective, the still water that mirrors"
        },
        "upper": {
          "name": "Qián (Heaven)",
          "nature": "The creative, the strong, the power above"
        },
        "description": "Lake below, heaven above. The lake reflects heaven—still, clear, mirroring the vastness above. This is treading: the humble reflecting the exalted, the low mirroring the high. The lake does not try to become heaven; it simply reflects it. In its reflection, it contains the whole sky. In your treading, you do not need to become the tiger or the mountain or the king. You need only reflect what is above with such clarity that your step becomes true. The lake is safe because it does not threaten; it reflects. You are safe when you tread with the same humble clarity."
      },
      "taoist_reflection": "The Tao Te Ching says: 'Those who know do not speak. Those who speak do not know. Block the passages, shut the doors, blunt the sharpness, untangle the knots, soften the glare, become one with the dust.' Hexagram 10 is the teaching of becoming dust. The tiger does not bite the dust; it walks over it, through it, past it. When you are truly humble, truly present, truly without threat, you become like dust—so ordinary, so unremarkable, so completely what you are that no tiger notices you. Yet the dust is everywhere. It is on the path, on the tiger's tail, on the mountain and the valley. To tread correctly is to be everywhere and nowhere, to be so completely yourself that you pose no threat to anything, and therefore nothing threatens you. The tiger sleeps. The path opens. You walk."
    },
    {
      "number": 11,
      "name": "Peace (泰 - Tài)",
      "heart": "Heaven and earth in union. The sky above, the earth below, and between them, all things flourish. Not because the sky conquers the earth, not because the earth resists the sky—but because they meet, they exchange, they give to each other. Heaven's light descends, earth's warmth rises. In their meeting, life happens. This is peace: not the absence of movement, but the perfect harmony of all movements. The small departs, the great approaches. Everything is in its right place, flowing as it should.",
      "ancient": {
        "chinese": "泰。小往大來，吉亨。",
        "rendering": "Peace. The small departs, the great approaches. Good fortune. Success."
      },
      "judgment": "The small departs—the petty, the fearful, the constricted. The great approaches—the expansive, the generous, the true. This is the movement of peace. Not something you force, but something you allow. Heaven and earth are already in union; your task is to align with them. When you do, good fortune follows not as reward, but as nature. Success comes not because you struggled, but because you stopped struggling and let the great approach. In this time of peace, do not grasp. Do not push. Receive. Give. Let the flow carry you. The small will continue to depart; the great will continue to approach. This is the rhythm of peace.",
      "image": "Heaven and earth in union. The ruler gives, the people receive. Heaven and earth meet: the sky sends down rain, the earth sends up vapor. They exchange, they mingle, they create. The wise ruler looks at this image and understands: ruling is not taking; it is giving. They give wealth to the people, and the people receive it. They give trust, and the people return it. They give space, and the people fill it with life. This is the economy of peace: the more you give, the more there is. The more you receive, the more you can give. Heaven and earth do not hoard; they exchange. So does the wise one.",
      "lines": [
        "When you pull up rushes, other stalks come with them. Setting forth brings good fortune. Pull one rush, and the whole clump comes with it. This is the nature of peace: everything is connected. When you set forth on the right path, you do not go alone. Others are drawn with you—not by force, but by the natural pull of alignment. Your setting forth itself brings good fortune because it moves not just you, but the whole field. In peace, no one walks alone.",
        "Embrace the river reeds. Let them grow. Do not cut them down. In the time of peace, the small things are allowed to grow. The river reeds—humble, ordinary, overlooked—are embraced. They need not become oaks; they are perfect as reeds. This is the wisdom of peace: not everything must be great. Not everything must be useful. Some things are simply allowed to be what they are. Embrace them, and let them grow. In their growing, they contribute to the peace.",
        "No plain without a slope, no going without a return. In hardship, persevere and find no blame. Do not mourn this truth; it is not failure, it is nature. Even in peace, there is no plain without a slope. No going that does not eventually return. The cycle continues—heaven and earth never stop their dance. When hardship comes, as it will, persevere. Not by fighting, but by remembering: the slope is part of the plain. The return is part of the going. In this remembering, there is no blame. Peace includes its own passing.",
        "Fluttering, fluttering. Not rich, you neighbor. Not warned, you trust. The image is of a bird fluttering, restless, unsettled. You are not rich—not in resources, not in virtue—yet you ignore your neighbor's example. You are not warned, yet you trust your own judgment anyway. This is the danger in peace: complacency. Because all is well, you stop learning, stop watching, stop heeding. The fluttering bird thinks it flies, but it only flutters. In peace, stay grounded. Stay teachable.",
        "The sovereign gives his daughter in marriage. Such blessing brings supreme good fortune. In peace, even the highest gives to the lowest. The sovereign's daughter marries into a humble family—not a loss of status, but a completion of the whole. This is the blessing of peace: that what is above flows down, and what is below rises up, and in their meeting, both are blessed. Supreme good fortune follows not because the match is advantageous, but because it is true.",
        "The wall falls back into the moat. Do not use the army. In your own city, commands come from the common people. Perseverance brings danger. The cycle completes. The wall that protected the city falls back into the moat that surrounded it. Defenses become debris. In this moment, do not use the army—do not try to force control. Commands now come from the common people, not from above. The time of peace has passed, and the time of returning has begun. Perseverance here, trying to hold onto peace, brings danger. Let the wall fall. Let the moat receive it. Something new will rise from the rubble."
      ],
      "trigrams": {
        "lower": {
          "name": "Qián (Heaven)",
          "nature": "The creative, the strong, the power above"
        },
        "upper": {
          "name": "Kūn (Earth)",
          "nature": "The receptive, the yielding, the ground below"
        },
        "description": "Heaven below, earth above. This inversion is the secret of peace: heaven, which belongs above, places itself below. Earth, which belongs below, places itself above. They exchange places, they meet, they mingle. Heaven does not insist on being above; it descends. Earth does not insist on being below; it rises. In their mutual yielding, true peace is born. The strong makes itself weak, and the weak makes itself strong. This is the holy marriage of heaven and earth."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The highest good is like water. Water benefits all things and does not contend. It stays in lowly places that others despise. Thus it is near the Tao.' Hexagram 11 is water's fullest expression—heaven itself descending to the lowly places, earth itself rising to meet it. This is peace: not the stillness of death, but the dance of life. Heaven gives itself to earth; earth gives itself to heaven. They do not contend; they complete. In your own life, peace comes when you stop insisting on your place and start flowing to where you are needed. When you descend, you are raised. When you yield, you are filled. The small departs, the great approaches—not because you chased it, but because you made yourself ready to receive it. This is the peace that passes understanding, and it is yours now."
    },
    {
      "number": 12,
      "name": "Standstill (否 - Pǐ)",
      "heart": "Heaven withdraws, earth sinks. They no longer meet. The creative power recedes into distance; the receptive ground grows cold and hard. Between them, nothing moves. This is standstill—not the peace of harmony, but the stillness of separation. The great departs, the small approaches. Communication ceases, growth stops, the fields lie fallow. And yet, even in this barren time, there is wisdom. The noble one does not fight the standstill; they wait, they preserve, they tend what cannot be taken away.",
      "ancient": {
        "chinese": "否之匪人，不利君子貞，大往小來。",
        "rendering": "Standstill. It is not favorable for the superior person to persevere. The great departs, the small approaches."
      },
      "judgment": "There are times when the world closes in, when the channels of connection dry up, when everything you reach for recedes. This is standstill. Do not mistake it for your failure. The great departs—the vision, the inspiration, the support—and the small approaches—the petty, the constricting, the draining. In such a time, perseverance in the usual sense is not favorable. To push against the standstill only exhausts you. Instead, withdraw. Not in defeat, but in preservation. Tend what is yours alone: your integrity, your inner quiet, your connection to what is real beyond circumstance. The standstill will pass, as all things pass. When it does, you will be ready, because you did not waste yourself against it.",
      "image": "Heaven and earth do not unite. The noble one falls back upon inner worth and avoids difficulty. They do not accept salary. Heaven above, earth below—but they do not meet. No rain falls, no vapor rises. The fields are barren. The noble one looks at this image and understands: when the world will not receive you, do not force your way in. Fall back upon inner worth—the value that needs no external validation. Avoid difficulty—not by hiding in fear, but by recognizing that this is not your time. Do not accept salary—do not seek reward from a world that is not in rhythm with you. The standstill is a time for inner cultivation, not outer achievement.",
      "lines": [
        "When the grass is pulled, other stalks come with it. Perseverance brings good fortune. Success. Even in standstill, when you pull one stalk of grass, the others come with it. But here, the pulling is not for growth; it is for clearing. The weeds of confusion, of false hope, of misplaced effort—pull them, and they come with their kind. Perseverance in this clearing brings good fortune. Not success in the outer world, but success in preparing the ground for when heaven and earth meet again.",
        "They bear and endure. Good fortune for the common people. In standstill, the common people—those who cannot simply withdraw, who must continue to live, to work, to care for others—bear and endure. They do not have the luxury of retreat. And yet, in their bearing, there is a quiet good fortune. Not the good fortune of flourishing, but the good fortune of survival, of holding the line, of keeping the human things alive until better times come. This line honors them. It says: your endurance matters.",
        "They bear shame. The shame is not yours. In standstill, you may be blamed for what is not your fault. The world, frustrated and closed, looks for someone to hold responsible. You may bear shame—publicly, privately—but the line says clearly: the shame is not yours. Do not internalize it. Do not defend against it. Let it pass over you like weather. Your worth is not diminished by the world's misperception. Bear the shame, but do not carry it.",
        "Those who act in accordance with the decree are without blame. Those of like mind enjoy blessing. Even in standstill, there is a decree—a natural order, a way that is in accord with what is real. If you act in accordance with this deeper law, you are without blame. And you will find others who also follow this decree, those of like mind, and together you will enjoy a blessing that the standstill cannot touch. Not the blessing of outward success, but the blessing of true connection in a time of separation.",
        "Standstill comes to an end. Good fortune for the great person. But beware: 'It perishes, it perishes, thus tie it to a cluster of mulberry shoots.' The standstill will end. It always does. For the great person—the one who has preserved inner worth, who has waited without wasting—this ending brings good fortune. But the warning is urgent: 'It perishes, it perishes.' Do not assume the end is permanent. Tie your fortune to something resilient, like mulberry shoots that can bend without breaking. Be ready for the standstill to return, for all things cycle. Prepare, not in fear, but in wisdom.",
        "The standstill is overturned. First standstill, then good fortune. The cycle completes. What was closed opens. What was separated meets. The standstill is overturned—not by force, but by the natural return of heaven and earth to each other. First standstill, then good fortune. The order is important: you cannot have the good fortune without having first endured the standstill. The overturning is not a reward; it is a result. You endured, you preserved, you waited. Now the meeting returns, and you are ready to receive it."
      ],
      "trigrams": {
        "lower": {
          "name": "Kūn (Earth)",
          "nature": "The receptive, yielding, sinking down"
        },
        "upper": {
          "name": "Qián (Heaven)",
          "nature": "The creative, strong, withdrawing upward"
        },
        "description": "Earth below, heaven above—but they do not meet. Earth sinks into itself; heaven rises away. Between them, an empty space, a vacuum. No exchange, no nourishment, no life. This is the geometry of standstill: each element retreats into its own pole, and the middle ground, where growth happens, is abandoned. The noble one sees this and understands: when the world is divided, do not try to bridge the gap by force. Instead, cultivate your own ground. Let heaven withdraw; let earth sink. Your work now is interior."
      },
      "taoist_reflection": "The Tao Te Ching says: 'When the great Tao is forgotten, kindness and morality arise. When wisdom and intelligence are born, great hypocrisy appears. When the six family relationships are out of harmony, filial piety and parental love arise. When the country is in chaos, loyal ministers appear.' Hexagram 12 is the time when the great Tao is forgotten, when wisdom and intelligence become hypocrisy, when relationships are out of harmony. It is the time of standstill—and it is precisely then that the virtues we most value appear. Not as solutions, but as signs of what is missing. The noble one in standstill does not try to fix the world; they embody the virtue that the world has forgotten, knowing that their embodiment itself is a seed for when heaven and earth meet again. The standstill is not eternal. The Tao always returns. Wait. Preserve. Be the seed."
    },
    {
      "number": 13,
      "name": "Fellowship (同人 - Tóng Rén)",
      "heart": "Fire and heaven. Flame rising to meet the sky, light calling to light. This is fellowship—not the bonds of blood or obligation, but the spontaneous recognition of shared brightness. Those who see the same truth, who burn with the same fire, who recognize each other across any distance. In fellowship, you are not alone, even in the darkest field, because somewhere, someone sees the same stars.",
      "ancient": {
        "chinese": "同人于野，亨。利涉大川，利君子貞。",
        "rendering": "Fellowship in the open field succeeds. It furthers one to cross the great water. It furthers the perseverance of the superior person."
      },
      "judgment": "True fellowship does not hide in courtyards or temples. It meets in the open field—no walls, no secrets, no conditions. When you find those who share your deepest seeing, you can cross any great water together. The perseverance of the superior person is not lonely endurance; it is the quiet confidence that somewhere, others are persevering too, and that your paths will cross at the right time. Seek fellowship in the open field. Let your light be seen. Others will come.",
      "image": "Heaven together with fire. The noble one distinguishes things according to their kinds and groups. Fire rises to heaven; they belong together. The noble one looks at this image and learns to see clearly what belongs with what. Not to separate in judgment, but to honor the natural affinities. You do not force a fish to fly or a bird to swim. In the same way, you do not force fellowship where there is no shared fire. Distinguish, then unite. This is the wisdom of fellowship.",
      "lines": [
        "Fellowship at the gate. No blame. The first meeting, at the threshold. You open the gate, and there they are. Simple, unguarded, real. No blame follows such a beginning.",
        "Fellowship with kindred in the clan. Humiliation. Fellowship limited to your own kind, your own clan, your own circle. This seems safe, but it brings humiliation because it excludes those who share your fire but not your blood. True fellowship transcends clan. Do not settle for less.",
        "Hide weapons in the thicket. Climb the high hill and watch. Three years without rising. When fellowship is not yet possible, when the field is not safe, you hide your intent—not in fear, but in patience. You climb and watch, waiting for the right moment. Even three years, if necessary. The fire does not go out; it waits for air.",
        "Climb the wall, but do not fight. Good fortune. The wall separates you from fellowship. You climb it, see the other side, but do not attack. Just seeing, just being seen, is enough. This climbing without fighting brings good fortune because it opens the way without closing it.",
        "Those bound first weep and lament, but later they laugh. After great struggle, they meet. The deepest fellowship often comes through separation and longing. First the weeping, then the laughter. The meeting is sweeter because it was delayed. Great struggle, great joy.",
        "Fellowship in the meadow. No regret. After all the gates and walls and waiting, finally the open meadow. No conditions, no defenses, no strategy. Just two or more, standing in the light, together. No regret."
      ],
      "trigrams": {
        "lower": {
          "name": "Lí (Fire)",
          "nature": "Clinging, brightness"
        },
        "upper": {
          "name": "Qián (Heaven)",
          "nature": "Creative, strength"
        },
        "description": "Fire below, heaven above. Flame rises naturally to meet the sky. This is fellowship: the upward movement of shared light, the recognition of what is essentially alike. The fire does not try to become heaven; it simply rises, and heaven receives it."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The sage has no fixed mind; he takes the mind of the people as his mind.' Hexagram 13 is the mind of the people when they share one light. Fellowship is not agreement on every detail; it is the deep recognition that at the source, we are the same fire. In that recognition, differences become gifts, not divisions."
    },
    {
      "number": 14,
      "name": "Great Possession (大有 - Dà Yǒu)",
      "heart": "Fire in heaven. The sun at noon, illuminating everything, owning nothing. This is great possession—not hoarding, but radiating. The sun possesses nothing, yet all things are illuminated by it. True wealth is not what you hold, but what you give. Great possession is the state of having so much that you can only give it away.",
      "ancient": {
        "chinese": "大有。元亨。",
        "rendering": "Great Possession. Supreme success."
      },
      "judgment": "When fire is in heaven, everything is lit. Nothing hidden, nothing lacking. This is great possession: not the accumulation of things, but the fullness of being. Supreme success comes not from getting more, but from being so full that you naturally overflow. In this state, you do not grasp—you radiate. You do not own—you share. Great possession is the harvest of a life lived in alignment. You have enough, you are enough, and what you have is for all.",
      "image": "Fire in heaven above. The noble one curbs evil and promotes good, thus obeying the benevolent will of heaven. Fire in heaven illuminates everything equally. The noble one sees this and learns: to curb evil is not to attack it, but to expose it to light. To promote good is not to force it, but to let it grow in the sun. This is obeying heaven's will: not through submission, but through alignment with the illuminating power that benefits all.",
      "lines": [
        "No relationship with what is harmful. There is no blame in this. To recognize what harms you and to have no relationship with it—this is the beginning of great possession. You clear the ground, and the sun can shine.",
        "A large wagon loaded. You may go far. No blame. Great possession allows you to carry much. The wagon is large, the load is heavy, but the axle holds. You can go far because you are not burdened by what you carry; you are enabled by it. No blame—only movement.",
        "A prince offers gifts to the Son of Heaven. A petty person cannot do this. Great possession naturally gives. The prince offers to the highest—not out of obligation, but because giving is the only response to having. The petty person, who hoards, cannot do this. Their hands are too full of holding.",
        "He makes a distinction but is not boastful. No blame. In great possession, you see clearly—what is yours, what is another's, what is to be shared, what is to be kept. But you do not boast of this clarity. You simply act from it. No blame.",
        "Your sincerity is so communicable that it inspires awe. Good fortune. When your sincerity is genuine, it radiates. Others feel it, are moved by it, even awed by it. Not because you try to impress, but because true sincerity cannot be hidden. This awe is not fear; it is recognition. Good fortune.",
        "Heaven's blessing comes. Good fortune. Nothing unhelpful. At the peak of great possession, heaven itself blesses you. Not because you are special, but because you have become a channel for what heaven wants to give. You receive, and you give. Nothing you do now is unhelpful. Everything serves."
      ],
      "trigrams": {
        "lower": {
          "name": "Qián (Heaven)",
          "nature": "Creative, strength"
        },
        "upper": {
          "name": "Lí (Fire)",
          "nature": "Clinging, brightness"
        },
        "description": "Heaven below, fire above. The fire illuminates heaven—not by conquering it, but by being received by it. Great possession is this mutual radiance: what you have is lit by what you are, and what you are is expanded by what you have. The sun in the sky owns nothing and lights everything."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The sage does not accumulate. The more he helps others, the more he possesses. The more he gives to others, the more he gains.' Hexagram 14 is the living proof. Great possession is not a state of having; it is a state of giving. When you are full, you overflow. When you overflow, you are filled again. This is the eternal rhythm of the sun: it spends itself completely every day, and every morning it rises again, full."
    },
    {
      "number": 15,
      "name": "Modesty (谦 - Qiān)",
      "heart": "Earth under the mountain. The mountain, so vast and high, rests on humble earth. It does not boast of its height; it simply rises. Modesty is not thinking less of yourself—it is thinking of yourself less. The mountain does not pretend to be a molehill; it is a mountain. But it knows it rests on earth, and it is grateful.",
      "ancient": {
        "chinese": "谦。亨，君子有終。",
        "rendering": "Modesty succeeds. The superior person carries things through."
      },
      "judgment": "Modesty is not weakness; it is the only strength that lasts. The mountain that boasts of its height will be eroded; the mountain that rests humbly on the earth endures. Success comes to the modest because they do not waste energy defending their importance. They simply are what they are, and that is enough. The superior person carries things through—not by force, but by steady, unpretentious presence. Modesty completes.",
      "image": "Within the earth, a mountain. The noble one reduces the excessive and increases the insufficient. He weighs things and makes them equal. The mountain is within the earth—its height is balanced by the earth's depth. The noble one learns from this: to reduce what is excessive in himself, to increase what is insufficient. Not to make everyone the same, but to bring balance. He weighs things—not to judge, but to harmonize. Modesty is this constant, quiet adjustment toward the center.",
      "lines": [
        "A superior person who is modest about their modesty. They cross the great water. Good fortune. Even modesty can become a pose, a performance. The truly modest are modest even about their modesty. They do not know they are humble; they simply are. Such a one can cross the great water—the greatest danger—because they carry no weight of self-importance to sink them.",
        "Modesty that finds expression. Perseverance brings good fortune. Modesty is not silence; it finds expression naturally, in the right way, at the right time. Not to draw attention, but to complete the situation. This expression, when persevered in, brings good fortune because it is true, not forced.",
        "A superior person who is modest and toils. They carry things through. Good fortune. Modesty does not mean idleness. The modest person works, toils, completes. But they do not toil for recognition; they toil because the work needs doing. Their modesty makes their work effective because it is not about them. Good fortune follows.",
        "Nothing that does not further modesty. In movement, this is natural. When you are truly modest, everything you do furthers the situation. Not because you are skillful, but because you are not in the way. Your actions flow from the situation itself, not from your agenda. This is natural movement, and it always furthers.",
        "Not rich, use your neighbors. It furthers to attack and conquer. Nothing that does not further. Modesty does not mean poverty of spirit. If you lack resources, you use what is near—neighbors, friends, the given. Even attack and conquest, when necessary, can be done modestly—without arrogance, without cruelty. Nothing that is done in true modesty fails to further.",
        "Modesty that expresses itself. It furthers to set armies marching and to attack cities. Even the harshest actions, when done in modesty—without personal pride, without cruelty—can be right. The line acknowledges that sometimes armies must march. But if they march modestly, they bring not destruction but resolution."
      ],
      "trigrams": {
        "lower": {
          "name": "Gèn (Mountain)",
          "nature": "Stillness, resting"
        },
        "upper": {
          "name": "Kūn (Earth)",
          "nature": "Receptive, yielding"
        },
        "description": "Mountain under earth. The mountain's height is hidden, embraced by the earth. This is modesty: greatness that does not need to be seen, strength that rests within gentleness. The mountain does not disappear; it simply does not insist on its height."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The highest good is like water. Water benefits all things and does not contend. It stays in lowly places that others despise. Thus it is near the Tao.' Hexagram 15 is water's cousin—earth that embraces the mountain. Modesty is the quality of not needing to be above. It is the strength that rests below, the greatness that does not need to be seen. In this, it is near the Tao."
    },
    {
      "number": 16,
      "name": "Enthusiasm (豫 - Yù)",
      "heart": "Thunder coming out of the earth. A shock, a stirring, a release of pent-up energy. Spring breaking through winter, joy breaking through sorrow. Enthusiasm is not manufactured; it erupts. It is the earth's own music, the rhythm that sets everything dancing. When it comes, you do not need to force it. You only need to let it move you.",
      "ancient": {
        "chinese": "豫。利建侯行師。",
        "rendering": "Enthusiasm. It furthers one to install helpers and set armies marching."
      },
      "judgment": "Enthusiasm is the energy of heaven moving through earth. When it arises, it is time to act—not because you decide, but because you are moved. Install helpers: gather those who share your rhythm. Set armies marching: undertake the great tasks that require collective energy. But be careful: enthusiasm can become excess. The key is to be moved, not to be consumed. Let the thunder pass, and return to stillness.",
      "image": "Thunder bursts from the earth with a crash. The ancient kings made music to honor the worthy and offered it to the supreme deity. They introduced it to the ancestral temple. Thunder from the earth—sudden, powerful, musical. The ancient kings understood: enthusiasm must be channeled. They made music to honor the worthy, to give form to the formless energy. They offered it to the divine, to return it to its source. Enthusiasm, when honored and offered, becomes blessing. When ignored or indulged, it becomes chaos.",
      "lines": [
        "Enthusiasm that expresses itself. Misfortune. Enthusiasm that is only expression, only release, without direction, without offering—this brings misfortune. It burns itself out and leaves nothing. The first line warns: do not just express; channel.",
        "Enthusiasm that is like a rock. Not a whole day. Perseverance brings good fortune. The one who is rock-like, unmoved by enthusiasm, misses the gift. But if they do not stay rock-like for even a whole day—if they let themselves be touched—good fortune comes. Perseverance in openness, not in hardness.",
        "Enthusiasm that looks upward creates remorse. There is delay, but no blame. Looking upward, yearning for what is beyond, creates remorse because you miss what is here. But if you see this and delay—pause, reflect—there is no blame. The yearning itself can become a path.",
        "Enthusiasm as a source of doubt. Good fortune. When you doubt your own enthusiasm, you do not act rashly. This doubt is not weakness; it is the pause that lets you see clearly. Good fortune follows because you do not mistake excitement for truth.",
        "Perseverance with chronic illness. Not dead. Enthusiasm can become chronic—a constant fever that wears you out. Perseverance in this state is not good, but you are not dead. The line offers hope: even chronic illness can be healed if you recognize it and return to stillness.",
        "Dark enthusiasm. When enthusiasm is indulged without light, without awareness, it becomes dark. You lose yourself in it. But if you change afterward, there is no blame. The line does not condemn; it offers a way back."
      ],
      "trigrams": {
        "lower": {
          "name": "Kūn (Earth)",
          "nature": "Receptive, yielding"
        },
        "upper": {
          "name": "Zhèn (Thunder)",
          "nature": "Arousing, moving"
        },
        "description": "Earth below, thunder above. Thunder bursts from the earth—not from outside, but from within. Enthusiasm is the earth's own music, the vibration of life itself. When it comes, let it move you, but do not let it carry you away."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The five colors blind the eye. The five tones deafen the ear. The five flavors dull the taste. The chase and the hunt madden the mind.' Hexagram 16 warns of the same: enthusiasm, unchecked, becomes madness. But channeled, offered, returned to the source, it becomes music—the sound of the Tao moving through the world. The ancient kings made music not to excite but to honor. Let your enthusiasm be an offering, not an indulgence."
    },
    {
      "number": 17,
      "name": "Following (随 - Suí)",
      "heart": "Thunder in the lake. Below, the deep stillness of water; above, the stirring of thunder. The lake follows the thunder's movement, rippling in response. Not by force, but by nature. Following is not submission; it is attunement. You follow not because you must, but because you recognize the right movement and join it.",
      "ancient": {
        "chinese": "随。元亨利貞，无咎。",
        "rendering": "Following has supreme success. Perseverance brings no blame."
      },
      "judgment": "To follow is not to lose yourself; it is to find yourself in rhythm with what is true. There are times when the highest wisdom is to join, not to lead. Supreme success comes when you follow the right leader, the right moment, the right way. Perseverance in this following brings no blame because you are not blindly obeying—you are consciously attuning. The lake does not lose itself by rippling; it expresses itself more fully. So too, in following, you become more yourself, not less.",
      "image": "Thunder in the lake. The noble one goes to his resting place at nightfall. He is restored. Thunder stirs the lake, but only briefly. Then the lake returns to stillness. The noble one learns from this: activity has its time, and rest has its time. At nightfall, he withdraws, rests, is restored. Following the natural rhythm of day and night, he does not exhaust himself. He follows the Tao, and the Tao restores him.",
      "lines": [
        "The standard changes. Perseverance brings good fortune. To go out of the gate to fellowship brings success. Following does not mean rigidity. The standard changes as circumstances change. If you persevere in the old way when the new way is needed, you lose the path. Going out of the gate to fellowship—opening to others—brings success because you follow the moment, not the rule.",
        "If you cling to the little boy, you lose the strong man. What you follow determines what you become. Cling to the small, and you lose the great. This line is a mirror: look at what you follow. Does it enlarge you or diminish you?",
        "If you cling to the strong man, you lose the little boy. Following what is great, you may lose touch with simplicity, with the common, with the small joys. This is also a loss. The wise one follows both, at the right time, without clinging.",
        "Following brings success. Perseverance brings misfortune. To go one's own way with sincerity brings clarity. There is a time to follow and a time to lead. If you persevere in following when you should lead, misfortune comes. The sincere person knows when to go their own way, and that going is itself a form of following—following the inner voice.",
        "Sincere in the good. Good fortune. Following what is genuinely good, without pretense, without calculation—this brings good fortune because it aligns you with the source of all good. You are not following a person or a rule; you are following goodness itself.",
        "He is bound, he is held fast. The king introduces him to the Western Mountain. Following reaches its peak: complete trust, complete attunement. The one who follows so completely is bound to the leader, held fast in the relationship. The king introduces him to the Western Mountain—the place of sacrifice, of highest honor. This is the fulfillment of following: not loss of self, but completion of self in relationship."
      ],
      "trigrams": {
        "lower": {
          "name": "Zhèn (Thunder)",
          "nature": "Arousing, moving"
        },
        "upper": {
          "name": "Duì (Lake)",
          "nature": "Joyful, reflecting"
        },
        "description": "Thunder below, lake above. The thunder stirs, and the lake responds—not by force, but by nature. This is following: the joyful, reflective response to the movement of life. The lake does not resist the thunder; it ripples. It does not lose itself; it expresses itself more fully."
      },
      "taoist_reflection": "The Tao Te Ching says: 'Yield and overcome; empty and become full; bend and become straight.' Hexagram 17 is the art of yielding, of following, of becoming full by emptying. The lake follows the thunder and becomes more fully lake. You follow the Tao and become more fully yourself. This is the paradox: in following, you lead. In yielding, you overcome. In emptying, you are filled."
    },
    {
      "number": 18,
      "name": "Work on the Decayed (蛊 - Gǔ)",
      "heart": "Wind under the mountain. Below, the mountain, solid and still; above, the wind, moving and penetrating. But the wind is trapped, blowing against the mountain's base, eroding it slowly. This is decay—not sudden collapse, but the gradual wearing away of what was solid. And it is also work on the decay—the patient, persistent effort to set right what has been neglected. The mountain can be restored, but only if the wind's work is understood and redirected.",
      "ancient": {
        "chinese": "蛊。元亨。利涉大川，先甲三日，後甲三日。",
        "rendering": "Work on what has been spoiled has supreme success. It furthers one to cross the great water. Three days before, three days after."
      },
      "judgment": "Everything decays. What was built crumbles, what was planted withers, what was established is neglected. This is not failure; it is the nature of time. But decay can be worked on. It can be healed, restored, renewed. Supreme success comes to those who take up this work. To cross the great water—the great difficulty—is possible if you prepare. Three days before, three days after: the work requires careful consideration of causes and effects, origins and consequences. You must understand how the decay happened to know how to undo it. And you must look ahead to see what the restoration will bring.",
      "image": "Wind below the mountain. The noble one stirs up the people and nourishes their character. Wind under the mountain: it blows against the base, eroding, weakening. But the same wind, redirected, can also clear away what is rotten and bring fresh air. The noble one looks at this image and learns: to work on decay, you must stir up the people—awaken them from complacency—and nourish their character—provide the conditions for new growth. Decay is not just physical; it is moral, spiritual, communal. The work is never only on things; it is always on people.",
      "lines": [
        "Dealing with the decay caused by the father. The son takes over. No blame. Danger. In the end, good fortune. The decay you inherit—from your father, your predecessors, your past. You did not cause it, but you must deal with it. The son takes over. This is right, this is duty. There is danger—the decay may be deep, the work may be long—but in the end, good fortune comes to those who take up the work they did not choose.",
        "Dealing with the decay caused by the mother. Not to be persevered in. Some decay is not yours to fix. The mother's decay—the intimate, the emotional, the deeply personal—may require not your intervention but your acceptance. To persevere in trying to fix it is to make it worse. Know when to let be.",
        "Dealing with the decay caused by the father. There will be some remorse, but no great blame. Some decay you can address only partially. You will feel remorse for what you cannot fix, but if you do what you can, there is no great blame. The work is never perfect; done is enough.",
        "Tolerating the decay caused by the father. To go forward brings humiliation. If you tolerate the decay, if you look away, if you let it continue—then going forward in any other matter brings humiliation because you have not done your fundamental work. First, address what is yours to address.",
        "Dealing with the decay caused by the father. You will be praised. When you take up the work and do it well, you will be praised—not for your brilliance, but for your faithfulness. Praise is not the goal, but it is the natural recognition of work rightly done.",
        "He does not serve kings and princes. He sets himself higher goals. The highest work on decay is not on the external world but on yourself. Some must withdraw from service, from the world's demands, to cultivate their own ground. This is not escape; it is the deepest work. Setting yourself higher goals—integrity, clarity, peace—you address the decay that underlies all others."
      ],
      "trigrams": {
        "lower": {
          "name": "Xùn (Wind)",
          "nature": "Gentle, penetrating"
        },
        "upper": {
          "name": "Gèn (Mountain)",
          "nature": "Stillness, resting"
        },
        "description": "Wind under mountain. The wind blows at the mountain's base, eroding it slowly. This is decay: the gradual wearing away of what was solid. But the same wind, if directed upward, can clear away debris and bring fresh air. Work on the decay is redirecting the wind—using the same forces that caused the problem to heal it."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The softest thing in the world rides over the hardest thing in the world.' Hexagram 18 is the soft wind that erodes the hard mountain—and the same soft wind that, when turned, can restore it. Decay is natural; so is renewal. The work is not to fight decay but to understand it, to redirect it, to let it teach you. The wise one does not despair over what is spoiled; they ask what the spoiling reveals about what was neglected, and they begin again, with new attention."
    },
    {
      "number": 19,
      "name": "Approach (临 - Lín)",
      "heart": "Earth above, lake below. The lake mirrors the earth; the earth feels the lake's presence. Approach is the moment of drawing near—not with force, but with presence. The leader approaches the people, the lover approaches the beloved, the sage approaches the student. In approach, something passes between them, something that changes both.",
      "ancient": {
        "chinese": "临。元亨利貞。至于八月有凶。",
        "rendering": "Approach has supreme success. Perseverance furthers. When the eighth month comes, there is misfortune."
      },
      "judgment": "To approach is to draw near with openness, with sincerity, with the intention of meeting. This brings supreme success because it opens channels that were closed. Perseverance in approaching—not forcing, but consistently showing up—furthers all things. But the eighth month warns: all approaches have their season. What is near will eventually become distant. The cycle continues. Do not cling to the approach; let it flow, and when the eighth month comes, accept the withdrawal. Misfortune comes only if you try to hold what is meant to recede.",
      "image": "Earth above the lake. The noble one is inexhaustible in teaching and unlimited in containing the people. Earth above the lake: the lake reflects the earth, and the earth rests on the lake's presence. The noble one learns from this: teaching is an approach, an inexhaustible drawing near to those who learn. And containing the people is an approach too—holding them without grasping, supporting without controlling. The noble one's heart is like the lake, reflecting all who approach, and like the earth, containing all who rest.",
      "lines": [
        "Joint approach. Perseverance brings good fortune. To approach together, with others, in shared intention—this is powerful. Perseverance in this joint approach brings good fortune because you are not alone, and your combined presence is greater than any single one.",
        "Joint approach. Good fortune. Everything furthers. Again, joint approach, but now it is complete. Everything furthers because the approach is full, mutual, unreserved. When two or more approach each other with full sincerity, nothing stands in their way.",
        "Sweet approach. Nothing that furthers. If you are already aware, you can avoid mistakes. Sweet approach—flattering, ingratiating, trying to win favor—does not further. It is not true approach; it is manipulation. If you are aware of this, you can avoid the mistake. Approach must be sincere, not sweet.",
        "Complete approach. No blame. To approach completely, holding nothing back, risking everything—this is rare and often blamed by the cautious. But the line says: no blame. Complete approach, when it is called for, is the only right response. Hold nothing back.",
        "Wise approach. This is right for a great ruler. Good fortune. To approach with wisdom—seeing clearly what is needed, what is possible, what is timely—this is the approach of the great ruler. It brings good fortune because it is not blind; it sees and yet still draws near.",
        "Great approach. Good fortune. No blame. The ultimate approach: great in scale, great in intention, great in effect. Not because of any special quality, but because the approach itself has become a way of being. This one approaches everything—the world, others, themselves—with the same openness. Good fortune, no blame."
      ],
      "trigrams": {
        "lower": {
          "name": "Duì (Lake)",
          "nature": "Joyful, reflecting"
        },
        "upper": {
          "name": "Kūn (Earth)",
          "nature": "Receptive, yielding"
        },
        "description": "Lake below, earth above. The lake reflects the earth, and the earth receives the lake's gift of reflection. This is approach: the mutual drawing near of what reflects and what is reflected. In approach, you see yourself in the other, and the other sees themselves in you. This seeing is the beginning of all healing."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The sage has no mind of his own; he takes the mind of the people as his mind.' Hexagram 19 is the sage's approach: not imposing, but reflecting; not controlling, but containing. The lake does not try to be the earth; it reflects it. The earth does not try to be the lake; it receives its reflection. In their mutual approach, each becomes more fully itself. The wise one approaches others the same way: not to change them, but to let them see themselves in the clear water of sincere presence."
    },
    {
      "number": 20,
      "name": "Contemplation (观 - Guān)",
      "heart": "Wind moving over the earth. Everywhere, unseen, the wind touches everything. It cannot be seen, only felt. Contemplation is like this: not staring, not analyzing, but a quiet, pervasive awareness that takes in everything without grasping anything. You stand on the earth, and the wind moves over you. You see without looking, understand without thinking, are present without effort.",
      "ancient": {
        "chinese": "观。盥而不薦，有孚顒若。",
        "rendering": "Contemplation. The ablution is made, but not the offering. Full of trust, they look up."
      },
      "judgment": "The ablution is made, but not the offering—the purification is complete, but the ritual is not yet performed. In that pause, there is pure contemplation. Full of trust, they look up—not asking, not demanding, just receiving. Contemplation is this sacred pause: after preparation, before action, you simply see. In that seeing, you understand what is needed, what is true, what is next. The offering will come, but first, contemplation. Do not rush to act. First, see.",
      "image": "Wind moving over the earth. The ancient kings visited the regions and observed the people. They established teaching. Wind over the earth: it goes everywhere, touches everything, but leaves no trace. The ancient kings, like wind, visited all regions, observed all people, not to control but to understand. From this understanding, they established teaching that fit each place, each people. Contemplation is the foundation of all wise action. First see, then act.",
      "lines": [
        "Contemplation like a youth. No blame for a common person, but a superior person is humiliated. The youth sees only the surface, only what is obvious. For a common person, this is no blame—they have not learned to see deeper. But for the superior person, this shallow seeing is humiliation. You are called to see more deeply.",
        "Contemplation through the crack of the door. Furthering for the perseverance of a woman. Through a crack, you see only a sliver. This is partial, limited, but for one who cannot go out—a woman in traditional confines—this limited seeing is enough. It furthers her perseverance. The line does not judge; it describes. Know the limits of your contemplation, and work within them.",
        "Contemplation of one's own life. Determines whether to advance or retreat. This is the heart of contemplation: looking at your own life, your own path, your own choices. From this seeing, you know whether to advance or retreat. Not from external advice, not from rules, but from clear seeing of what is. This is the foundation of wisdom.",
        "Contemplation of the light of the kingdom. It furthers to be a guest of the king. When you see beyond yourself to the larger whole—the kingdom, the community, the world—you become fit to serve. The king welcomes you as a guest because your seeing is not self-serving. You see what is needed, and you can help provide it.",
        "Contemplation of one's own life. The superior person is without blame. Again, contemplation of one's own life, now at a deeper level. The superior person, seeing clearly, acts without blame because action flows from seeing. Not from impulse, not from habit, but from clear awareness.",
        "Contemplation of one's own life. The superior person is without blame. The final line repeats the fifth, emphasizing that this is the culmination: the one who sees clearly, acts without blame. The cycle completes: from youth's surface, through the crack, to self, to the kingdom, back to self—and now, at the peak, simply seeing, simply being, without blame."
      ],
      "trigrams": {
        "lower": {
          "name": "Kūn (Earth)",
          "nature": "Receptive, yielding"
        },
        "upper": {
          "name": "Xùn (Wind)",
          "nature": "Gentle, penetrating"
        },
        "description": "Earth below, wind above. Wind moves over the earth, touching everything, leaving nothing untouched. This is contemplation: a gentle, pervasive awareness that takes in all without grasping any. The earth receives the wind; you receive the world. In this receiving, you understand."
      },
      "taoist_reflection": "The Tao Te Ching says: 'Without going out the door, know the world. Without looking out the window, see the Tao.' Hexagram 20 is this knowing without going, this seeing without looking. Contemplation is not the effort to understand; it is the openness that allows understanding to come. The wind does not try to know the earth; it simply moves over it, and in moving, learns every contour. You do not need to strive to see. Just be present, and the world will show itself to you."
    },
    {
      "number": 21,
      "name": "Biting Through (噬嗑 - Shì Kè)",
      "heart": "Thunder and lightning. The flash that illuminates, the shock that breaks. Between the jaws, something stuck—the clamp that prevents closing. Biting through is the force that removes obstacles, that chews through what blocks the way. Not gentle, not patient—but sometimes necessary. The jaws must close for nourishment to happen. If something blocks them, bite through.",
      "ancient": {
        "chinese": "噬嗑。亨。利用獄。",
        "rendering": "Biting Through succeeds. It is favorable to use legal proceedings."
      },
      "judgment": "There are times when the only way forward is to bite through the obstacle. Not with anger, not with cruelty—but with the clear, decisive force of a jaw closing on what blocks nourishment. This is the energy of legal proceedings, of judgment, of setting things right by force when gentleness has failed. Success comes not from the violence, but from the clearing. After the obstacle is removed, the jaws can close in peace. Use this force only when necessary, and only to restore the natural flow.",
      "image": "Thunder and lightning. The ancient kings made their laws clear and promulgated punishments. Thunder and lightning together—the flash that reveals and the shock that enforces. The ancient kings understood: laws must be clear so all can see, and punishments must be known so all can choose. Biting through is not about cruelty; it is about clarity. When the law is clear, people can avoid the bite. When punishment is just, the obstacle is removed and the whole benefits.",
      "lines": [
        "His feet are in the stocks, so that his toes disappear. No blame. The smallest obstacle, the first offense—the stocks confine the toes, not the whole body. The punishment fits the crime. No blame because the correction is minimal, a warning, not a destruction.",
        "Bites through soft meat, and his nose disappears. No blame. The obstacle is soft, easy to bite—but in the eagerness, he loses his nose, his sensitivity. No blame because the obstacle was removed, but a reminder: even in easy victories, something is lost. Bite through, but do not lose yourself.",
        "Bites on old dried meat, and strikes something poisonous. Slight humiliation. No blame. Old meat, tough and poisoned—the obstacle is more than expected. He bites and is poisoned, humiliated. But the line says no blame: he did what was necessary, and the poison is not his fault. Endure the humiliation; the obstacle will still yield.",
        "Bites on dried gristly meat. Receives metal arrows. It furthers to persevere in the face of difficulty. Good fortune. The toughest obstacle—gristle, bone, the hardest to chew. But he receives metal arrows, tools that help. Perseverance in this difficulty brings good fortune. The arrows are the helpers, the resources that come when the task is great. Use them.",
        "Bites on dried lean meat. Receives yellow gold. Perseverance brings danger. No blame. Lean meat, less tough, but still requiring bite. He receives yellow gold—value, reward. But the line warns: perseverance in this mode brings danger. Do not make biting through a habit. After the obstacle, return to gentleness. No blame if you know when to stop.",
        "His neck is in the wooden cangue, so that his ears disappear. Misfortune. The final line: the worst obstacle, the greatest punishment. The cangue confines the neck, blocks the ears. Misfortune because the obstacle was not addressed early, and now it consumes the whole. Learn from this: bite through the small things before they become large."
      ],
      "trigrams": {
        "lower": {
          "name": "Zhèn (Thunder)",
          "nature": "Arousing, shocking"
        },
        "upper": {
          "name": "Lí (Fire)",
          "nature": "Clinging, bright"
        },
        "description": "Thunder below, lightning above. The flash reveals what is stuck; the shock breaks it apart. Together, they bite through any obstacle. This is the power of clarity joined with movement: first see, then act."
      },
      "taoist_reflection": "The Tao Te Ching says: 'If you want to shrink something, you must first expand it. If you want to weaken something, you must first strengthen it.' Hexagram 21 is the moment of contraction after expansion, of weakening after strengthening. The obstacle grew until it blocked the way. Now it must be bitten through. The wise one does not let obstacles grow that large. They address the small before it becomes large, the easy before it becomes hard."
    },
    {
      "number": 22,
      "name": "Grace (贲 - Bì)",
      "heart": "Fire at the foot of the mountain. The mountain, solid and still, is lit by fire—not consumed, but illuminated. Grace is this: the light that reveals without burning, the beauty that adorns without covering. A single flower in a simple vase, a well-placed word in silence. Grace adds nothing essential, yet without it, the essential remains unseen.",
      "ancient": {
        "chinese": "贲。亨。小利有攸往。",
        "rendering": "Grace succeeds. In small matters, it furthers one to undertake something."
      },
      "judgment": "Grace is not necessary, but it is not trivial. It is the finishing touch, the light that reveals, the beauty that honors. In great matters, grace alone is not enough—substance must come first. But in small matters, it furthers to undertake grace. A kind word, a thoughtful gesture, a beautiful object—these make life human. Success comes not from the grace itself, but from what grace makes visible. Let your grace reveal what is real, not cover what is absent.",
      "image": "Fire at the foot of the mountain. The noble one sheds light on the many proceedings of government, but does not dare to decide court cases. Fire at the mountain's base illuminates the lower slopes but cannot reach the peak. The noble one learns: grace can illuminate processes, can make things clear and beautiful, but it cannot decide what is just. For that, something more is needed. Use grace to shed light, but do not rely on it for judgment.",
      "lines": [
        "He lends grace to his toes, leaves the carriage, and walks. To grace the smallest part, the toes, and then to leave the carriage—the luxury—and walk humbly. This is grace that knows its place. It adorns but does not cling. Good fortune follows such lightness.",
        "He lends grace to his beard. The beard is already there; grace simply trims it, shapes it. This is grace that works with what is, not against it. No great transformation, just a little attention. Good fortune in the small.",
        "Graceful and moist. Perseverance brings good fortune. Moisture softens, makes pliable. Grace that moistens—that softens the hard edges—brings good fortune if persevered in. Not the flashy grace, but the steady, softening presence.",
        "Grace or simplicity? A white horse comes, not as a robber but as a suitor. The question: should you add grace or remain simple? The answer comes as a white horse—purity, simplicity itself—but it comes as a suitor, seeking union. Sometimes the greatest grace is no grace at all. The simplicity itself becomes the ornament.",
        "Grace in the hills and gardens. The roll of silk is meager and small. Humiliation, but in the end, good fortune. Grace in retreat—in hills and gardens, away from the world—is humble, meager. It seems like humiliation, lacking the world's splendor. But in the end, this simple grace brings good fortune because it is real, not performed.",
        "Simple grace. No blame. The final line returns to the beginning: simple grace, unadorned, unpretentious. After all the ornament, the only grace that lasts is the one that adds nothing, that simply lets what is be seen. No blame."
      ],
      "trigrams": {
        "lower": {
          "name": "Lí (Fire)",
          "nature": "Clinging, bright"
        },
        "upper": {
          "name": "Gèn (Mountain)",
          "nature": "Stillness, resting"
        },
        "description": "Fire below, mountain above. The fire illuminates the mountain's base, revealing its beauty without reaching its peak. This is grace: light that reveals form without consuming it, beauty that honors substance without replacing it."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The five colors blind the eye. The five tones deafen the ear.' Hexagram 22 warns: grace can become excess, ornament can become blindness. But true grace is not excess; it is the light that lets you see what is already there. The wise one adorns just enough to reveal, never enough to conceal."
    },
    {
      "number": 23,
      "name": "Splitting Apart (剥 - Bō)",
      "heart": "Mountain resting on earth. But the earth is giving way, eroding, sliding. The mountain, once secure, now splits apart. Not by violence from outside, but by gradual weakening from within. Splitting apart is the slow decay of what seemed solid—a relationship, a reputation, a self. It happens one small betrayal at a time, one unnoticed crack. By the time you see it, it is almost too late.",
      "ancient": {
        "chinese": "剥。不利有攸往。",
        "rendering": "Splitting Apart. It does not further one to undertake anything."
      },
      "judgment": "When things are splitting apart, when the ground is eroding under you, it does not further to undertake anything new. Any action now only accelerates the decay. The only wisdom is to wait, to preserve what can be preserved, to let the decay complete itself. This is not passive resignation; it is recognition that some processes must finish before new ones can begin. The mountain will fall, but from its rubble, new earth will form. Wait.",
      "image": "The mountain rests on the earth. The noble one ensures abundance for those below, and peace for their dwelling. The mountain rests on earth, but when the earth erodes, the mountain falls. The noble one looks at this image and learns: ensure abundance for those below—the foundation, the common people, the ordinary ones. Give them peace in their dwelling. When the base is secure, the mountain stands. Splitting apart happens from neglect of the foundation. Attend to the foundation, and the mountain holds.",
      "lines": [
        "The leg of the bed is split. Those who persevere are destroyed. Misfortune. The first crack, in the leg of the bed—the place of rest. It seems small, but if you persevere in ignoring it, you are destroyed. The bed will collapse. Misfortune comes not from the crack, but from the refusal to see it.",
        "The bed is split at the edge. Those who persevere are destroyed. Misfortune. The crack spreads to the edge. Still ignorable, still small—but not for long. The warning repeats: do not persevere in denial. Act now, or be destroyed.",
        "Splits apart with them. No blame. The decay is shared, collective. You are not alone in the splitting. There is no blame because it is not your doing alone. But neither is there safety. The split continues.",
        "The bed is split down to the skin. Misfortune. Now the crack reaches the body, the self. Misfortune because it can no longer be ignored. The decay is now you. But even here, there is a seed: when it reaches you, you must finally respond.",
        "A shoal of fish. Favor comes through the court ladies. Everything acts to their advantage. In the midst of splitting, a shoal of fish—many small things moving together. Favor comes through the most unlikely channels—the court ladies, the overlooked ones. Suddenly, everything acts to your advantage. The decay has created space for the new.",
        "There is a large fruit still uneaten. The noble one acquires a carriage. The common people split their huts. The large fruit remains, untouched by decay. The noble one acquires a carriage—a way to move, to carry what matters. The common people lose their huts, but the noble one has what they need to start again. In the final splitting, the seed of the new is preserved."
      ],
      "trigrams": {
        "lower": {
          "name": "Kūn (Earth)",
          "nature": "Receptive, yielding"
        },
        "upper": {
          "name": "Gèn (Mountain)",
          "nature": "Stillness, resting"
        },
        "description": "Earth below, mountain above. The mountain rests on earth, but the earth erodes. This is splitting apart: the foundation crumbling under the weight of what it supports. When the base fails, the peak falls. Attend to the foundation."
      },
      "taoist_reflection": "The Tao Te Ching says: 'What is firmly established cannot be uprooted. What is firmly embraced cannot slip away.' Hexagram 23 shows what happens when nothing is firmly established, when the embrace was never true. Splitting apart is the price of neglect. But the large fruit remains—the seed of what was real. The wise one preserves that fruit, and from it, new growth springs."
    },
    {
      "number": 24,
      "name": "Return (复 - Fù)",
      "heart": "Thunder within the earth. After the longest night, the faintest stirring. After the deepest winter, the first green shoot. Return is not arrival; it is the turn toward arrival. The solstice, when darkness peaks and light begins its slow return. Not yet spring, but the turn toward spring. Not yet healed, but the turn toward healing. This is the most hopeful of hexagrams: nothing is final. Everything returns.",
      "ancient": {
        "chinese": "复。亨。出入无疾，朋來无咎。反復其道，七日來復，利有攸往。",
        "rendering": "Return succeeds. Going out and coming in without hurt. Friends come without blame. The way moves in cycles. After seven days, return comes. It furthers one to undertake something."
      },
      "judgment": "After splitting apart, return. After decay, renewal. This is the law of the Tao: everything returns. Going out and coming in without hurt—the cycle is natural, not forced. Friends come without blame—in the time of return, you are not alone. After seven days—after a complete cycle—return comes. Now it furthers to undertake something. The time of waiting is over. The turn has come. Act, but gently. The return is just beginning; do not demand the full harvest yet.",
      "image": "Thunder within the earth. The ancient kings closed the passes on the winter solstice. Merchants did not travel. The rulers did not tour. Thunder within the earth—the stirring is there, but still hidden. The ancient kings honored this by closing the passes, by ceasing activity. They understood: at the moment of return, do not rush out. Let the stirring grow in secret. Rest, wait, prepare. The time for action will come, but not yet. First, honor the turn.",
      "lines": [
        "Return from a short distance. No need for regret. Great good fortune. You have not wandered far. The return is easy, quick. No need for regret—you caught yourself early. This is great good fortune because the cost of return is small. Learn from this: return as soon as you notice the wandering.",
        "Quiet return. Good fortune. Not dramatic, not public—just a quiet turning back, a silent reorientation. No one notices, but you feel it. This is good fortune because it is deep, because it comes from within, not from pressure without.",
        "Repeated return. Danger. No blame. You return, then wander again, return again. This repeated cycling is dangerous—it wears you out. But the line says no blame because you keep returning. Even the repeated return is better than no return. Persist, and eventually the wandering will lessen.",
        "Walking in the midst of others, you return alone. This return is solitary. You are surrounded by those still going the wrong way, but you turn. Alone, you walk back. This takes courage. There is no blame—only the quiet strength of one who follows their own knowing.",
        "Noble-hearted return. No regret. You return not because you wandered, but because you see more deeply. This return is an advance, a deepening. Noble-hearted, you turn toward what is more real. No regret—only gratitude.",
        "Missing the return. Misfortune. There is misfortune in leading armies. In the end, a great defeat. If you miss the moment of return, if you stay on the wrong path too long, the consequence is severe. Like leading armies when you should retreat—great defeat. The line warns: do not miss the return. The turn is always there, but you must take it."
      ],
      "trigrams": {
        "lower": {
          "name": "Zhèn (Thunder)",
          "nature": "Arousing, moving"
        },
        "upper": {
          "name": "Kūn (Earth)",
          "nature": "Receptive, yielding"
        },
        "description": "Thunder within the earth. The stirring is there, but hidden—the first movement of spring under winter's ground. Return is this hidden stirring, the promise of renewal before any sign appears. Trust it. It is real."
      },
      "taoist_reflection": "The Tao Te Ching says: 'Returning is the movement of the Tao.' Hexagram 24 is that movement made visible. After every departure, a return. After every winter, a spring. After every death, a rebirth. The wise one does not despair at the going, because they trust the returning. The way moves in cycles, and you are part of that movement. Return now, and let the cycle complete."
    },
    {
      "number": 25,
      "name": "Innocence (无妄 - Wú Wàng)",
      "heart": "Thunder under heaven. The shock of the real, the unexpected, the undeserved. Innocence is not naivete; it is the quality of acting without expectation, without calculation, without hidden motive. Thunder under heaven—it comes when it comes, strikes what it strikes, asks nothing in return. This is the innocence of nature: it simply does what it does, and we call it good or bad, but it is just itself.",
      "ancient": {
        "chinese": "无妄。元亨利貞。其匪正有眚，不利有攸往。",
        "rendering": "Innocence. Supreme success, perseverance furthers. If one is not as he should be, he has misfortune. It does not further to undertake anything."
      },
      "judgment": "Supreme success comes to those who act without artifice, without scheme, without hidden agenda. Not because the world rewards innocence, but because innocent action is aligned with the Tao. It does not force, does not manipulate, does not regret. But if you are not as you should be—if you pretend innocence while hiding intent—then misfortune follows. In such a state, it does not further to undertake anything. First, become real.",
      "image": "Thunder under heaven. The ancient kings enriched their virtue in harmony with the seasons. Thunder under heaven: the sound rolls everywhere, touching all equally. The ancient kings learned from this: enrich your virtue in harmony with the seasons—not forcing, not rushing, but letting virtue grow as naturally as thunder comes in its time. Innocence is this natural growth, unforced, uncalculated, simply being what you are when the time is right.",
      "lines": [
        "Innocent action brings good fortune. Acting without expectation, without attachment to outcome—this is innocent. Good fortune follows because you are not tied to results. You act, and let go. The universe responds in kind.",
        "If you do not count on the harvest while plowing, or on the cleared field while cultivating, then it furthers to undertake something. This is the heart of innocence: plow without thinking of harvest, cultivate without thinking of the cleared field. Do the work because it is the work, not because of what it will bring. Then it furthers to undertake anything.",
        "Innocence that leads to misfortune. Someone ties up the cow. The traveler's gain is the native's loss. Even innocent action can lead to misfortune, through no fault of your own. Someone ties up the cow—your resource, your support. The traveler gains what the native loses. This is the unpredictability of innocence. You act rightly, and still lose. The line does not blame; it observes. Even in loss, remain innocent.",
        "He who can persevere in innocence remains without blame. When innocence is tested, when misfortune comes, if you can persevere—remain innocent, not becoming cynical or calculating—you remain without blame. The test proves the innocence, not its failure.",
        "Do not use medicine for an illness incurred through no fault of your own. It will heal of itself. Some things come to you innocently—illness, trouble, loss. Do not rush to fix them with artificial means. If you are innocent, if you did not cause them, they will heal of themselves. This is trust in the Tao's own rhythm.",
        "Innocent action brings misfortune. Nothing furthers. Sometimes, even innocence meets misfortune. Nothing furthers in that moment. The line does not explain or justify; it simply states. Some things are beyond help. In such times, remain innocent. That is all you can do."
      ],
      "trigrams": {
        "lower": {
          "name": "Zhèn (Thunder)",
          "nature": "Arousing, moving"
        },
        "upper": {
          "name": "Qián (Heaven)",
          "nature": "Creative, strong"
        },
        "description": "Thunder under heaven. The sound rolls across the sky, touching all equally, asking nothing. This is innocence: action that is simply itself, without calculation, without expectation. Heaven receives it, and the world is shaken—not by force, but by truth."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The sage has no mind of his own. He takes the mind of the people as his mind.' Hexagram 25 is the sage's mind: innocent, open, responsive. Not empty of intent, but empty of agenda. Like thunder, it speaks when it speaks, and the world listens. The wise one acts without acting, and nothing is left undone."
    },
    {
      "number": 26,
      "name": "Great Taming (大畜 - Dà Chù)",
      "heart": "Mountain above heaven. The mountain, vast and still, rests on the creative power below. It does not crush; it contains. This is great taming: not the small, patient influence of wind on sky, but the massive, quiet holding of mountain over heaven. The creative power is there, fully present, but it is held, channeled, given time to gather. Great taming is the discipline that allows power to accumulate until it is ready to move mountains itself.",
      "ancient": {
        "chinese": "大畜。利貞。不家食吉。利涉大川。",
        "rendering": "Great Taming. Perseverance furthers. Not eating at home brings good fortune. It furthers one to cross the great water."
      },
      "judgment": "There is a time to gather, to hold, to let power accumulate. This is great taming. Not suppression, but containment. The mountain does not fight heaven; it simply rests on it, giving it time to gather strength. Perseverance in this gathering furthers. Not eating at home—going out, engaging with the world—brings good fortune because the power you have gathered is now ready to be used. Crossing the great water, the great difficulty, is now possible because you did not rush. You waited until you were ready.",
      "image": "Mountain above heaven. The noble one learns widely of past words and deeds, and thus accumulates virtue. Mountain above heaven: the highest rests on the most powerful. The noble one looks at this image and learns: to accumulate virtue, learn widely from the past. Not just your own experience, but the words and deeds of those who came before. Their gathered wisdom becomes the mountain that rests on your heaven, channeling your power, giving it direction. Great taming is this accumulation of wisdom over time.",
      "lines": [
        "Danger is at hand. It furthers to stop. When the first sign of danger appears, stop. Not out of fear, but out of wisdom. The great taming begins with knowing when not to act. Stop now, and you preserve your power for when it is needed.",
        "The axle is removed from the wagon. The wagon cannot move. This is not failure; it is the taming itself. The axle is removed so that you cannot rush forward. You are forced to wait, to gather. There is no blame in this stillness. It is preparation.",
        "A good horse that follows. It furthers to be aware of danger and to persevere. Now movement is possible—a good horse, strong and willing. But the warning remains: be aware of danger, and persevere in the awareness. The horse can run, but you must guide it. Great taming continues even in movement.",
        "The headboard of a young bull. Great good fortune. The bull is strong, but its headboard—the restraint—keeps it from harming. This is the paradox of great taming: the restraint itself is what allows the power to grow safely. Great good fortune comes from this wise containment.",
        "The tusk of a gelded boar. Good fortune. The boar's tusk is its weapon. Gelded, the boar is still strong, but its aggression is tempered. The tusk remains, but it is no longer a danger. This is great taming: power that has been transformed, not removed. The essence remains; the harm is gone.",
        "What is the way of heaven? It prospers. The culmination: after all the taming, the gathering, the restraint—now heaven's way simply prospers. The power that was held is now released, not by force, but by nature. It flows, it gives, it completes. This is the fruit of great taming."
      ],
      "trigrams": {
        "lower": {
          "name": "Qián (Heaven)",
          "nature": "Creative, strong"
        },
        "upper": {
          "name": "Gèn (Mountain)",
          "nature": "Stillness, resting"
        },
        "description": "Heaven below, mountain above. The mountain rests on heaven, containing it, channeling it. This is great taming: the creative power held in stillness, allowed to gather until it is ready to move mountains itself. The restraint is not weakness; it is the condition of true strength."
      },
      "taoist_reflection": "The Tao Te Ching says: 'To know the masculine and keep to the feminine is to be the valley of the world.' Hexagram 26 is the valley that holds the mountain. The creative power is masculine, active, strong. The great taming keeps to the feminine—still, receptive, containing—and thus becomes the valley that can hold even heaven. From this holding, true power is born."
    },
    {
      "number": 27,
      "name": "Corners of the Mouth (颐 - Yí)",
      "heart": "Thunder under the mountain. Below, the stirring of life; above, the stillness that receives it. The mouth opens and closes, takes in nourishment, gives out words. This is the simplest and most profound of acts: providing for life. Corners of the Mouth is about nourishment—physical, mental, spiritual. What you take in, what you give out, and the quiet rhythm between them.",
      "ancient": {
        "chinese": "颐。贞吉。观颐，自求口实。",
        "rendering": "Corners of the Mouth. Perseverance brings good fortune. Contemplate the corners of the mouth, and seek your own nourishment."
      },
      "judgment": "Good fortune comes to those who attend to nourishment. Not just food, but everything that enters and leaves the self. Contemplate the corners of the mouth—what you take in, what you give out, and the rhythm between them. Seek your own nourishment, not as an act of selfishness, but as recognition that you cannot give what you do not have. Perseverance in this attention brings good fortune because you become a reliable channel for life.",
      "image": "Thunder under the mountain. The noble one is careful in his words and moderate in eating and drinking. Thunder under the mountain: the stirring of life beneath stillness. The noble one learns: be careful in words—what leaves the mouth—and moderate in eating and drinking—what enters. This double attention keeps the channel clear. Nourishment flows both ways when you attend to both.",
      "lines": [
        "You let your magic tortoise go, and look at me with the corners of your mouth hanging down. Misfortune. The magic tortoise is your own inner resource, your capacity for self-nourishment. You let it go, and now you look to others with envy, with neediness. Misfortune follows because you have abandoned your own source.",
        "Turning to the top for nourishment. Going against what is constant. Perseverance brings misfortune. To seek nourishment from those above, from those who should not be your source—this is against the constant order. Persevering in this brings misfortune. Nourishment flows downward, not upward.",
        "Turning away from nourishment. Perseverance brings danger. Misfortune for ten years. Nothing good. To refuse nourishment altogether, to turn away from what sustains you—this brings danger. Ten years—a complete cycle—without nourishment, nothing good can come. The line is stark: do not refuse what life offers.",
        "Turning to the source for nourishment. Good fortune. With keen eyes like a tiger's, with insatiable longing. No blame. Finally, turning to the right source—the source itself, not a proxy. The desire is keen, like a tiger's hunger, insatiable. This longing is not greed; it is life seeking its own. No blame follows such true seeking.",
        "Turning away from what is constant. Perseverance brings good fortune. Not to cross the great water. Even when you turn from the constant, if you persevere in awareness, good fortune can come. But do not cross the great water—do not undertake great things—while still unsteady. First, return to nourishment.",
        "The source of nourishment. Awareness of danger brings good fortune. It furthers to cross the great water. At last, you have found the source itself, and you are aware of the danger of losing it. This awareness itself is protection. Now it furthers to cross the great water—to undertake the great thing. You are nourished, and you know it."
      ],
      "trigrams": {
        "lower": {
          "name": "Zhèn (Thunder)",
          "nature": "Arousing, moving"
        },
        "upper": {
          "name": "Gèn (Mountain)",
          "nature": "Stillness, resting"
        },
        "description": "Thunder under mountain. The stirring of life beneath stillness. The mouth opens (thunder) and closes (mountain), taking in and giving out. This is the rhythm of nourishment: the movement that receives and the stillness that processes. Both are necessary."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The sage does not accumulate. The more he helps others, the more he possesses. The more he gives to others, the more he gains.' Hexagram 27 is the foundation of this paradox: you cannot give what you have not received. Nourishment is the source of all giving. Attend to your own corners of the mouth, and you will have something to offer. Neglect them, and you become a beggar looking at others with envy."
    },
    {
      "number": 28,
      "name": "Preponderance of the Great (大過 - Dà Guò)",
      "heart": "The ridgepole sags. The central beam, meant to bear the weight, bends under the strain. The house is sound, the ends are firm—but the middle gives way. This is preponderance of the great: too much weight in the center, too little support at the edges. Extraordinary times call for extraordinary measures. The ridgepole must be replaced, or the house will fall.",
      "ancient": {
        "chinese": "大過。棟橈，利有攸往，亨。",
        "rendering": "Preponderance of the Great. The ridgepole sags. It furthers one to undertake something. Success."
      },
      "judgment": "When the center cannot hold, when the weight is too great, you must act. The ridgepole sags—this is the sign. It furthers to undertake something. Not cautious waiting, not gentle taming, but decisive action. Success comes not from avoiding the crisis, but from meeting it with equal weight. In times of great preponderance, ordinary rules do not apply. You must do what the moment demands, even if it seems excessive. The house can be saved, but only if you act now.",
      "image": "The lake rises above the trees. The noble one stands alone and is undaunted. The lake rises above the trees—water over wood, a preponderance of the yielding over the firm. In such times, the noble one stands alone. Not because they are isolated, but because they are undaunted by the extraordinary. They do not seek company in crisis; they seek truth. Alone, they act, and the world follows or does not. They are undaunted either way.",
      "lines": [
        "To spread white rushes underneath. No blame. When the weight is great, prepare the ground. Spread rushes—soft, yielding—to cushion the fall. This is not weakness; it is wisdom. In extraordinary times, even small preparations matter. No blame.",
        "A withered poplar puts forth a shoot. An old man takes a young wife. Everything furthers. The withered springs new life. The old man, through union with the young, finds renewal. This is the preponderance of the great manifesting as new growth from decay. Everything furthers because the extraordinary situation calls forth extraordinary life.",
        "The ridgepole sags. Misfortune. The sagging is visible, the crisis present. Misfortune because it cannot be ignored. But the line does not end there. It is a fact, not a verdict. The sagging is; now you must respond.",
        "The ridgepole is braced. Good fortune. If there is ulterior motive, it is humiliating. The brace is applied—the crisis is met. Good fortune follows the right action. But if you act with hidden motive, with self-interest disguised as help, humiliation follows. The brace must be pure.",
        "A withered poplar puts forth flowers. An old woman takes a young husband. No blame. No praise. Flowers on a withered poplar—brief, fragile, beautiful, but not lasting. An old woman with a young husband—possible, but not the usual course. No blame, no praise. The extraordinary simply is. Do not judge it; just see it.",
        "Disaster. Wading through water so deep it covers the head. Misfortune. No blame. The final line: disaster, water over the head, drowning. Misfortune, yes. But the line says no blame. Because sometimes the extraordinary overwhelms, and it is not your fault. You waded as far as you could. The water covered you. No blame."
      ],
      "trigrams": {
        "lower": {
          "name": "Xùn (Wind)",
          "nature": "Gentle, penetrating"
        },
        "upper": {
          "name": "Duì (Lake)",
          "nature": "Joyful, reflecting"
        },
        "description": "Wind below, lake above. The wind stirs the lake, but the lake rises above the trees—a preponderance of water over wood, of yielding over firm. This is extraordinary times: the normal order is inverted, and what is usually above is now below. In such times, be ready for anything."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The heavy is the root of the light. The still is the master of the restless.' Hexagram 28 is the loss of this root, this mastery. The ridgepole sags because the weight is too great, the center too heavy. The wise one, in such times, becomes the root, the still point. They stand alone and undaunted, and in their stillness, the house finds a new center."
    },
    {
      "number": 29,
      "name": "The Abysmal (坎 - Kǎn)",
      "heart": "Water over water. Deep calls to deep. The abyss is not one, but two—danger upon danger, depth within depth. This is the nature of the abysmal: you fall, and then you fall again. You think you have reached bottom, and the bottom opens. There is no solid ground, only water, only the endless falling. And yet, water does not fear the abyss. It simply fills it.",
      "ancient": {
        "chinese": "坎。有孚，維心亨，行有尚。",
        "rendering": "The Abysmal. If you are sincere, your heart succeeds. Action brings honor."
      },
      "judgment": "The abyss is real. Danger upon danger, depth within depth. But if you are sincere—if your heart is true, if you do not pretend—then your heart succeeds even in the depths. Not by escaping, but by being fully present. Action in the abyss brings honor, not because you conquer it, but because you meet it without flinching. Water does not fight the abyss; it fills it. You do not need to escape; you need to be fully where you are. In that fullness, the abyss becomes your ground.",
      "image": "Water flows and never fills. The noble one walks in lasting virtue and practices the business of teaching. Water flows endlessly, never filling, never emptying. It simply continues. The noble one learns from this: walk in lasting virtue—not dramatic virtue, but steady, continuous, like water. Practice the business of teaching—pass on what you know, not as a flood, but as a constant stream. In the abyss, this steady flow is the only way. You cannot fill it; you can only move through it.",
      "lines": [
        "In the abyss, you fall into a pit. Misfortune. The first step: you fall, and then fall again. The double abyss. Misfortune because it seems endless. But the line only observes; it does not despair. The fall is real; now you are in the pit.",
        "In the abyss, you strive for small things. Only reaching the rim brings safety. In the depths, do not strive for great things. Small things—a handhold, a breath, a moment of clarity. Reach for the rim, not the sky. Small gains bring safety.",
        "Coming and going, abyss upon abyss. In danger like this, pause, and do not act. If you act, you will only sink deeper. The abyss upon abyss requires stillness, not action. Pause. Let the waters settle. Then, perhaps, a way will appear.",
        "A jug of wine, a bowl of rice, earthen vessels simply handed through the window. There is certainly no blame in this. In the abyss, simple offerings, humble gifts—a jug of wine, a bowl of rice—passed through the smallest opening. This is enough. No blame because you give what you can, and it is received. Connection, even in the depths, sustains.",
        "The abyss is not filled to overflowing; it is filled only to the rim. No blame. Do not try to fill the abyss. You cannot. Fill only to the rim—enough for now, enough to keep going. No blame because you accept the limit. The abyss remains, but you are not drowned.",
        "Bound with cords and ropes, shut in a prison, for three years you do not find the way. Misfortune. The deepest abyss: bound, imprisoned, cut off. For three years—a complete cycle—you do not find the way. Misfortune. The line is stark, without comfort. Some abysses hold you that long. But even here, the water flows. Even here, you are still in motion, still alive. The way may not appear for three years, but it will appear."
      ],
      "trigrams": {
        "lower": {
          "name": "Kǎn (Water)",
          "nature": "Abysmal, dangerous"
        },
        "upper": {
          "name": "Kǎn (Water)",
          "nature": "Abysmal, dangerous"
        },
        "description": "Water over water. Abyss upon abyss. There is no solid ground, only depth calling to depth. This is the nature of danger: it compounds, it deepens. But water does not resist; it flows. In the abyss, become water. Flow, and you will find a way."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The supreme good is like water. It benefits all things and does not contend. It stays in lowly places that others despise. Thus it is near the Tao.' Hexagram 29 is the lowliest place of all—the abyss itself. And water is there, already there, because water always seeks the lowest. The abyss is water's home. When you fall into the abyss, you are not falling away from the Tao; you are falling into it. Be sincere, let your heart succeed, and the water will carry you."
    },
    {
      "number": 30,
      "name": "The Clinging (离 - Lí)",
      "heart": "Fire over fire. Brightness upon brightness. Flame clings to its fuel, yet is never the fuel. It depends, yet it transforms. This is the nature of the clinging: to be dependent and yet independent, to receive and yet give. Fire cannot exist without something to burn, yet in burning, it gives light and warmth. Clinging is not weakness; it is the recognition that all things exist in relationship. Even the sun clings to the sky.",
      "ancient": {
        "chinese": "离。利貞，亨。畜牝牛，吉。",
        "rendering": "The Clinging. Perseverance furthers. Success. Nourish the cow, and good fortune follows."
      },
      "judgment": "To cling is not to grasp; it is to depend rightly, to relate truly. Fire clings to its fuel, but does not possess it. You cling to what sustains you—people, places, practices—but if you try to possess them, the fire goes out. Perseverance in right relationship furthers. Nourish the cow—the gentle, the yielding, the receptive—and good fortune follows. Not because you control, but because you tend. Clinging, rightly done, is the source of all light.",
      "image": "Brightness rising twice. The great person continues the light and illuminates the four quarters. Brightness twice—fire over fire, light multiplied. The great person looks at this image and learns: continue the light. Not your own light only, but the light of those who came before, the light of tradition, of teaching, of example. Continue it, and illuminate the four quarters. Clinging is this continuation: you hold what was given, add your own flame, and pass it on.",
      "lines": [
        "The steps are wrong. But respect can overcome blame. The first step falters, the foot slips. But if you approach with respect—respect for the fire, for what you cling to—the blame can be overcome. Respectful attention corrects many errors.",
        "Yellow light. Supreme good fortune. Yellow is the color of earth, of center, of balance. Light that is yellow—warm, steady, not blinding—this is supreme good fortune. Clinging that is balanced, that does not consume or exhaust, that simply illuminates. This is the light to seek.",
        "Light of the setting sun. If you do not beat the pot and sing, you will sigh in old age. Misfortune. The light fades, as all light fades. If you do not celebrate what remains—beat the pot and sing—you will spend your last days in regret. Clinging accepts the fading and still finds joy. If you cannot, misfortune follows.",
        "Its coming is sudden. It flames up, dies down, is discarded. The sudden blaze—intense, brief, then ash. This is not the clinging that lasts. Do not cling to what flames up suddenly; it will leave you as quickly as it came.",
        "Tears in floods, sighing and lamenting. Good fortune. The depth of feeling, the flood of tears, the honest grief—this is also clinging. To love is to risk loss, and to loss is to weep. The line says good fortune because the tears are real, the grief is true. This honest clinging, even in sorrow, brings its own light.",
        "The king uses him to march forth and punish. He captures the leader and his followers. No wound. Good fortune. At the peak, the clinging one is used for righteous action. He captures the leader and the followers—completes the task—and emerges unwounded. Good fortune because he clung to what was right and let it guide him. The fire did not burn him; it lit his way."
      ],
      "trigrams": {
        "lower": {
          "name": "Lí (Fire)",
          "nature": "Clinging, bright"
        },
        "upper": {
          "name": "Lí (Fire)",
          "nature": "Clinging, bright"
        },
        "description": "Fire over fire. Brightness upon brightness. Flame depends on fuel, yet transforms it. This is clinging: the recognition that all existence is relationship, that nothing stands alone. In this double fire, light multiplies, warmth deepens. Cling rightly, and you will illuminate."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The great Tao flows everywhere. It can go left or right. All things depend on it for life, and it does not turn away.' Hexagram 30 is the Tao's own clinging—not grasping, but flowing with all things. Fire clings to fuel, but does not own it. You cling to life, to love, to light, but if you try to own them, they die. The wise one clings as the Tao clings: depending, yet free; receiving, yet giving; burning, yet never consumed."
    },
    {
      "number": 31,
      "name": "Influence (咸 - Xián)",
      "heart": "Lake over mountain. The mountain, solid and still, receives the lake's moisture. The lake, responsive and open, reflects the mountain's form. Influence is this mutual giving and receiving—not forced, not claimed, but natural as water seeking its own level. A young woman and a young man, drawn together without design. The lightest touch, the slightest glance—influence begins before words, before intention. It is the original connection, the source of all relationship.",
      "ancient": {
        "chinese": "咸。亨，利貞，取女吉。",
        "rendering": "Influence succeeds. Perseverance furthers. Taking a maiden brings good fortune."
      },
      "judgment": "Influence is the meeting of heaven and earth in human form. It succeeds because it is natural, not contrived. Perseverance in this natural openness furthers all relationships. Taking a maiden—entering into union with the receptive, the yielding—brings good fortune because it completes what was incomplete. Not through force, but through mutual attraction. The mountain does not seize the lake; it simply receives. The lake does not grasp the mountain; it simply reflects. This is the model for all true influence: to be fully yourself and let the other be fully themselves, and in that meeting, something new arises.",
      "image": "Lake over mountain. The noble one receives people with emptiness and thus encourages them. Lake over mountain: the water fills the hollows, reflecting whatever comes. The noble one learns: receive people with emptiness—not with preconceptions, not with judgments, but with the open space of genuine attention. In that emptiness, they are encouraged to be themselves. Influence is not about imposing; it is about creating the space for the other to appear.",
      "lines": [
        "Influence in the toes. Toes are the smallest movement, the first stirring. Influence begins there, before you even know it. This is not yet action, just inclination. There is no blame, no praise—just the first hint of connection.",
        "Influence in the calves. Misfortune. Staying brings good fortune. The calves move when the body moves. Influence here is still automatic, unthinking. If you follow it without awareness, misfortune comes. But if you stay—pause, reflect—good fortune follows. Do not let automatic influence carry you away.",
        "Influence in the thighs. You are bound to what follows. To go forward brings humiliation. The thighs follow the hips, follow the whole body. Here, influence is stronger, but still passive. You are bound to what follows, swept along. If you go forward now, without clarifying, humiliation follows. Wait until you can act from the center, not the periphery.",
        "Perseverance brings good fortune. Regret disappears. If you are unsettled, friends follow your thoughts. Now influence reaches the heart, the center. Perseverance here—staying true to what you feel—brings good fortune. Regret disappears because you are no longer passive; you are consciously engaged. Friends may follow your thoughts, drawn by your clarity, but you are not swayed. You are the one who sways.",
        "Influence in the back of the neck. No regret. The neck connects head and body, thought and feeling. Influence here is complete, whole. No regret because you are fully present, fully responsive. The back of the neck cannot see what comes, yet it responds. This is trust: to respond without needing to see first.",
        "Influence in the jaws, tongue, and cheeks. This is the outermost, the expression. Influence that reaches speech, that shapes words. Here, the inner becomes outer, the connection becomes communication. The line does not judge; it describes. What you say now carries all that came before."
      ],
      "trigrams": {
        "lower": {
          "name": "Gèn (Mountain)",
          "nature": "Stillness, resting"
        },
        "upper": {
          "name": "Duì (Lake)",
          "nature": "Joyful, reflecting"
        },
        "description": "Mountain below, lake above. The mountain supports the lake; the lake reflects the mountain. Influence is this mutual resting and reflecting, the natural relationship of stillness and joy. The mountain does not need to be seen; it simply is. The lake does not need to hold; it simply reflects."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The valley spirit never dies; it is called the mysterious female. The gateway of the mysterious female is called the root of heaven and earth.' Hexagram 31 is the valley spirit, the mysterious female—the empty space that receives and thereby creates. Influence is not action; it is presence. Not doing; being. When you are fully present, empty of agenda, you become a valley. Others flow into you, and in that flowing, connection is born."
    },
    {
      "number": 32,
      "name": "Duration (恒 - Héng)",
      "heart": "Thunder over wind. Thunder stirs, wind moves—both are constant, yet always changing. Duration is not rigidity; it is the faithfulness that underlies all transformation. The thunder returns with each storm; the wind blows where it will. Their patterns are reliable, their appearances unpredictable. Duration is the marriage of constancy and change, the vow that holds even as the partners grow.",
      "ancient": {
        "chinese": "恒。亨，无咎，利貞，利有攸往。",
        "rendering": "Duration succeeds. No blame. Perseverance furthers. It furthers one to undertake something."
      },
      "judgment": "Duration is not staying the same; it is staying true. The thunder and wind do not repeat themselves exactly, but their nature endures. Success comes to those who find this deep constancy within change. No blame because you are not clinging to form; you are holding to essence. Perseverance in this deep holding furthers all things. Now it furthers to undertake something—because you are rooted, you can move without losing yourself. Duration is the root that allows the branches to sway.",
      "image": "Thunder and wind. The noble one stands firm and does not change direction. Thunder and wind together—movement upon movement. The noble one learns: stand firm in your direction, not in your position. Do not change your fundamental orientation, but be flexible in how you pursue it. The thunder does not stop being thunder; it just rolls differently each time. The wind does not stop being wind; it just blows where it will. So too, the noble one's virtue is constant, its expression varied.",
      "lines": [
        "Seeking duration too hastily brings misfortune. Nothing that would further. To want duration now, to grasp at it, is to lose it. Duration cannot be seized; it can only be lived. Haste in this matter brings only misfortune.",
        "Regret disappears. To seek duration too hastily brings regret, but if you can let that regret go, it disappears. The line offers a way: do not dwell on the mistake; simply return to the patient practice of constancy.",
        "Not lasting in virtue brings shame. Perseverance in this brings danger. If you cannot hold to your own center, you will be shamed—by circumstance, by others, by yourself. And if you persevere in this unsteadiness, danger follows. Duration requires inner work.",
        "No game in the field. You have sought duration in the wrong place, like hunting where there is no game. The field is empty because your aim was misplaced. Recognize this and redirect.",
        "Lasting in virtue brings perseverance. Good fortune for a woman, misfortune for a man. This line reflects traditional roles: woman's constancy in the home brings good fortune; man's constancy in the world requires adaptation. But deeper: duration must be appropriate to context. What is constant in one sphere may be rigid in another. Know your place and last accordingly.",
        "Restlessness as lasting brings danger. To be perpetually in motion, never settling, never deepening—this is not duration, but its opposite. If this restlessness becomes your lasting state, danger follows. Even the wind rests sometimes."
      ],
      "trigrams": {
        "lower": {
          "name": "Xùn (Wind)",
          "nature": "Gentle, penetrating"
        },
        "upper": {
          "name": "Zhèn (Thunder)",
          "nature": "Arousing, moving"
        },
        "description": "Wind below, thunder above. Wind moves without ceasing; thunder stirs and rolls. Together, they show duration: not stillness, but reliable movement. The wind always blows; the thunder always comes. Their forms change; their nature endures."
      },
      "taoist_reflection": "The Tao Te Ching says: 'The softest thing in the world rides over the hardest thing in the world. That which has no substance enters where there is no space.' Hexagram 32 is the soft constancy that outlasts all hardness. Wind and thunder are soft—they cannot be grasped, yet they shape mountains and forests. Lasting virtue is the same: not rigid, but faithful; not unchanging, but true. In this soft constancy, all things are accomplished."
    }
  ]
}