[
  {
    "number": 1,
    "name": "The Creative (乾 - Qián)",
    "heart": "Six unbroken lines, stacked like a ladder to the sky. Pure yang. The force that moves the stars without effort, that turns the seasons without hurry. Before any doing, there is this: the power simply to be, to generate, to begin. The Creative does not struggle—it creates by being itself, the way the sky does not try to be vast, it simply is.",
    "ancient": {
      "chinese": "乾。元亨利貞。",
      "rendering": "THE CREATIVE works sublime success, Furthering through perseverance."
    },
    "judgment": "There is a power in you that precedes all action. It is not something you earn or achieve—it is your birthright, the original energy that brought you here. When you act from this place, success follows not because you forced it, but because you aligned with something larger. The four virtues are one: origin that unfolds, flow that encounters no obstacle, nature that finds its true expression, and the firmness that endures. Do not mistake this for ambition. The Creative does not grasp; it radiates.",
    "image": "The movement of heaven is full of power. Thus the superior person makes themselves strong and untiring. Heaven does not pause. It does not rush. It simply moves, endlessly, like breath, like a heartbeat. To be strong and untiring is not to push against the world, but to remain so deeply yourself that you never need to stop. Like the sky that holds the stars without effort, you hold your center through all seasons.",
    "lines": [
      "Hidden dragon. Do not act. The power is there, coiled like a dragon beneath the earth, but the time is not yet ripe. To push now would be to break the sprout before it breaks the soil. Rest in the darkness. Let the roots grow. The world does not need to see you yet. It needs you to become real.",
      "Dragon appearing in the field. It furthers one to see the great person. Now the first green shoot appears. Not yet a tree, but unmistakably alive. You emerge into the field of human affairs, and those with eyes to see recognize something genuine in you. Do not mistake this for fame or status. It is simply the natural result of being real—others feel it, the way they feel sunlight without being told.",
      "All day long, the creative person is actively creating. At nightfall, their mind is still beset with cares. Danger. No blame. The work has begun, and it is good. But with doing comes the noise of doing—plans, worries, the endless chatter of 'what next.' This is the danger: that the activity consumes the stillness from which it came. The sage works all day, then returns to silence. Can you?",
      "Wavering flight over the depths. No blame. Now you have climbed high enough to see the abyss. Below you, the vast unknown. Two paths open: to soar higher into the world's view, or to dive deep into solitude and self-discovery. Neither is wrong. The only mistake is to choose from fear. Ask the depths which way is yours.",
      "Flying dragon in the heavens. It furthers one to see the great person. At last, full expression. The dragon that was hidden, then appearing, then active, then hovering, now flies free across the sky. This is not conquest—it is fulfillment. Like a tree that has reached its full height and now simply offers shade. Those who see you at this stage are blessed not by your power, but by your completion.",
      "Arrogant dragon will have cause to repent. The sky has no top. To keep climbing beyond yourself is to leave the earth entirely, to become nothing. The dragon that forgets it once came from the depths loses its way. Pride is not the fall—it is the forgetting that you were ever small. Stay connected to the ground, even in flight."
    ],
    "trigrams": {
      "lower": {
        "name": "Qián (Heaven)",
        "nature": "The creative, the originating, the power to begin"
      },
      "upper": {
        "name": "Qián (Heaven)",
        "nature": "The active, the moving, the power to continue"
      },
      "description": "Heaven above heaven. Movement generating more movement. This is not repetition, but the endless unfolding of what is genuine. Like one wave following another, each new, each the same ocean. The lower heaven is your inner source; the upper heaven is your outer expression. When they are the same, you live without division."
    },
    "taoist_reflection": "The Tao Te Ching says: 'The Tao never acts, yet nothing is left undone.' Hexagram 1 is the living proof. Pure yang, pure creative power—yet it does not grasp, demand, or strive. It simply is, and in its being, all things arise. The dragon does not try to be powerful; it is powerful, and so it flies. The sky does not try to be vast; it is vast, and so it holds the stars. The sage does not try to lead; they are real, and so others follow—not because they are pushed, but because they recognize something they already carry within themselves. This is the teaching of The Creative: before any doing, be. And from that being, let action flow like water from an endless spring."
  },
  {
    "number": 2,
    "name": "The Receptive (坤 - Kūn)",
    "heart": "Six broken lines. Earth receiving heaven. The mare running across the endless plain, asking nothing, becoming everything. Where the Creative gives birth to ideas, the Receptive brings them into form. It does not initiate—it completes. It does not command—it supports. This is not weakness. The earth does not struggle to be fertile; it simply opens, and life springs forth.",
    "ancient": {
      "chinese": "坤。元亨利牝馬之貞。君子有攸往，先迷後得主，利。西南得朋，東北喪朋。安貞吉。",
      "rendering": "THE RECEPTIVE brings about sublime success, Furthering through the perseverance of a mare. If the superior person undertakes something and tries to lead, they go astray; but if they follow, they find guidance. It is favorable to find friends in the west and south, to forego friends in the east and north. Quiet perseverance brings good fortune."
    },
    "judgment": "There is a power in you that does not push—it receives. Like soil receiving rain, like the valley receiving the stream, like the mare running not to conquer the plain but to become one with it. This is the perseverance of the mare: not stubbornness, but faithful, steady movement within the whole. To try to lead here is to lose the way. To follow—not weakly, but with full presence—is to find guidance. The Receptive teaches that some things come only when we stop reaching for them. They arrive in the space we have held open.",
    "image": "The earth's condition is receptive devotion. Thus the superior person carries the outer world with broad virtue. The earth does not select what it receives. It accepts rain and drought, seed and stone, the footstep and the resting body. Its virtue is its vast capacity to hold all things without judgment. In the same way, the wise one develops a heart wide enough to contain the world—not to control it, but to support it. This is true strength: to carry without complaint, to hold without possessing.",
    "lines": [
      "Hoarfrost underfoot. Solid ice follows. The first sign—a chill in the air, frost on the grass. It seems small, insignificant. But frost is the beginning of ice. The Receptive teaches through accumulation. What you allow today, you invite tomorrow. Not as punishment, but as nature. Tend the small beginnings, for they become your ground.",
      "Straight, square, great. No need for practice, nothing that does not further. The earth is straight—it follows its nature without deviation. It is square—it contains all things within its four directions. It is great—it holds everything without exception. When you are simply yourself, fully, without pretense, your actions become like the earth: direct, containing, vast. You need not practice being what you already are.",
      "Hidden lines. One can remain persevering. If by chance you are in the service of a king, seek not works, but bring to completion. Sometimes the way is to be invisible. Not hidden because you are hiding, but hidden because the work does not need your name on it. Like the earth that supports the tree without needing to be seen in its branches, you complete things without claiming them. This is not self-effacement—it is the wisdom of knowing when your presence is the gift, not your label.",
      "A tied-up sack. No blame, no praise. There are times when the wise one binds themselves like a sack—closed, contained, revealing nothing. This is not fear; it is appropriateness. When the world is not ready to receive, or when your inner work requires silence, you close. No blame follows, because you have harmed nothing. But also no praise, because praise comes from opening. Learn when to tie the sack, and when to loosen it.",
      "A yellow lower garment. Supreme good fortune. Yellow is the color of earth, of the center, of balance. A lower garment is humble, close to the ground, yet essential. To wear yellow is to be rooted in the center. To wear the lower garment is to be content with what supports, not what shines. This is supreme good fortune: to be exactly where you belong, doing exactly what is yours to do, asking nothing more.",
      "Dragons fight in the meadow. Their blood is black and yellow. When the receptive forgets its nature and tries to become creative, conflict follows. Dragons—creatures of heaven—descend to the meadow, the realm of earth. They fight. Their blood, the mingling of heaven (black) and earth (yellow), stains the grass. This is what happens when yielding becomes striving, when supporting becomes competing. The blood is not punishment—it is the natural consequence of being what you are not. Stay in your ground."
    ],
    "trigrams": {
      "lower": {
        "name": "Kūn (Earth)",
        "nature": "Devoted, yielding, receptive"
      },
      "upper": {
        "name": "Kūn (Earth)",
        "nature": "Supporting, completing, containing"
      },
      "description": "Earth above earth. Devotion that deepens devotion. Not passivity, but active, faithful presence. The lower earth is your inner ground—your capacity to receive your own experience without judgment. The upper earth is your outer expression—your way of holding others with the same unconditional acceptance. When they are the same, you become ground for yourself and others."
    },
    "taoist_reflection": "The Tao Te Ching says: 'The supreme good is like water. It benefits all things without contention. It stays in lowly places that others despise. Thus it is near the Tao.' Hexagram 2 is water's elder sister—earth itself. Even lower than water, even more receptive. Earth asks nothing, claims nothing, yet all things return to it in the end. This is the power of true humility: not thinking less of yourself, but thinking of yourself less. The mare does not try to be fast like the dragon; she runs her own run, and in that running, she is complete. The Receptive teaches that to follow is not to be less—it is to find the one thing you were always meant to complete, and to complete it without needing to be seen doing so."
  }
]