[
{
  "number": 33,
  "name": "Retreat (遯 - Dùn)",
  "heart": "Mountain under heaven. The mountain rises, but heaven recedes. There are times when the only wise response is to withdraw—not in fear, but in recognition that the moment is not yours. The mountain does not chase the sky; it rests in its own massiveness, letting heaven do what heaven does. Retreat is not defeat; it is alignment with the natural order. When the tide goes out, the wise fisher does not chase the water; they wait.",
  "ancient": {
    "chinese": "遯。亨，小利貞。",
    "rendering": "Retreat succeeds. In small matters, perseverance furthers."
  },
  "judgment": "Retreat is not running away; it is choosing the right moment to step back. Success comes to those who recognize when the time is not ripe for advance. In small matters, perseverance furthers—you can still attend to the details, still maintain your integrity, still prepare. But in great matters, wait. The mountain does not try to stop the sky from receding; it simply remains mountain. When the tide returns, you will still be here.",
  "image": "Mountain under heaven. The noble one keeps the petty person at a distance, not with anger but with dignity. Mountain under heaven: the mountain is great, but it does not try to fill the sky. It keeps its distance naturally, by being what it is. The noble one learns: when faced with the petty, the small-minded, the unready, do not fight or flee in panic. Simply keep your distance, with dignity. Let your presence itself be the retreat. They will feel the space you hold and either grow or move on.",
  "lines": [
    "At the tail in retreat. This is dangerous. Do not undertake anything. To be last in retreat, to hesitate too long, is dangerous. The tail is caught. Now, do not undertake anything—any action now will only worsen the position. Wait for a better moment.",
    "He holds him fast with yellow oxhide. No one can tear him loose. Yellow is the color of the center, of earth. Oxhide is strong, flexible. To hold to the center with flexible strength—this is the retreat that succeeds. No force can tear you from this holding because you are not attached to outcome, only to truth.",
    "A halted retreat brings danger and distress. To keep people and servants brings good fortune. If you halt the retreat, if you try to stay when you should go, you bring distress upon yourself. But if you attend to those close to you—people and servants, your immediate circle—that brings good fortune. Even in retreat, you can care for what is near.",
    "A noble person in retreat brings good fortune. A petty person cannot. The noble one retreats with grace, with dignity, and this very retreat brings good fortune because it preserves their essence. The petty person, attached to position and appearance, cannot retreat; they cling and are destroyed.",
    "Friendly retreat. Perseverance brings good fortune. To retreat with friends, with companions who understand, is blessed. You are not alone in your withdrawal; you have those who share your sense of timing. Persevere in this friendly retreat, and good fortune follows.",
    "Cheerful retreat. Everything furthers. The highest retreat: not grudging, not fearful, but cheerful. You see clearly that this is the right moment, and you withdraw with joy, trusting the return. Everything furthers because you are aligned, not resistant."
  ],
  "trigrams": {
    "lower": "Gèn (Mountain), stillness, resting",
    "upper": "Qián (Heaven), creative, strong",
    "description": "Mountain below, heaven above. The mountain rises, but heaven recedes. This is retreat: the strong withdraw, not from weakness, but from wisdom. The mountain does not need to chase the sky; it waits, and the sky will return."
  },
  "taoist_reflection": "The Tao Te Ching says: 'Yield and overcome; empty and become full; bend and become straight.' Hexagram 33 is the art of yielding, of retreating not to lose but to win. The highest good is like water—it yields to every obstacle, yet in the end, nothing can stop it. Retreat is water's way: go around, wait, return. The mountain will still be here when the sky comes back."
},
{
  "number": 34,
  "name": "Great Power (大壮 - Dà Zhuàng)",
  "heart": "Thunder in heaven. The sound rolls across the sky, unstoppable, immense. Great power is not the power to dominate, but the power to move without obstruction. The thunder does not need to fight the clouds; it simply sounds, and the clouds part. True power is effortless because it is aligned. When you have great power, you do not need to prove it. It proves itself by its presence, like the sky that holds the thunder without trembling.",
  "ancient": {
    "chinese": "大壮。利貞。",
    "rendering": "Great Power. Perseverance furthers."
  },
  "judgment": "Great power is not for conquest; it is for expression. When power is truly great, it does not need to assert itself; it simply is. Perseverance in this quiet greatness furthers all things. Do not use your power to dominate; use it to create, to move, to clear away obstacles. The thunder does not command the sky; it fills it. Your power, rightly held, fills your world without needing to force. Persevere in this right use, and nothing can stop you.",
  "image": "Thunder in heaven. The noble one does not tread where there is no order. Thunder in heaven: the sound is immense, but it comes in its own time, following the order of the sky. The noble one learns: do not tread where there is no order. Do not apply your power where it cannot be received. Wait for the right context, the right moment. Power used in chaos creates more chaos. Power used in order creates more order.",
  "lines": [
    "Power in the toes. To go forward brings misfortune. The toes—the smallest movement. To use power here, at the first stirring, before you have any ground, brings misfortune. Wait until you are more firmly placed.",
    "Perseverance brings good fortune. The power is real, but it must be held rightly. Perseverance in this right holding brings good fortune. Not yet action, just the steady presence of power, waiting.",
    "The common person uses power. The noble person does not. To use power aggressively, to push and shove—this is the way of the common person. The noble one knows that true power does not need to be used; it simply is. To use it is to diminish it.",
    "Perseverance brings good fortune. Regret disappears. The hedge opens; there is no entanglement. Power now finds its way. The hedge that blocked you opens; the entanglements dissolve. Perseverance in the right holding has prepared you, and now you can move without regret.",
    "Loses the goat with ease. No regret. The goat butts, pushes, insists. To lose the goat—to let go of the need to push, to insist—is to gain true power. No regret because you have given up nothing real; you have only shed what was false.",
    "The goat butts against the hedge. It cannot go back, it cannot go forward. Nothing furthers. If you persist in pushing, insisting, you will find yourself stuck—cannot go back, cannot go forward. The hedge holds you. Nothing furthers now because you refused to let go of the goat. When power is used wrongly, it traps you."
  ],
  "trigrams": {
    "lower": "Qián (Heaven), creative, strong",
    "upper": "Zhèn (Thunder), arousing, moving",
    "description": "Heaven below, thunder above. Thunder in heaven—the sound that moves across the sky, unstoppable, immense. Great power is this: movement that is fully supported by the creative ground. Thunder without heaven is just noise; thunder in heaven is the voice of power itself."
  },
  "taoist_reflection": "The Tao Te Ching says: 'To know the masculine and keep to the feminine is to be the valley of the world.' Hexagram 34 is the masculine known and held. Great power is not the power that asserts; it is the power that is so complete it does not need to assert. Like the valley that contains all streams, it simply is, and everything flows to it. The noble one does not use power; they embody it, and in that embodiment, the world is moved."
},
{
  "number": 35,
  "name": "Progress (晋 - Jìn)",
  "heart": "Fire over earth. The sun rising over the great plain, illuminating everything, warming everything. Progress is this: not striving, not forcing, but the natural advance of light. The sun does not struggle to rise; it simply rises, and the world is lit. Progress in the human realm is the same: when you are clear, bright, and sincere, you advance without effort. The light itself opens the way.",
  "ancient": {
    "chinese": "晋。康侯用錫馬蕃庶，晝日三接。",
    "rendering": "Progress. The noble prince is honored with horses in multitude. In a single day he is received three times."
  },
  "judgment": "True progress is like the sun at dawn: inevitable, gentle, and illuminating. When you are sincere and capable, recognition comes naturally—not because you sought it, but because your light is visible. The noble prince, honored with many horses, received three times in one day—this is not luck; it is the natural response of the world to genuine brightness. Progress is not about climbing; it is about becoming so fully yourself that the world cannot help but make space for you.",
  "image": "Fire over earth. The noble one brightens their bright virtue. Fire over earth: the sun illuminates the plain, making everything visible. The noble one learns: brighten your bright virtue. Not acquire new virtue, but polish what is already there. Let your inherent goodness become more visible, more radiant. This polishing itself is progress. The sun does not become brighter; it simply becomes more fully itself as it rises.",
  "lines": [
    "Progressing, but turned back. Perseverance brings good fortune. If you meet no confidence, be magnanimous, and no blame. Your advance is blocked; you are turned back. But if you persevere in your own brightness, good fortune comes. Even if others do not yet trust you, be magnanimous—hold no grudge. In time, your light will be seen.",
    "Progressing, but in sorrow. Perseverance brings good fortune. You receive this blessing from your grandmother. Advance brings sorrow—because progress often means leaving something behind. But perseverance brings good fortune. The blessing comes from the grandmother—from tradition, from the feminine, from the deep past. You carry it with you, even as you move forward.",
    "All are in accord. Regret disappears. To advance without confidence from others is hard; when all are in accord, regret dissolves. The line reminds that progress is not solitary; it is communal. When your light is bright enough, others naturally align.",
    "Progressing like a hamster. Perseverance brings danger. To hoard, to advance with greed, to move like a hamster gathering more than it needs—this brings danger. Perseverance in this grasping leads to ruin. Progress must be generous, not grasping.",
    "Regret disappears. Taking gain or loss, do not be concerned. Going forward brings good fortune. Everything furthers. At this stage, you are beyond concern for gain or loss. Your progress is not about what you get; it is about what you become. Going forward now brings good fortune because you are free of attachment. Everything furthers because you are not holding anything back.",
    "Progressing with the horns. Only to attack the city. Misfortune. Perseverance brings danger. No blame. To use your horns—your sharpness, your aggression—to advance is to attack the city, to force your way. This brings misfortune. Perseverance in this mode brings danger. But the line says no blame—perhaps because sometimes you must use the horns, but know that it is not the way of true progress. It is a fallback, not the path."
  ],
  "trigrams": {
    "lower": "Kūn (Earth), receptive, yielding",
    "upper": "Lí (Fire), clinging, bright",
    "description": "Earth below, fire above. The sun rising over the plain—this is progress: the light advancing naturally, warming all it touches. The earth receives; the fire gives. Progress is this mutual giving and receiving, the dance of brightness and ground."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The great Tao flows everywhere. It can go left or right. All things depend on it for life, and it does not turn away.' Hexagram 35 is this flowing Tao, the sun that rises without effort, the progress that is simply the nature of things. The wise one does not seek to advance; they seek to be bright. And in that brightness, advancement comes of itself."
},
{
  "number": 36,
  "name": "Darkening of the Light (明夷 - Míng Yí)",
  "heart": "Earth over fire. The sun setting, sinking below the plain. Light withdraws; darkness advances. This is darkening of the light—not the absence of light, but its concealment. The sun is still there, still burning, but hidden. In times of darkness, the wise one does not rage against the night; they wait, they preserve, they tend the inner flame. The light will return, but first, the darkness must be honored.",
  "ancient": {
    "chinese": "明夷。利艱貞。",
    "rendering": "Darkening of the Light. In adversity, perseverance furthers."
  },
  "judgment": "There are times when light is obscured, when truth is hidden, when the good are oppressed. In such times, the only wisdom is to persevere in adversity. Not to fight the darkness directly—that would waste your light. But to preserve your inner flame, to tend it secretly, to wait. The sun does not struggle against the night; it simply continues its course, and in time, it rises again. Your perseverance in this hiddenness furthers not only your own survival but the eventual return of light.",
  "image": "Earth over fire. The noble one governs the multitude with obscurity, yet remains bright within. Earth over fire: the light is hidden, but not extinguished. The noble one learns: in governing, sometimes you must be obscure, not drawing attention, not asserting. Yet within, remain bright. Your clarity is your own; do not let the outer darkness dim it. Govern with obscurity, but never lose the inner light.",
  "lines": [
    "Darkening of the light during flight. He lowers his wings. The noble one, in travel, goes three days without eating. But he has somewhere to go. The host has cause to speak. When the light is darkened, even in flight you must lower your wings, go unnoticed. You may go without food, endure hardship. But you have somewhere to go—a purpose, a destination. Even the host who does not understand you will have cause to speak of your perseverance.",
    "Darkening of the light. He is wounded in the left thigh. He uses a horse to rise again. Good fortune. Wounded, but not fatally. The left thigh—not the center, not the heart. You can still move, still rise, with help—the horse that carries you. Good fortune comes because you do not let the wound stop you. You find a way to go on.",
    "Darkening of the light during the hunt in the south. Their great leader is captured. Misfortune. To hunt, to seek, to strive—in times of darkness, this leads to capture. The great leader, the one you follow, is taken. Misfortune because you sought when you should have hidden. Learn: in darkness, do not hunt; wait.",
    "He penetrates the left side of the belly. He grasps the heart of the darkening of the light. And leaves through the gate and courtyard. To go to the heart of the darkness, to understand it from within—this is the way of the sage. He enters, grasps, then leaves. He is not trapped because he does not cling. He understands, and that understanding frees him.",
    "Darkening of the light as with the prince of Ji. Perseverance furthers. The prince of Ji was a wise man who feigned madness to survive in dark times. His perseverance in this self-concealment furthered not only his own life but the preservation of wisdom for later. In darkness, sometimes you must appear less than you are to preserve what you truly are.",
    "Not bright but dark. He first ascends to heaven, then plunges into the earth. The one who was not bright within, who had no inner light, ascends only to fall. Without inner flame, there is no anchor; you rise with the times and fall with them. The darkening consumes you because you were never truly lit."
  ],
  "trigrams": {
    "lower": "Lí (Fire), clinging, bright",
    "upper": "Kūn (Earth), receptive, yielding",
    "description": "Fire below, earth above. The light is hidden, buried under earth. This is darkening of the light: the brightness is still there, but concealed. In times of darkness, remember: the sun has not died; it has simply gone underground. It will rise again."
  },
  "taoist_reflection": "The Tao Te Ching says: 'He who knows the masculine and keeps to the feminine becomes the valley of the world.' Hexagram 36 is the masculine hidden within the feminine, the light concealed within the dark. The wise one in dark times does not fight; they yield, they hide, they wait. They become the valley that holds the seed of light until the sun returns. This is not cowardice; it is the deepest wisdom."
},
{
  "number": 37,
  "name": "The Family (家人 - Jiā Rén)",
  "heart": "Wind over fire. Wind fans the flame, making it brighter, steadier. Fire warms the wind, giving it direction. This is the family: mutual influence, mutual support, each strengthening the other. Not through force, but through the natural interaction of their natures. The family is the first society, the original school of virtue. In it, we learn to be ourselves in relation to others, to give and receive, to hold and let go.",
  "ancient": {
    "chinese": "家人。利女貞。",
    "rendering": "The Family. Perseverance of the woman furthers."
  },
  "judgment": "The family is the root of all order. In it, we learn the virtues that sustain the world: loyalty, patience, generosity, forgiveness. The perseverance of the woman—the receptive, the nurturing, the constant—furthers because it provides the steady ground on which the family rests. But the family requires both wind and fire, both the moving and the warming. Each has its place, its role. When each fulfills its nature, the family flourishes. When roles are confused or forced, the family weakens. Know your place in the family, and fill it fully.",
  "image": "Wind over fire. The noble one speaks with substance and acts with constancy. Wind over fire: the wind moves, the fire responds. Their interaction is real, not abstract. The noble one learns: speak with substance—words that mean something, that come from the heart. Act with constancy—behavior that others can rely on. In the family, more than anywhere, substance and constancy matter. Your family knows you; you cannot pretend. So be real.",
  "lines": [
    "Fences within the family. Regret disappears. Boundaries are necessary, even in the closest relationships. Fences mark where one ends and another begins. Without them, there is entanglement, confusion. With them, regret disappears because each knows their place and can be themselves within it.",
    "She should not follow her whims. She should attend within. Good fortune. The woman, the nurturing heart, should not be ruled by passing desires. Attend within—to the family, to the home, to the steady work of care. This is not limitation; it is the source of good fortune. The family needs someone who is reliably present, not chasing every impulse.",
    "If the family is severe, regret and danger, but good fortune. If woman and child giggle and snort, in the end there is humiliation. Better to be too strict than too lax. Severity may bring regret and danger—it is not pleasant—but it preserves order. Laxness, giggling, lack of discipline—this leads to humiliation because the family loses its shape. Choose the severity that holds, not the laxness that dissolves.",
    "The riches of the family. Great good fortune. When the family is in order, it generates wealth—not just money, but resources of all kinds: time, attention, love, support. This is great good fortune because it sustains not just the family but all who come near it.",
    "As a king, approach the family. Do not be concerned. Good fortune. The family is the model for all governance. As a king—as any leader—approach your people as you would your family: with love, with constancy, with attention. Do not be concerned about your status; simply be present. Good fortune follows.",
    "His work commands respect. In the end, good fortune. The one who has fulfilled their role in the family, who has been constant and real, commands respect not by demanding it but by earning it. In the end, good fortune comes—not as reward, but as the natural outcome of a life well lived in the first society."
  ],
  "trigrams": {
    "lower": "Lí (Fire), clinging, bright",
    "upper": "Xùn (Wind), gentle, penetrating",
    "description": "Fire below, wind above. The wind fans the fire; the fire warms the wind. Their mutual influence is the family: each supporting the other, each becoming more itself through the relationship. The fire does not lose itself in the wind; it burns brighter. The wind does not lose itself in the fire; it moves more truly."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The great Tao has no name. Yet it nourishes and completes all things.' Hexagram 37 is the family as the Tao in miniature: a nameless order that nourishes and completes its members. Not through rules, but through relationship. Not through force, but through mutual influence. The family that follows the Tao needs no laws; it simply functions, like wind over fire, each doing what is natural, and the whole flourishing."
},
{
  "number": 38,
  "name": "Opposition (睽 - Kuí)",
  "heart": "Fire over lake. Fire rises, lake sinks. They move apart, each following its nature, yet they are part of the same landscape. Opposition is not enmity; it is the natural divergence of things that are different. The fire and the lake cannot be the same, but they can coexist, each enriching the whole in its own way. In human life, opposition arises when two people, two groups, two truths seem irreconcilable. But opposition, rightly understood, is not the end of relationship; it is the beginning of a larger understanding.",
  "ancient": {
    "chinese": "睽。小事吉。",
    "rendering": "Opposition. In small matters, good fortune."
  },
  "judgment": "When fire rises and water sinks, they seem opposed. But they are still part of one world. In opposition, do not seek to force union; seek to understand difference. In small matters, good fortune—because small differences can be bridged, small conflicts resolved. Great matters may wait. The wise one in times of opposition does not try to make everything one; they let each thing be what it is, and find the hidden connection that underlies all difference. The fire and the lake are both necessary; the world needs both rising and sinking.",
  "image": "Fire over lake. The noble one finds common ground in difference. Fire over lake: they move apart, yet they are part of the same view. The noble one learns: in opposition, do not focus on what divides; find the common ground that underlies all difference. Even enemies share the same sky. In that shared sky, connection is possible. The noble one seeks this common ground, not to erase difference, but to make relationship possible despite it.",
  "lines": [
    "Regret disappears. If you lose your horse, do not pursue it. It will return of itself. See the bad person, and avoid blame. In opposition, first loss—the horse runs away. Do not chase; it will return. And when you encounter the bad person—the one who opposes you—do not engage. Avoid blame by not entering their field. Wait, and the horse returns.",
    "Meeting your lord in a narrow lane. No blame. In opposition, meetings are unexpected, in narrow places. But they happen. If you meet your lord—the one you should follow—in such a constrained way, there is no blame. Even narrow lanes can lead to connection.",
    "You see the wagon dragged back, the oxen halted, the man with the burned hair and the slashed nose. Not a good beginning, but a good end. Opposition at its most visible: everything blocked, everyone hurt. The beginning is not good. But the line insists: a good end is possible. Persevere through the ugliness.",
    "Isolated through opposition, you meet a like-minded man. With him you can work. Danger, but no blame. Isolation is the fruit of opposition. But in that isolation, you meet one who shares your mind. With that one, you can work. Danger remains—you are still opposed by the world—but no blame because you have found your ally.",
    "Regret disappears. The companion bites through the wrappings. If you go to him, how could it be a blame? The companion—the one who shares your mind—breaks through what separates you. The wrappings, the veils, the misunderstandings. If you go to him now, there is no blame. The connection is real, and it overcomes opposition.",
    "Isolated through opposition, you see a pig covered with dirt, a wagon full of ghosts. First you draw your bow, then you lay it aside. Not a robber, but a suitor. If you go, rain comes. Good fortune. The final line: opposition at its most bizarre—seeing ghosts, monsters, threats. You prepare to fight. Then you see clearly: not a robber, but a suitor. You lay down the bow. If you go forward, rain comes—cleansing, resolution. Good fortune follows because you saw through the illusion."
  ],
  "trigrams": {
    "lower": "Duì (Lake), joyful, reflecting",
    "upper": "Lí (Fire), clinging, bright",
    "description": "Lake below, fire above. Fire rises, lake sinks—they move apart. This is opposition: the natural divergence of different natures. Yet they are part of the same world, the same landscape. The fire and the lake both have their place. In opposition, honor the difference, and find the hidden unity."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The heavy is the root of the light. The still is the master of the restless.' Hexagram 38 is the light and the restless in opposition to the heavy and the still. But opposition is not ultimate. The heavy and light, still and restless—they are two poles of one Tao. The wise one does not take sides; they stand in the center and see both. From that center, even opposites can meet."
},
{
  "number": 39,
  "name": "Obstruction (蹇 - Jiǎn)",
  "heart": "Water over mountain. The mountain rises, steep and unyielding. Water flows, seeking the lowest ground. Before the mountain, water must pause, must find a way around, must wait. Obstruction is this: the natural flow blocked, the way ahead closed. Not a punishment, not a failure—simply a fact of the landscape. In obstruction, the wise one does not rage against the mountain; they stop, look, and find another way.",
  "ancient": {
    "chinese": "蹇。利西南，不利東北。利見大人，貞吉。",
    "rendering": "Obstruction. The southwest furthers; the northeast does not further. It furthers to see the great person. Perseverance brings good fortune."
  },
  "judgment": "When you meet obstruction, do not push forward blindly. The southwest—the direction of retreat, of openness—furthers. The northeast—the direction of advance, of the steepest climb—does not further. In obstruction, it furthers to see the great person—one who sees clearly, who can show you the way around. Perseverance in this seeking, this waiting, brings good fortune. The water does not fight the mountain; it finds a way around. So must you.",
  "image": "Water over mountain. The noble one turns within and cultivates virtue. Water over mountain: the flow is blocked, the way is steep. The noble one learns: when outward progress is obstructed, turn within. Cultivate virtue—patience, clarity, compassion. The mountain will not move, but you can move within. This inner cultivation prepares you for the time when the way opens again.",
  "lines": [
    "Going leads to obstruction, coming meets praise. To go forward now is to meet obstruction. To come back, to retreat, is to be praised. Not because retreat is glorious, but because it is wise. The praise is for the wisdom, not the retreat.",
    "The king's servant meets obstruction upon obstruction. Not through his own fault. Some obstructions are not of your making. The king's servant, faithful and true, still meets obstacle after obstacle. This is not his fault; it is the nature of the times. The line offers no solution, only recognition. Sometimes you must simply endure.",
    "Going leads to obstruction, therefore he returns. The simplest reading: you try, it's blocked, you return. No blame in this—it is just the natural response. Obstruction teaches you when to stop.",
    "Going leads to obstruction, coming leads to union. To go forward is blocked; to return is to find connection. In returning, you meet others who also stopped, who also wait. Union is possible now, in the pause. Do not see obstruction only as loss; see it also as the condition for community.",
    "In the midst of the greatest obstruction, friends come. The deepest block, the hardest time—and friends appear. Not to remove the obstruction, but to be with you in it. Their presence is the help. Perseverance in this shared waiting brings good fortune.",
    "Going leads to obstruction, coming leads to great good fortune. It furthers to see the great person. The final line: after all the obstruction, the return, the waiting—now, coming (not going) leads to great good fortune. And it furthers to see the great person—the one who sees clearly, who can guide you through what remains. Obstruction has taught you; now you are ready."
  ],
  "trigrams": {
    "lower": "Gèn (Mountain), stillness, resting",
    "upper": "Kǎn (Water), abysmal, dangerous",
    "description": "Mountain below, water above. Water encounters mountain and is blocked. This is obstruction: the natural flow stopped by something immovable. The water does not fight; it waits, it pools, it finds another way. In obstruction, become water—patient, persistent, adaptable."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The softest thing in the world rides over the hardest thing in the world.' Hexagram 39 is the softest thing—water—meeting the hardest—mountain. Water does not try to break the mountain; it goes around, under, through—slowly, patiently. In the end, water shapes the mountain more than the mountain shapes water. Obstruction is not defeat; it is the beginning of a deeper path."
},
{
  "number": 40,
  "name": "Deliverance (解 - Xiè)",
  "heart": "Thunder over water. The storm breaks, the rain falls, the tension releases. Deliverance is this: the moment when what was bound is freed, when what was stuck moves again. Not by force, but by the natural release of accumulated pressure. Thunder rolls, rain pours, and the world breathes again. In human life, deliverance comes after long obstruction—sudden, welcome, complete. The knot unties; the path opens.",
  "ancient": {
    "chinese": "解。利西南。无所往，其來復吉。有攸往，夙吉。",
    "rendering": "Deliverance. The southwest furthers. If there is nowhere to go, coming back brings good fortune. If there is somewhere to go, acting quickly brings good fortune."
  },
  "judgment": "After obstruction, deliverance. The southwest—the direction of openness, of yielding—furthers. If there is nowhere to go, if the way is still unclear, then coming back—returning to stillness—brings good fortune. Do not force the opening. But if there is somewhere to go, if the way is clear, then act quickly—夙吉, early good fortune. Do not delay once deliverance comes. The thunder does not hesitate; it rolls. The rain does not pause; it falls. When the moment of release arrives, meet it with equal swiftness.",
  "image": "Thunder over water. The noble one forgives transgressions and pardons crimes. Thunder over water: the release of tension, the breaking of the storm. The noble one learns: in times of deliverance, forgive. Transgressions committed under pressure, crimes born of obstruction—these can now be pardoned. The release of outer tension allows the release of inner judgment. Deliverance is not just for you; extend it to others. Let the thunder wash away not only your own burdens but the burdens you have placed on others.",
  "lines": [
    "No blame. The simplest line: in deliverance, there is no blame. The release is clean, complete. Do not look for fault; just accept the freedom.",
    "In the hunt, you catch three foxes. You receive a yellow arrow. Perseverance brings good fortune. Foxes are cunning, tricky—the lingering effects of obstruction. In deliverance, you catch them, you resolve them. You receive a yellow arrow—yellow, the color of the center, of earth. The arrow is guidance, direction. With this, persevere, and good fortune follows.",
    "If you carry a burden and ride in a wagon, you attract robbers. Perseverance brings danger. In deliverance, do not carry old burdens into new freedom. If you ride in the wagon of release while still holding the weight of what was, you attract robbers—those who will take advantage of your lingering attachment. Let the burden go. Travel light.",
    "Deliver yourself from your own weight. Trust, and friends will come. The first step is to release yourself—from your own expectations, your own judgments, your own weight. In that release, trust arises. And friends—those who will walk with you in the new openness—appear naturally.",
    "The noble person delivers themselves. Good fortune. They show themselves to the petty person. The noble one does not wait for deliverance from outside; they deliver themselves. This self-liberation brings good fortune. And in their freedom, they show themselves to the petty person—not to shame, but to offer an example. The petty person may not follow, but they have seen what is possible.",
    "The prince shoots at a hawk on a high wall. He kills it. Everything furthers. The hawk is the last obstacle, the one that still threatens from above. In deliverance, you must sometimes take decisive action to remove what endangers the new freedom. The prince—the one with authority, with clarity—shoots and kills it. Everything furthers now because the last threat is gone."
  ],
  "trigrams": {
    "lower": "Kǎn (Water), abysmal, dangerous",
    "upper": "Zhèn (Thunder), arousing, moving",
    "description": "Water below, thunder above. Thunder over water—the storm breaks, the tension releases. This is deliverance: the sudden, liberating movement after long obstruction. The water, once blocked, now flows freely. The thunder, once pent up, now rolls across the sky. In deliverance, everything moves again."
  },
  "taoist_reflection": "The Tao Te Ching says: 'When the Tao is present in the universe, the horses haul manure. When the Tao is absent from the universe, warhorses are bred in the borderlands.' Hexagram 40 is the Tao present again, the horses returning to their peaceful work. After obstruction, after conflict, deliverance brings the world back to its natural state. The wise one does not hoard the release; they extend it to all, forgiving, pardoning, letting the thunder wash away not only their own burdens but the burdens of the world."
},
{
  "number": 41,
  "name": "Decrease (損 - Sǔn)",
  "heart": "Lake below mountain. The mountain rests, the lake reflects—but the lake is diminished, its waters drawn off to moisten the mountain. Decrease is not loss; it is redistribution. What is taken from one is given to another, and the whole is served. The noble one accepts decrease not as deprivation but as participation in a larger economy. When you lose something, ask not only what you have lost, but what has been made possible by your loss.",
  "ancient": {
    "chinese": "損。有孚，元吉，无咎，可貞，利有攸往。曷之用？二簋可用享。",
    "rendering": "Decrease. If you are sincere, there is supreme good fortune, no blame, perseverance that furthers. It furthers one to undertake something. How is this used? Two bowls may be used for the offering."
  },
  "judgment": "Decrease, rightly understood, is not a subtraction but a transformation. When you are sincere—when you give without resentment, lose without clinging—supreme good fortune follows. No blame attaches to such decrease because it is not waste; it is offering. Perseverance in this attitude furthers all things. It furthers one to undertake something—even in decrease, action is possible. The offering need not be grand; two simple bowls suffice. The gods care not for quantity but for quality of heart. In decrease, simplify, offer what you have, and trust that the economy of the Tao is just.",
  "image": "Lake below mountain. The noble one curbs anger and restrains desires. Lake below mountain: the lake's waters are drawn up to nourish the mountain. The noble one sees this and learns: curb anger—it depletes you and others without nourishing. Restrain desires—they take without giving back. Decrease is not about losing what you need; it is about releasing what harms. The lake does not miss the water that rises; it becomes part of the mountain's life.",
  "lines": [
    "Going quickly when one's work is done brings no blame. But one must consider how much to decrease. When the task is finished, do not linger. Decrease your attachment to the work, and go. But consider: how much to decrease? Not everything—just enough to stay light.",
    "Perseverance furthers. To undertake something brings misfortune. Without decreasing oneself, one can increase others. In decrease, perseverance in the right attitude furthers. But to undertake something new now—to reach for more—brings misfortune. Instead, without decreasing yourself—without losing your own center—you can increase others. Give from your surplus, not your substance.",
    "When three go together, they decrease one. When one goes alone, he finds a friend. Three together: alliances, factions, the politics of decrease. One may be left out. But when one goes alone, unattached, he finds a true friend—not in numbers, but in depth. In decrease, solitude can be gift.",
    "If you decrease your illness, it furthers to act quickly. Good fortune. No blame. Illness—any affliction—can be decreased if you act at the right time. Quick action, when the cause is clear, brings good fortune. No blame because you are not harming; you are healing.",
    "Someone increases you. Ten pairs of turtles cannot refuse. Supreme good fortune. After decrease, increase comes—not from your effort, but as gift. Ten pairs of turtles—ancient instruments of divination, symbols of certainty—cannot refuse this increase. It is fated, natural. Supreme good fortune follows because you accepted decrease without resentment.",
    "If you increase others, no one opposes you. Perseverance brings good fortune. It furthers to have somewhere to go. You gain helpers without a household. The final stage: you have learned decrease so well that you now increase others. No one opposes such generosity. Perseverance in this brings good fortune. It furthers to have somewhere to go—a purpose, a direction. And you gain helpers, not through seeking, but through being the kind of person who naturally attracts them."
  ],
  "trigrams": {
    "lower": "Duì (Lake), joyful, reflecting",
    "upper": "Gèn (Mountain), stillness, resting",
    "description": "Lake below mountain. The lake's waters rise to nourish the mountain. This is decrease: giving of oneself so that another may flourish. The lake does not begrudge the loss; it becomes part of a larger wholeness."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The sage does not accumulate. The more he helps others, the more he possesses. The more he gives to others, the more he gains.' Hexagram 41 is the art of this sacred accumulation through decrease. When you give, you are not diminished; you are redistributed. The lake becomes the mountain; the mountain becomes the lake. In the economy of the Tao, loss is always gain, and decrease always increase."
},
{
  "number": 42,
  "name": "Increase (益 - Yì)",
  "heart": "Wind over thunder. Thunder stirs below, wind spreads above—movement and influence together, multiplying effect. Increase is not mere addition; it is amplification. What is good grows, what is true spreads. Not through force, but through the natural synergy of aligned forces. In times of increase, the wise one does not hoard; they let the wind carry the thunder's sound so that all may hear.",
  "ancient": {
    "chinese": "益。利有攸往，利涉大川。",
    "rendering": "Increase. It furthers one to undertake something. It furthers one to cross the great water."
  },
  "judgment": "Increase is the season of growth, of amplification, of blessing. It furthers to undertake something—action now bears fruit many times over. It furthers to cross the great water—the greatest challenges can now be met because you are augmented by forces beyond yourself. Not your own power alone, but power multiplied by timing, by alignment, by the synergy of heaven and earth. In increase, do not be prideful; be grateful. The wind that spreads the thunder's sound is not your doing; it is the Tao's gift. Receive it, use it, and pass it on.",
  "image": "Wind over thunder. The noble one sees the good and moves toward it. When he sees a fault, he turns from it. Wind over thunder: the wind carries the thunder's sound everywhere. The noble one learns: see the good and move toward it—let your life be carried by what amplifies virtue. When you see a fault, turn from it—do not let it grow. In increase, you have more power; use it to amplify the good and diminish the harmful.",
  "lines": [
    "It furthers to accomplish great deeds. Supreme good fortune. No blame. At the beginning of increase, great deeds are possible. Supreme good fortune because the timing is right. No blame because you act with the current, not against it.",
    "Someone increases you. Ten pairs of turtles cannot oppose it. Perseverance brings good fortune. The king presents him before God. Good fortune. The gift comes—unasked, undeniable. Even the turtles, the oracles, cannot oppose this increase. Perseverance in receiving brings good fortune. The king presents you before God—you are acknowledged by the highest. Good fortune because you are aligned.",
    "One is increased by unfortunate events. No blame. You are sincere and walk the middle way. You report to the prince. Even increase can come through what seems unfortunate—a loss that opens a door, a failure that teaches. No blame because you remain sincere, walking the middle way. Report to the prince—acknowledge the source of increase, even if it came through pain.",
    "If you walk the middle way and report to the prince, he follows. It furthers to be used in the removal of the capital. Steadiness in the middle way earns trust. The prince follows your advice. Now you may be used for great tasks—the removal of the capital, a transformation of the highest order. Increase has prepared you for this.",
    "If you have a sincere heart, do not ask. Supreme good fortune. Everyone knows your sincerity. When your heart is truly sincere, you do not need to ask; others know. Supreme good fortune because you are trusted without words. Increase has made your sincerity visible.",
    "He increases others without being increased himself. Others attack him. He does not steady his heart. Misfortune. The final warning: if you increase others but do not receive increase yourself—if you give endlessly without replenishment—others may attack you, and you cannot steady your heart. Misfortune follows because you have neglected your own need for increase. Give, but also receive. The Tao flows both ways."
  ],
  "trigrams": {
    "lower": "Zhèn (Thunder), arousing, moving",
    "upper": "Xùn (Wind), gentle, penetrating",
    "description": "Thunder below, wind above. Thunder stirs; wind spreads. Their synergy multiplies effect. This is increase: the amplification of what is, the spreading of what begins. In increase, your smallest action can have vast consequences because the wind carries it."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The Tao gives birth to one, one gives birth to two, two gives birth to three, three gives birth to ten thousand things.' Hexagram 42 is the multiplication of the ten thousand things. Increase is the natural outgrowth of alignment. When you are in the Tao, everything you touch multiplies—not because you are powerful, but because you are in the current. The wind does not create the thunder; it carries it. In increase, be the wind—carry what is good, spread what is true, and let the Tao do the rest."
},
{
  "number": 43,
  "name": "Breakthrough (夬 - Guài)",
  "heart": "Lake over heaven. The lake rises, high above the land, threatening to overflow. Below, the creative power of heaven waits. Breakthrough is the moment of decision, the rupture, the final push through an obstruction that has long resisted. Not gentle, not patient—but necessary. The lake must break its banks; the truth must be spoken; the boil must be lanced. Breakthrough is the energy of resolution, of cutting through what has festered too long.",
  "ancient": {
    "chinese": "夬。揚于王庭，孚號有厲。告自邑，不利即戎。利有攸往。",
    "rendering": "Breakthrough. One must make one's message known in the king's court. It must be announced truthfully. Danger. One must notify one's own city. It does not further to resort to arms. It furthers one to undertake something."
  },
  "judgment": "There comes a time when the hidden must be revealed, the blocked must be opened, the corrupt must be cut away. Breakthrough is that time. Make your message known in the king's court—speak truth to power. Announce it truthfully, even though there is danger. Notify your own city—prepare those close to you. But do not resort to arms; this is not a battle to be won by force, but a truth to be acknowledged by all. It furthers to undertake something—action now is necessary, but it must be action born of clarity, not aggression.",
  "image": "Lake over heaven. The noble one bestows blessings but does not accumulate merit. Lake over heaven: the water is high, about to break through. The noble one learns: bestow blessings—give freely, let the water flow. But do not accumulate merit—do not count your good deeds, do not store up credit. The breakthrough is not about you; it is about clearing the way for all. When the lake breaks, it waters the plain; it does not ask for thanks.",
  "lines": [
    "Mighty in the forward-striding toes. Going forward is not possible. One makes a mistake. The first impulse to break through, but the toes—the smallest part—are mighty, overeager. Going forward now is not possible; it would be a mistake. Wait until the whole body is ready.",
    "A cry of alarm. Weapons at night. Do not worry. The alarm sounds, the danger seems imminent. But do not worry. This is the false alarm, the fear that precedes the real breakthrough. Stay steady.",
    "Mighty in the cheekbones. Misfortune. The noble person is firmly resolved. He walks alone and meets rain. He is blamed. The cheekbones—the face, the identity—are too prominent. This brings misfortune because the breakthrough becomes personal. The noble one, firmly resolved, walks alone—isolated in his certainty. He meets rain—cleansing, but also discomfort. He is blamed by those who do not understand. Yet the line implies that this is the price of true breakthrough.",
    "There is no skin on his thighs. Walking comes hard. If he were led like a sheep, regret would disappear. But if he hears these words, he does not believe. The thighs bear the weight; without skin, without protection, walking is hard. If he could be led—if he could accept guidance—regret would disappear. But he does not believe; he is too caught in his own way. This is the danger of breakthrough: becoming deaf to counsel.",
    "In dealing with weeds, firm resolution is needed. Walking the middle way brings no blame. Weeds are persistent; they require firm action. But walk the middle way—not too much, not too little—and there is no blame. Breakthrough requires both strength and balance.",
    "No cry. In the end, misfortune. The final line: silence when speech is needed. No cry, no announcement, no breakthrough. The lake does not break; it stagnates. In the end, misfortune because the truth was not spoken, the abscess was not lanced, the moment was missed."
  ],
  "trigrams": {
    "lower": "Qián (Heaven), creative, strong",
    "upper": "Duì (Lake), joyful, reflecting",
    "description": "Heaven below, lake above. The lake has risen, poised to overflow. Below, heaven waits, unmoved. Breakthrough is this tension: the water must break; the truth must out. Heaven does not resist; it simply provides the ground."
  },
  "taoist_reflection": "The Tao Te Ching says: 'Those who know do not speak; those who speak do not know.' Hexagram 43 is the exception, the moment when not speaking is no longer possible. The lake that does not break becomes a swamp. The truth that is not spoken becomes a poison. Breakthrough is the speech of those who would rather be silent, the action of those who would rather wait. It is the last resort of the wise, and for that reason, when it comes, it must be true."
},
{
  "number": 44,
  "name": "Coming to Meet (姤 - Gòu)",
  "heart": "Wind under heaven. A stirring, a penetration—the first meeting of what was separate. Coming to Meet is not planned, not arranged; it happens. The wind moves where it will, and heaven receives it. In human life, meetings occur—with people, with ideas, with fate—that change everything. The wise one does not force such meetings; they simply remain open, like heaven receiving the wind, and let what comes, come.",
  "ancient": {
    "chinese": "姤。女壯，勿用取女。",
    "rendering": "Coming to Meet. The maiden is powerful. One should not marry such a maiden."
  },
  "judgment": "The maiden is powerful—the one who comes to meet you is strong, perhaps too strong. To marry her, to bind her to you, would be a mistake. Some meetings are not for union; they are for recognition, for a moment of contact that changes both, but does not hold. In Coming to Meet, do not grasp. Do not try to make the meeting permanent. Let it be what it is—a crossing of paths, a gift of the moment. The wind meets heaven and passes on; heaven does not hold it. So too, meet what comes, and let it go.",
  "image": "Wind under heaven. The noble one imparts his commands and proclaims them to the four quarters. Wind under heaven: the message is carried everywhere. The noble one learns: when you have something to impart, let it be carried by the wind. Proclaim it to the four quarters—not to control, but to offer. Some will receive it, some will not. That is the nature of meeting. The wind does not insist; it simply moves.",
  "lines": [
    "It must be checked with a brake of metal. Perseverance brings good fortune. If you let things take their course, you will experience misfortune. A lean pig will certainly be wild. The first meeting: restrain it, check it with a brake. Not to stop it, but to guide it. Perseverance in this checking brings good fortune. If you let it run wild, misfortune follows. A lean pig—deprived, hungry—is wild. Give it boundaries, and it can be received.",
    "There is a fish in the package. No blame. But it does not further guests. The fish—the meeting, the gift—is there, but wrapped, hidden. No blame—it is yours. But it does not further guests; it is not for sharing. Some meetings are private; honor that.",
    "There is no skin on his thighs. Walking comes hard. Danger. No great blame. As in breakthrough, the unprotected thighs make walking hard. Danger is present, but no great blame because the meeting itself is not harmful, only the condition you bring to it.",
    "No fish in the package. Misfortune. The package is empty; the meeting promised nothing. This brings misfortune because you expected something. The line warns: do not project onto the meeting what is not there. See it as it is, empty or full.",
    "A melon covered with willow branches. Hidden lines. Then it drops down to you from heaven. The melon, ripe and sweet, is hidden—covered with willow branches, not obvious. But if you have the hidden lines—the inner readiness—it drops down to you from heaven. The meeting comes unbidden, a gift.",
    "He comes to meet with his horns. Humiliation. No blame. To meet with horns—aggressively, defensively—brings humiliation. You are not ready to receive. But the line says no blame—perhaps because you acted as you knew, or because the meeting itself, though mishandled, still occurred. Next time, lower the horns."
  ],
  "trigrams": {
    "lower": "Xùn (Wind), gentle, penetrating",
    "upper": "Qián (Heaven), creative, strong",
    "description": "Wind below, heaven above. Wind rises to meet heaven—a stirring, a penetration, a first contact. Coming to Meet is this: the moment when two become aware of each other, when the possibility of relationship dawns. Heaven does not resist the wind; it receives it. Be like heaven: open, spacious, letting what comes come and what goes go."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The great Tao flows everywhere. It can go left or right. All things depend on it for life, and it does not turn away.' Hexagram 44 is the Tao in its aspect of meeting, of flowing toward and away. The wind meets heaven and moves on; heaven meets the wind and lets it go. This is the wisdom of non-clinging. Meet what comes with openness; release it without grasping. In this way, every meeting is a gift, and every parting is a blessing."
},
{
  "number": 45,
  "name": "Gathering Together (萃 - Cuì)",
  "heart": "Lake over earth. The lake gathers water, the earth receives it. Gathering Together is the drawing together of what belongs together—not by force, but by affinity. People gather around a common purpose, a shared vision, a beloved leader. Not because they are commanded, but because they recognize in the gathering a deeper home. The lake does not command the streams; they flow to it because it is low. So too, the wise leader is low, and all things flow to them.",
  "ancient": {
    "chinese": "萃。亨。王假有廟。利見大人，亨，利貞。用大牲吉。利有攸往。",
    "rendering": "Gathering Together. Success. The king approaches his temple. It furthers to see the great person. Success. Perseverance furthers. To offer great sacrifice brings good fortune. It furthers to undertake something."
  },
  "judgment": "When like gathers like, success follows naturally. The king approaches his temple—the place of meeting, of worship, of common purpose. It furthers to see the great person—one who embodies the vision, who can guide the gathering. Perseverance in this seeing furthers all things. To offer great sacrifice—to give generously to the common purpose—brings good fortune because it strengthens the bond. It furthers to undertake something—action now, from the gathered strength, will bear fruit. The gathering is not an end; it is the beginning of what can only be done together.",
  "image": "Lake over earth. The noble one prepares weapons to meet the unforeseen. Lake over earth: water gathers, but what if the banks break? The noble one prepares—not from fear, but from wisdom. Gathering brings strength, but also vulnerability. Prepare weapons—not to attack, but to defend against the unforeseen. The noble one knows that even in harmony, the world can intrude. Be ready, not paranoid; prepared, not preemptively armed.",
  "lines": [
    "If you are sincere but not to the end, there will be confusion. Then you gather them again. One cry, and you laugh. Do not worry. Going forward is without blame. The first attempt at gathering fails—sincere but incomplete, confusion arises. But you can gather again. One cry, and you laugh—the release of tension, the recognition that failure is not final. Do not worry; go forward, and there is no blame.",
    "Letting oneself be drawn brings good fortune. No blame. If you are sincere, it furthers to bring even a small offering. To be drawn to the gathering, to let yourself be pulled by affinity—this brings good fortune. No blame because you are not forcing. Even a small offering, sincerely given, furthers the whole.",
    "Gathering together brings sighs. Nothing that would further. Going forward is without blame. Slight humiliation. Sometimes gathering brings sighs—the recognition of what is lacking, what could be but is not. Nothing furthers in such a gathering; it is not yet time. Going forward is still without blame—you tried—but there is slight humiliation. Learn and wait.",
    "Great good fortune. No blame. Great gathering, great success. The time has come; all elements align. No blame because you did not force it; you simply received what came.",
    "If in gathering together one has position, there is no blame. If there are some who are not yet sincere, be magnanimous and persevere. Then regret disappears. When you have a position in the gathering—when you are the leader, the focal point—there is no blame in that. But some may not yet be sincere. Be magnanimous, persevere in openness, and regret will disappear. True leaders do not demand loyalty; they earn it over time.",
    "Lamenting and sighing, floods of tears. But no blame. At the peak, or perhaps after, there is grief. Lamenting, sighing, tears—because no gathering lasts forever. But no blame. The tears are the price of having loved the gathering. They do not diminish it; they honor it."
  ],
  "trigrams": {
    "lower": "Kūn (Earth), receptive, yielding",
    "upper": "Duì (Lake), joyful, reflecting",
    "description": "Earth below, lake above. The lake gathers water; the earth receives it. Gathering Together is this: the joyful drawing together of what is meant to be together, the earth providing the ground, the lake providing the form. The earth does not command the water; it simply is low, and the water flows to it."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The highest good is like water. Water benefits all things and does not contend. It stays in lowly places that others despise. Thus it is near the Tao.' Hexagram 45 is water gathering in the low places—the people gathering around the leader who is humble, the streams flowing to the lake that is low. The wise leader does not seek followers; they become a valley, and the followers come of themselves. In this gathering, there is no force, only affinity. And in this affinity, there is the Tao."
},
{
  "number": 46,
  "name": "Pushing Upward (升 - Shēng)",
  "heart": "Wind rising over earth. Gentle, persistent, unstoppable—the wind does not fight the earth; it simply rises. Pushing Upward is not aggressive striving; it is the natural ascent of what is light, what is true, what is aligned. The seedling pushes through soil not by force but by growth. The wise one rises not by ambition but by virtue. When your inner being is light, you rise as naturally as wind.",
  "ancient": {
    "chinese": "升。元亨。用見大人，勿恤。南征吉。",
    "rendering": "Pushing Upward. Supreme success. One may see the great person. Do not grieve. To march south brings good fortune."
  },
  "judgment": "Supreme success attends those who rise naturally, without forcing. It is given to you to see the great person—one who embodies the height you seek. Do not grieve if the ascent seems slow; it is steady. To march south—toward the light, toward warmth—brings good fortune. South is the direction of advance, of increase, of clarity. Push upward, not by straining, but by becoming light. Shed what is heavy—resentment, attachment, fear—and you will rise as surely as wind.",
  "image": "Wind rising over earth. The noble one accumulates small things to achieve the high and great. Wind rising over earth: it begins as a breeze, barely felt; it ends as a gale, sweeping all before it. The noble one learns: accumulate small things. Not grand gestures, but daily virtues; not dramatic sacrifices, but small kindnesses. These accumulate, and in time, they lift you to the high and great. Pushing Upward is not a leap; it is the result of countless small ascents.",
  "lines": [
    "Pushing upward that meets confidence brings great good fortune. At the first step, confidence—from yourself, from others—greets your ascent. This is great good fortune because it affirms that you are on the right path. Trust this confidence, and continue.",
    "If you are sincere, it furthers to bring even a small offering. No blame. Sincerity is the fuel of ascent. Even a small offering, given truly, furthers your rise. No blame because you give what you have, not what you lack.",
    "Pushing upward into an empty city. The city is empty—no opposition, no support, just space. This can be disorienting. But the line does not judge; it simply observes. Pushing upward into emptiness requires its own kind of faith.",
    "The king offers him Mount Qi. Good fortune. No blame. Mount Qi is the sacred mountain, the place of ancestral blessing. The king—the highest authority—offers this to you. Good fortune because you are honored. No blame because you did not seek it; it came as recognition of your true ascent.",
    "Perseverance brings good fortune. Pushing upward by steps. The ascent is gradual, step by step. Perseverance in this steady climbing brings good fortune. Not a leap, but a stair; each step solid, each rise earned.",
    "Pushing upward in darkness. It furthers to be unremittingly persevering. The final ascent may be in darkness—unseen, unrecognized, unsupported. But it furthers to be unremittingly persevering. The darkness is not a sign of wrong path; it is simply the condition of this stage. Push upward anyway. The light will come."
  ],
  "trigrams": {
    "lower": "Xùn (Wind), gentle, penetrating",
    "upper": "Kūn (Earth), receptive, yielding",
    "description": "Wind below, earth above. Wind rises through earth, gently, persistently. This is Pushing Upward: the natural ascent of what is light, what is true. The earth does not block the wind; it yields to it. So too, the world yields to those who rise through virtue, not force."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The journey of a thousand miles begins under your feet.' Hexagram 46 is the journey of ascent, step by step, inch by inch. Not the thousand miles of horizontal travel, but the vertical climb toward the light. The wind does not rush; it rises. The seedling does not strain; it grows. In pushing upward, the wise one learns that the only way to rise is to become light, and the only way to become light is to let go of what is heavy. Shed, and ascend."
},
{
  "number": 47,
  "name": "Oppression (困 - Kùn)",
  "heart": "Lake over water. The lake is empty, the water below is trapped—no outlet, no replenishment. Oppression is this: exhaustion, constraint, the sense of being trapped with no way out. Not by your fault, not by anyone's fault—simply the condition of the moment. The sage in oppression does not rage; they accept, they wait, they trust. The water is still there, though hidden. The lake will be filled again.",
  "ancient": {
    "chinese": "困。亨，貞，大人吉，无咎。有言不信。",
    "rendering": "Oppression. Success. Perseverance. The great person brings good fortune. No blame. But words are not believed."
  },
  "judgment": "Oppression seems the opposite of success, yet the hexagram says: Oppression has success. How? Through perseverance, through inner alignment. The great person—the one who has cultivated virtue—brings good fortune even in oppression, not by changing circumstances, but by changing themselves. No blame attaches because they did not cause their plight. But words are not believed; in oppression, explanations fail, pleas go unheard. The only path is silent endurance, inner work, and trust that the water will eventually rise again.",
  "image": "Lake over water. The noble one stakes his life on following his purpose. Lake over water: the lake is empty, the water trapped. The noble one learns: in oppression, the only thing left is purpose. Stake your life on it—not recklessly, but with the deep commitment that says: even if I lose everything, I will not lose this. Purpose becomes the ground when all other ground is gone.",
  "lines": [
    "He sits oppressed under a bare tree. He wanders into a dark valley. For three years he sees nothing. The depth of oppression: sitting under a bare tree—no shade, no shelter. Wandering in a dark valley—no light, no direction. For three years, a full cycle, nothing changes. This is not punishment; it is simply the condition. The line does not offer hope; it witnesses.",
    "He is oppressed while at meat and drink. The man with the scarlet knee bands is just coming. It furthers to offer sacrifice. To set forth brings misfortune. No blame. Even in basic needs—meat and drink—oppression presses. But the man with the scarlet knee bands—the official, the helper—is coming. Offer sacrifice—stay connected to what is holy. To set forth now, to act, brings misfortune. Wait. No blame.",
    "He is oppressed by stone. He leans on thorns. He enters his house and does not see his wife. Misfortune. Stone—unyielding, impassable. Thorns—prickly, painful. His own house, his refuge, empty of the one he loves. Misfortune piled on misfortune. The line is stark, without comfort. Some oppression is total.",
    "He comes slowly, oppressed in a golden carriage. Humiliation, but the end is reached. The golden carriage—luxury, status—yet oppression still. Humiliation because wealth did not protect. But the end is reached; the oppression passes. Even in humiliation, the end comes.",
    "His nose and feet are cut off. Oppression at the hands of the man with the scarlet knee bands. Joy comes slowly. It furthers to offer sacrifice and libation. Mutilation—loss of parts, loss of function. Oppression at the hands of those who should help. Yet joy comes slowly—not suddenly, but gradually, like dawn. Offer sacrifice and libation—stay connected to the source. Joy will come.",
    "He is oppressed by creeping vines. He moves uncertainly. Regret. If he thinks of his mistakes, he has no regret. To move now brings good fortune. The final line: vines entangle, movement is uncertain. Regret for the entanglement. But if he thinks of his mistakes—if he learns what the oppression taught—then no regret. To move now brings good fortune because the lesson is learned. Oppression has served its purpose."
  ],
  "trigrams": {
    "lower": "Kǎn (Water), abysmal, dangerous",
    "upper": "Duì (Lake), joyful, reflecting",
    "description": "Water below, lake above. The lake is empty; the water is trapped below. This is oppression: the resources are present but inaccessible. The water is there, but it cannot rise to fill the lake. In oppression, what you need is near but unreachable. Wait; the blockage will not last forever."
  },
  "taoist_reflection": "The Tao Te Ching says: 'To know the masculine and keep to the feminine is to be the valley of the world.' Hexagram 47 is the valley when it is dry, the feminine when it is empty. Oppression is the condition of being a valley with no water, a well with no source. Yet the valley remains valley; its nature does not change. In oppression, keep to your nature. Be the valley, even dry. The water will return."
},
{
  "number": 48,
  "name": "The Well (井 - Jǐng)",
  "heart": "Water over wood. Wood descends into water, drawing it up. The well is ancient, unchanging, always available. It does not run dry; it does not overflow. It simply waits, offering its water to any who come. The well is the image of character: deep, still, reliable. It does not seek; it does not refuse. It is there, and its presence is gift. In a world of change, the well abides.",
  "ancient": {
    "chinese": "井。改邑不改井，无喪无得，往來井井。汔至，亦未繘井，羸其瓶，凶。",
    "rendering": "The Well. The town may change, but the well does not. It neither loses nor gains. They come and go, drawing from the well. If the rope does not reach, or if the jug breaks, misfortune."
  },
  "judgment": "The well is the constant in the midst of change. Towns rise and fall; the well remains. It neither loses nor gains by those who draw from it. Its water is always there, always the same. In human life, the well is your deepest character, your essential virtue. It does not change with circumstance; it does not increase with praise or decrease with blame. They come and go, drawing from you—some take, some leave, some break the jug. If the rope does not reach—if you cannot access your own depth—or if the jug breaks—if your vessel is flawed—then misfortune follows. But the well itself is not harmed. It waits, patient, full.",
  "image": "Water over wood. The noble one urges the people to work and encourages them in their mutual tasks. Water over wood: wood lowers the bucket, water rises. The noble one learns: urge the people to work—not by commanding, but by providing the means. Encourage them in mutual tasks—the drawing of water is communal; the well serves all. The well does not work; it simply is. The people work, using its gift. The noble one, like the well, provides the resource and encourages the community to use it well.",
  "lines": [
    "The well is muddy. No one drinks. An old well, no birds. Neglect. The well has not been tended; it is muddy, foul. No one drinks; even birds avoid it. This is the condition of a character untended, a virtue uncleaned. The line does not despair; it simply notes the state. It can be cleaned.",
    "The well leaks down to the fish. The jug is broken and leaks. The well is not the problem; the vessel is. The water is there, but the means of drawing it are flawed. In human terms, you have the virtue, but your expression of it is broken. Fix the vessel; the water is still good.",
    "The well is cleaned but no one drinks. This is my heart's sorrow. For the water could be drawn. If the king were clear-minded, good fortune would descend. The well is clean, ready—but no one comes. This is the sorrow of unused potential. The water could be drawn, could bless, but the people do not come. If the king—the leader, the one with vision—were clear-minded, he would see the well and draw from it, and good fortune would descend on all. The line mourns the missed opportunity.",
    "The well is being lined. No blame. Lining the well—repairing, reinforcing—is work that prepares for future use. No blame because it is not yet drawing, but it is becoming ready. In times of preparation, do not expect to give; tend to the structure.",
    "The well is clear, cold spring water. Drink. The well at its best: clear, cold, pure. The water is ready; now drink. Not just for yourself, but for all who come. The spring does not hoard; it flows. So too, when your character is clear, let others drink.",
    "The well is drawn from without obstruction. It is dependable. Supreme good fortune. The final line: the well functions perfectly. The rope reaches, the jug holds, the water rises. No obstruction, complete dependability. Supreme good fortune because the well fulfills its nature. You have become a source from which all can draw, and you are never depleted."
  ],
  "trigrams": {
    "lower": "Xùn (Wind), gentle, penetrating",
    "upper": "Kǎn (Water), abysmal, dangerous",
    "description": "Wind below, water above. Wood (wind) descends into water, drawing it up. This is the well: the means of accessing depth. The wind is the bucket, the rope; the water is the source. Together, they make life possible. The well is the meeting of effort and gift, of human reaching and divine providing."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The supreme good is like water. It benefits all things and does not contend. It stays in lowly places that others despise. Thus it is near the Tao.' Hexagram 48 is water in the well—still, deep, available. The well does not contend; it simply offers. It does not seek; it waits. This is the nature of true virtue: to be so completely what you are that others can draw from you without diminishing you. The well is never emptied because it is connected to the source. So too, the sage, rooted in the Tao, gives endlessly and is never less."
},
{
  "number": 49,
  "name": "Revolution (革 - Gé)",
  "heart": "Fire over lake. Fire below, water above—they fight, each trying to overcome the other. Revolution is this conflict, this overturning of the established order. Not gradual change, but radical transformation. The old must give way to the new, and the transition is never smooth. Fire evaporates water; water quenches fire. Something ends, something begins. In human affairs, revolution is the casting off of what no longer serves, the birth of what must be.",
  "ancient": {
    "chinese": "革。己日乃孚。元亨利貞，悔亡。",
    "rendering": "Revolution. On your own day, you are believed. Supreme success, perseverance furthers. Regret disappears."
  },
  "judgment": "Revolution is not for every day; it is for the appointed time. On your own day—when the moment is right, when the old has clearly failed—you are believed. People recognize that change is necessary. Supreme success comes to those who lead revolution with clarity and purpose. Perseverance in the right direction furthers. Regret disappears because you acted when action was needed, not before, not after. Revolution, rightly timed, is not destruction; it is the clearing of ground for new growth.",
  "image": "Fire over lake. The noble one regulates the calendar and makes the seasons clear. Fire over lake: the elements conflict, but from their conflict comes transformation. The noble one learns: regulate the calendar—make the timing clear. Revolution is not chaos; it is change according to law. When the seasons change, all know what to expect. In revolution, be like the seasons: clear, expected, rightful. Make the time known, and the change will be accepted.",
  "lines": [
    "Wrapped in the hide of a yellow cow. The first hint of revolution, but wrapped, hidden, not yet expressed. The yellow cow—earth, center, patience. Wrap your intention in patience; do not act yet. The time is not ripe.",
    "When your own day comes, you may create revolution. Setting forth brings good fortune. No blame. The day arrives—your day, the right time. Now you may act. Setting forth brings good fortune because the timing is right. No blame because you waited.",
    "Setting forth brings misfortune. Perseverance brings danger. When talk of revolution has gone round three times, you may attach yourself to them. The third line warns: if you set forth too soon, misfortune. If you persevere in the old ways, danger. But when the talk has gone round three times—when the desire for change is widespread, mature—then you may attach yourself to the movement. Timing is everything.",
    "Regret disappears. You are believed. Change the form of government. Good fortune. Regret dissolves because you are now trusted. Change the form of government—the deep structures—and good fortune follows. The revolution has succeeded, and its success is legitimized by the trust you have earned.",
    "The great person changes like a tiger. Even before the oracle, they are believed. The tiger's change is unmistakable, visible, powerful. The great person, when they change, does so with such clarity that all see and believe—even before consulting the oracle. Their authority is self-evident.",
    "The noble person changes like a panther. The common people change countenance. Perseverance brings misfortune. Good fortune to abide in perseverance. The panther's change is subtler than the tiger's, but still visible. The common people, influenced, change their expressions, their attitudes. But if you persevere in revolution beyond its time, misfortune comes. Good fortune to abide in perseverance—not in revolution, but in the new order. Know when the change is complete, and then abide."
  ],
  "trigrams": {
    "lower": "Lí (Fire), clinging, bright",
    "upper": "Duì (Lake), joyful, reflecting",
    "description": "Fire below, lake above. Fire and water in conflict—each trying to overcome the other. This is revolution: the overturning of the old order, the clash of elements that produces transformation. From their conflict, something new emerges. The fire evaporates water; the water quenches fire. Neither wins; both are changed."
  },
  "taoist_reflection": "The Tao Te Ching says: 'If you want to shrink something, you must first expand it. If you want to weaken something, you must first strengthen it.' Hexagram 49 is the moment of shrinking after expansion, weakening after strengthening. Revolution is the necessary correction when things have gone too far. The sage does not fear revolution; they read its signs and act when the time is right. The tiger does not hesitate; it changes. The noble one does not cling to the old; they welcome the new when the old has failed. In this, they follow the Tao, which itself is the great revolution that turns all things."
},
{
  "number": 50,
  "name": "The Cauldron (鼎 - Dǐng)",
  "heart": "Fire over wood. The flame licks the cauldron, heating what is within. The cauldron is the vessel of transformation—raw becomes cooked, separate becomes one, nourishing. It is not the food itself, but the means by which food becomes gift. In human life, the cauldron is culture, tradition, the vessel that transforms raw experience into wisdom, crude energy into refined virtue. It holds, it cooks, it offers.",
  "ancient": {
    "chinese": "鼎。元吉，亨。",
    "rendering": "The Cauldron. Supreme good fortune. Success."
  },
  "judgment": "The cauldron is the sacred vessel, the means by which raw material becomes nourishment. Supreme good fortune attends those who tend it rightly. Success comes not from the ingredients alone, but from the vessel that holds them and the fire that transforms them. In your life, what is the cauldron? It may be your practice, your community, your tradition—whatever holds you and transforms you. Tend it well. Keep it clean. Feed the fire, but do not let it burn too hot. The cauldron is patient; it waits for the right cooking. So too, you must wait for the transformation to complete before offering what is within.",
  "image": "Fire over wood. The noble one consolidates their destiny by making their position correct. Fire over wood: the wood feeds the fire; the fire transforms the wood. The noble one learns: consolidate your destiny—not by grasping, but by making your position correct. Be in the right place, doing the right thing, with the right attitude. Then destiny flows to you as naturally as fire rises from wood. The position correct, the vessel stable, the transformation proceeds.",
  "lines": [
    "The cauldron is overturned, its feet up. It furthers to remove what is stale. Taking a concubine for the sake of her son brings no blame. Sometimes the cauldron must be overturned to clean it. The stale, the old, must be removed. Taking a concubine—an unconventional means—for the sake of a son, for the future, is not blameworthy. The overturning is not destruction; it is preparation.",
    "The cauldron has food. My comrades are envious. But they cannot harm me. Good fortune. The cauldron is full, but envy arises. Those who see your nourishment may wish they had it. But they cannot harm you because your fullness is not at their expense. Good fortune because you are secure in your abundance.",
    "The cauldron's ears are worn out. The way is blocked. The fat of the pheasant is not eaten. Only when rain falls will regret disappear. Good fortune in the end. The ears—the means of lifting the cauldron—are worn; the way is blocked. The nourishment cannot be accessed. Only when rain falls—when heaven's blessing comes—will regret disappear. But in the end, good fortune. The blockage is temporary.",
    "The cauldron's feet are broken. The prince's meal is spilled. The servant is drenched. Misfortune. Catastrophe: the vessel breaks, the food is lost, the servant is soiled. Misfortune because the transformation was interrupted, the gift wasted. But the line does not end in despair; it simply records. From such failure, one learns to tend the vessel better.",
    "The cauldron has yellow ears and golden rings. Perseverance brings good fortune. Yellow—center, earth. Golden—value, stability. The vessel is well made, well tended. Perseverance in this care brings good fortune. The cauldron is ready for any offering.",
    "The cauldron has rings of jade. Great good fortune. Nothing that does not further. Jade—the most precious, the most sacred. The cauldron adorned with jade is the vessel at its highest. Great good fortune because it is honored and capable. Nothing that does not further—every use of this vessel brings blessing. The transformation it enables is complete, holy, and eternal."
  ],
  "trigrams": {
    "lower": "Xùn (Wind), gentle, penetrating",
    "upper": "Lí (Fire), clinging, bright",
    "description": "Wind below, fire above. Wood feeds fire; fire transforms wood. This is the cauldron: the vessel that holds and transforms. The wind is the wood, the fuel; the fire is the heat, the agent of change. Together, they cook what is raw into what nourishes. The cauldron is the sacred space where transformation happens."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The Tao is like an empty vessel that is yet inexhaustible. It is bottomless, perhaps the ancestor of all things.' Hexagram 50 is that vessel made visible. The cauldron is empty, yet it holds all that can be cooked. It is passive, yet it enables the most active transformation. In your life, be the cauldron: empty enough to receive, stable enough to hold, patient enough to let the fire do its work. Then what you offer will nourish all who come."
},
{
  "number": 51,
  "name": "The Arousing (震 - Zhèn)",
  "heart": "Thunder rolling, rolling—shock after shock. It terrifies, then it passes. The Arousing is the moment of crisis, the sudden event that shatters complacency. The wise one does not run from the shock; they meet it with inner stillness. The thunder comes, the thunder goes, and they remain.",
  "ancient": {
    "chinese": "震。亨。震來虩虩，笑言啞啞。震驚百里，不喪匕鬯。",
    "rendering": "The Arousing brings success. Shock comes, oh, oh! Then laughter, ha, ha! The terror terrifies a hundred miles, yet he does not let fall the ladle and the sacred wine."
  },
  "judgment": "Success comes through shock. When the thunder rolls, the unprepared are scattered, but the prepared hold steady. The ladle of sacred wine does not spill; the offering continues. In crisis, your practice is tested. If you have cultivated stillness, you will not be shaken. The laughter after the shock is not mockery; it is the relief of one who remained centered. Let the thunder come. You will still be holding what is sacred.",
  "image": "Thunder repeated. The noble one fears and examines himself. Thunder after thunder—shock upon shock. The noble one learns: fear, but not panic. Examine yourself. In the moment of crisis, look inward. What is still unsteady in you? What might the thunder reveal? Use the shock as a mirror, and you will emerge stronger.",
  "lines": [
    "Shock comes, oh, oh! Then laughter, ha, ha! Good fortune. The first shock terrifies, then passes. Laughter follows—not because the danger was trivial, but because you survived it. Good fortune because you are still here.",
    "Shock comes, bringing danger. A hundred thousand times you lose your treasures. Climb the nine hills. Do not pursue. The shock brings loss—treasures scattered. Do not chase them. Climb to high ground, gain perspective. What is truly yours will return, or you will see it was never yours.",
    "Shock comes and leaves you dazed. If the shock activates you, you remain free of misfortune. Dazed, disoriented—but if the shock also activates you, moves you, you will be free of misfortune. Let the shock wake you, not just stun you.",
    "Shock bogs down. The shock is mired, stuck—not fully expressed. This is its own kind of danger. The energy cannot move; it festers. If you find yourself in this bogged state, wait. The shock will either release or dissolve. Do not force it.",
    "Shock comes, going and coming. Danger. Nonetheless, you lose nothing. But there are things to do. The shock oscillates, comes and goes. Danger remains. Yet you lose nothing essential. There are things to do—attend to them. The shock is now background, not foreground.",
    "Shock brings ruin and terrified gazing. Setting forth brings misfortune. If the shock has not reached you but your neighbor, there is no blame. Your companions have something to talk about. The worst shock: ruin, paralysis. To set forth now brings misfortune. But if the shock spares you and strikes your neighbor, there is no blame. Grieve with them, help them, but do not take their shock as your own."
  ],
  "trigrams": {
    "lower": {
      "name": "Zhèn (Thunder)",
      "nature": "Arousing, shocking, moving"
    },
    "upper": {
      "name": "Zhèn (Thunder)",
      "nature": "Arousing, shocking, moving"
    },
    "description": "Thunder over thunder. Shock upon shock. This is the moment of crisis multiplied, the event that shakes the world twice. The wise one does not deny the shock; they meet it with presence, knowing that thunder passes and stillness remains."
  },
  "taoist_reflection": "The Tao Te Ching says: 'If you realize that all things change, there is nothing you will try to hold on to.' Hexagram 51 is the teaching of impermanence made violent. Thunder comes, thunder goes. The sacred wine does not spill—not because the hand is rigid, but because it is so present that even shock cannot disrupt it. The sage, like the hand that holds the ladle, is not shaken because they are not attached. Let the thunder roll. You are already home."
},
{
  "number": 52,
  "name": "Keeping Still (艮 - Gèn)",
  "heart": "Mountain over mountain. Stillness upon stillness. The mountain does not move; it simply rests. Keeping Still is the art of stopping—not as avoidance, but as completion. When the spine is still, the body rests. When the mind is still, the world settles. The sage knows when to stop: at the right moment, in the right place, with no regret.",
  "ancient": {
    "chinese": "艮其背，不獲其身，行其庭，不見其人。无咎。",
    "rendering": "Keeping Still. Keeping his back still, he is no longer aware of his body. Walking in his courtyard, he does not see his neighbors. No blame."
  },
  "judgment": "To keep the back still is to let the world go. When the spine is still, the body is forgotten. When the self is forgotten, others are not objects of grasping. Walking in the courtyard, you do not see your neighbors—not because you reject them, but because you are not seeking. No blame attends this stillness. It is the ground of all right action. From stillness, when you do move, you move truly.",
  "image": "Mountains standing together. The noble one does not let his thoughts go beyond his situation. Mountains together: they rest, they endure. The noble one learns: do not let thoughts go beyond your situation. Be fully here, in this moment, with what is. Thoughts that wander are like streams that leave the mountain; they do not return. Keep your mind on what is present, and you will not be scattered.",
  "lines": [
    "Keeping his toes still. No blame. Perseverance furthers. The toes—the beginning of movement. To still them before they move is wise. No blame because you have not yet taken a wrong step. Persevere in this early stillness, and it will further all that follows.",
    "Keeping his calves still. He cannot rescue him whom he follows. His heart is not glad. The calves move with the legs; they are not independent. If you still them after movement has begun, you cannot rescue the one you follow—your own impulse. The heart is not glad because the timing is off. Better to still earlier, or not at all.",
    "Keeping his hips still. Makes his ribs rigid. Danger. The heart suffocates. To still the hips—the center of movement—after you are already in motion makes the whole body rigid. The ribs lock; the heart cannot breathe. Danger because you are fighting yourself. If you must still, still at the source, not in mid-motion.",
    "Keeping his trunk still. No blame. The trunk—the core, the center. To still the center is to find balance. No blame because you are not preventing movement; you are grounding it. From this still center, all movement can arise cleanly.",
    "Keeping his jaws still. Words have order. Regret disappears. The jaws—speech. To still them is to speak only when words are true and ordered. Regret disappears because you do not speak in haste. The stillness of the jaws is not silence; it is the pause before right speech.",
    "Keeping his back still. Good fortune. The culmination: the back, the spine, the deepest support. To keep the back still is to be so grounded that the body is forgotten. Good fortune because you are no longer reacting to the world; you are simply present, and from that presence, all action is true."
  ],
  "trigrams": {
    "lower": {
      "name": "Gèn (Mountain)",
      "nature": "Stillness, resting, completing"
    },
    "upper": {
      "name": "Gèn (Mountain)",
      "nature": "Stillness, resting, completing"
    },
    "description": "Mountain over mountain. Stillness upon stillness. This is the meditation of form: each mountain rests, each moment completes. The wise one learns that true stillness is not a void; it is the full presence of what is, unmoving and complete."
  },
  "taoist_reflection": "The Tao Te Ching says: 'Do you have the patience to wait till your mud settles and the water is clear? Can you remain unmoving till the right action arises by itself?' Hexagram 52 is the answer: yes. Keeping still is not passivity; it is the deepest activity. The mountain does not move, yet all things grow around it. The sage does not strive, yet all things are accomplished. In stillness, the mud settles, the water clears, and right action arises of itself."
},
{
  "number": 53,
  "name": "Development (漸 - Jiàn)",
  "heart": "Wind over mountain. The wind moves slowly, shaping the mountain over eons. Development is gradual progress—not a leap, but a steady ascent. The wild goose flies step by step, from shore to shore, never rushing, never stopping. In human life, true growth is like this: patient, persistent, inevitable. Do not force; just continue.",
  "ancient": {
    "chinese": "漸。女歸吉，利貞。",
    "rendering": "Development. The maiden is given in marriage. Good fortune. Perseverance furthers."
  },
  "judgment": "The wild goose flies from shore to shore, each step measured, each resting place earned. Development is not a leap but a pilgrimage. The maiden goes to her new home not in haste but in trust, knowing that what is built slowly endures. Perseverance in this gradual approach brings good fortune because you are not skipping the steps that make the destination meaningful. Do not despise the slow days; they are the ones that carry you farthest.",  
  "image": "Wind over mountain. The noble one abides in clarity and moves with patience. Wind over mountain: it shapes the stone not by force but by persistence. The noble one learns: abide in clarity—know where you are going. Move with patience—accept that the journey takes time. The mountain does not resent the wind's slow work; it becomes a masterpiece of erosion. Your character, too, is being shaped by forces you cannot see. Trust the process.",
  "lines": [
    "The wild goose gradually draws near the shore. The young son is in danger. There is talk. No blame. First step: approach the shore. There is danger—the son is young, inexperienced. There is talk—gossip, concern. But no blame because the movement is natural. Continue.",
    "The wild goose gradually draws near the cliff. Eating and drinking in peace and concord. Good fortune. Second step: the cliff, a resting place. Eating and drinking in peace—replenishment. Good fortune because you take time to gather strength. Do not rush past the resting places.",
    "The wild goose gradually draws near the plateau. The husband goes forth and does not return. The wife is pregnant but does not give birth. Misfortune. You might take robbers for a good cause. Third step: the plateau, exposed. The husband leaves and does not return—separation. The wife is pregnant but does not give birth—potential unfulfilled. Misfortune because the timing is off. You may mistake robbers for good people—trust the wrong thing. Pause and reassess.",
    "The wild goose gradually draws near the tree. It may light on a branch. No blame. Fourth step: the tree, a higher perch. It may light on a branch—not the top, not the bottom, just a place to rest. No blame because it is enough for now. Development does not demand the peak at every stage.",
    "The wild goose gradually draws near the summit. For three years the wife has no child. In the end nothing can oppose her. Good fortune. Fifth step: near the summit. For three years, no child—long patience, no visible result. But in the end, nothing can oppose her. Good fortune because perseverance has built a momentum that cannot be stopped.",
    "The wild goose gradually draws near the cloud heights. Its feathers can be used for the sacred dance. Good fortune. Final step: the cloud heights, the highest stage. The feathers—what was once just for flight—are now sacred, used in the dance. Good fortune because development has transformed the ordinary into the holy. The journey itself becomes the offering."
  ],
  "trigrams": {
    "lower": {
      "name": "Gèn (Mountain)",
      "nature": "Stillness, resting"
    },
    "upper": {
      "name": "Xùn (Wind)",
      "nature": "Gentle, penetrating"
    },
    "description": "Wind over mountain. The wind shapes the mountain slowly, grain by grain. Development is this patient transformation: not a flood, but a steady breeze. The mountain does not resist; it yields over time. The wise one learns that true change is gradual, and that which endures is built slowly."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The journey of a thousand miles begins under your feet.' Hexagram 53 is the journey itself, step by step, day by day. The wild goose does not leap to the clouds; it flies from shore to shore, resting when needed, pressing on when ready. The sage does not seek enlightenment in a flash; they cultivate it slowly, patiently, with the certainty of water wearing down stone. In the end, the feathers become sacred—not because they were special, but because they were faithful."
},
{
  "number": 54,
  "name": "The Marrying Maiden (歸妹 - Guī Mèi)",
  "heart": "Thunder over lake. Thunder stirs, the lake responds—but the union is not equal. The marrying maiden is a secondary wife, entering a household not as the principal but as a supplement. Her position is precarious; her influence, limited. This hexagram speaks of relationships entered without full commitment, of unions that serve a purpose but lack depth. The wise one in such a situation does not demand what cannot be given; they accept the limits and make the best of what is.",
  "ancient": {
    "chinese": "歸妹。征凶，无攸利。",
    "rendering": "The Marrying Maiden. To undertake something brings misfortune. Nothing that would further."
  },
  "judgment": "This is not a time for great undertakings. The position is secondary, the power limited. To push for more, to demand equality where it is not offered, brings misfortune. Nothing furthers because the foundation is not solid. Yet the maiden can still find her way: by accepting her place with grace, by fulfilling her role with sincerity, she may earn a deeper regard. But do not mistake this hexagram for a call to action. It is a call to patience, to clarity about what is possible, and to dignity within constraint.",
  "lines": [
    "The marrying maiden as a concubine. A lame man can still tread. Setting forth brings good fortune. The lowest position, the least status. Yet like a lame man who can still walk, she can still move, still act. Setting forth—within her limits—brings good fortune. Do what you can with what you have.",
    "A one-eyed man can still see. The perseverance of a solitary man furthers. Limited vision, but not blindness. The solitary man—one without allies—can still persevere. In a secondary position, you may see less, have less support, but you can still see truly. Persevere in that seeing.",
    "The marrying maiden waits. She returns as a concubine. The waiting is not passive; it is preparation. She returns—not to the same place, but to a similar role. The line does not judge; it describes. Some returns are necessary; some waiting is wise.",
    "The marrying maiden draws out the time. She may be late in marrying. There is a time for delay. To draw out the time is not to waste it; it is to wait for the right moment. Late, but not too late.",
    "The sovereign I gave his daughter in marriage. The embroidered garments of the princess were not as fine as those of the concubine. The moon is nearly full. Good fortune. The princess—the primary wife—is outshone by the concubine's virtue. The moon is nearly full; her influence grows. Good fortune because quality, not status, determines worth. The secondary position does not diminish true excellence.",
    "The woman holds the basket, but there are no fruits in it. The man stabs the sheep, but no blood flows. Nothing that furthers. Empty rituals, forms without substance. The basket is held, but empty; the sheep is stabbed, but no blood flows. The union produces nothing because the heart is not in it. This is the danger of the secondary position: becoming mere form, losing substance. Do not let this happen. Even in constraint, be real."
  ],
  "trigrams": {
    "lower": {
      "name": "Duì (Lake)",
      "nature": "Joyful, reflecting"
    },
    "upper": {
      "name": "Zhèn (Thunder)",
      "nature": "Arousing, moving"
    },
    "description": "Lake below, thunder above. Thunder stirs the lake, but the lake does not rise to meet it. This is the marrying maiden: a union that is not fully reciprocal, a relationship of unequal power. The lake receives the thunder's energy but cannot return it. In such a situation, the wise one accepts the gift without demanding more, and uses what is given to grow in stillness."
  },
  "taoist_reflection": "The Tao Te Ching says: 'To know the masculine and keep to the feminine is to be the valley of the world.' Hexagram 54 is the feminine kept, the valley that receives without demanding. The marrying maiden, in her secondary position, can still be a valley—deep, receptive, nourishing. The thunder comes and goes; the lake remains. In the end, the valley outlasts the mountain. The one who accepts her place with grace may find that the place itself transforms."
},
{
  "number": 55,
  "name": "Abundance (豐 - Fēng)",
  "heart": "Fire over thunder. Lightning flashes, thunder rolls—the height of power, the peak of influence. Abundance is fullness, prosperity, the moment when everything is present. But the hexagram warns: abundance does not last. The sun must set, the moon must wane. In times of abundance, the wise one does not grasp; they give. They do not cling; they share. For fullness, rightly used, becomes blessing. Hoarded, it becomes poison.",
  "ancient": {
    "chinese": "豐。亨。王假之，勿憂，宜日中。",
    "rendering": "Abundance has success. The king attains abundance. Do not grieve. Be like the sun at midday."
  },
  "judgment": "Success comes with abundance, but it is not for you alone. The king attains it, but he must use it for all. Do not grieve that abundance cannot last; that is its nature. Be like the sun at midday—at its peak, it gives most light. It does not hoard its rays. In your abundance, give. In your fullness, share. The sun does not grieve that it must set; it shines fully while it can. So too, you.",
  "image": "Fire over thunder. The noble one decides lawsuits and carries out punishments. Fire over thunder: the flash reveals, the shock enforces. The noble one learns: in times of abundance, clarity and justice are possible. Decide lawsuits—bring resolution. Carry out punishments—maintain order. Abundance is not just for enjoyment; it is for right action. Use your fullness to set things right.",
  "lines": [
    "When you meet your match, you are alike. Even if you are of no account, there is no blame. Going forward brings honor. In abundance, you meet your match—one who shares your quality. Even if you are humble, this meeting is without blame. Go forward; honor awaits.",
    "The screen is so full of light that you see a speck. Going forward brings doubt. With goodwill and sacrifice, good fortune. So much light that it obscures; you see a speck, a flaw. Doubt arises. But with goodwill and sacrifice—with sincere offering—good fortune follows. Do not let the flaw blind you to the whole.",
    "The underbrush is so thick that you see a small speck. Not seeing the big person. In abundance, obscurity can come from excess—too much, and you miss the essential. Not seeing the big person because the small fills your vision. The line warns: clear the underbrush.",
    "The screen is so full of light that you see a speck. You meet the big person. Good fortune. Again the light obscures, but now you meet the big person—the one who sees through the glare. Good fortune because recognition transcends the excess.",
    "Lines are coming. Blessing and fame draw near. Good fortune. Abundance at its peak: lines converge, blessings arrive, fame approaches. Good fortune because you are ready to receive without grasping.",
    "His house is in a state of abundance. He screens off his family. He peers through the gate and no longer perceives anyone. For three years he sees nothing. Misfortune. Abundance misused: he screens off his family, isolates himself. Peers through the gate and sees no one. For three years, a full cycle, he sees nothing. Misfortune because abundance became a prison. Do not let your fullness separate you from others."
  ],
  "trigrams": {
    "lower": {
      "name": "Lí (Fire)",
      "nature": "Clinging, bright"
    },
    "upper": {
      "name": "Zhèn (Thunder)",
      "nature": "Arousing, moving"
    },
    "description": "Fire below, thunder above. Light and sound together—the peak of manifestation. Abundance is this: the full expression of power, the complete display of wealth. But the wise one knows that thunder fades and fire dims. In abundance, be generous; in fullness, be humble."
  },
  "taoist_reflection": "The Tao Te Ching says: 'To hold and fill to overflowing is not as good as to stop. To sharpen a blade and keep it too sharp cannot be kept long.' Hexagram 55 is the overflowing cup, the too-sharp blade. Abundance is a gift, but only if you know when to stop. The sun at midday gives most light, but it also begins its descent. The sage in abundance does not try to prolong it; they use it while it lasts, and let it go when it passes. In this, they are like the sun: full, generous, and unafraid of the setting."
},
{
  "number": 56,
  "name": "The Wanderer (旅 - Lǚ)",
  "heart": "Fire over mountain. Fire burns on the mountain, bright but not rooted. The wanderer is one who travels, who has no fixed home. They are exposed, dependent on the hospitality of others. Yet the wanderer also sees new lands, meets new people, grows in ways the settled cannot. The hexagram counsels: be prudent, be modest, attach yourself to what is reliable, and do not stay too long. The wanderer's path is one of constant learning, constant leaving.",
  "ancient": {
    "chinese": "旅。小亨，旅貞吉。",
    "rendering": "The Wanderer. Success in small matters. Perseverance brings good fortune to the wanderer."
  },
  "judgment": "The wanderer does not seek great things. Small successes are enough. Perseverance in the wandering life brings good fortune—not because you accumulate, but because you learn. In each new place, be modest. Attach yourself to what is trustworthy. Do not stay beyond your welcome. The wanderer who follows these rules will always find a place to rest. The fire on the mountain burns brightly, but it does not consume the mountain; it accepts its temporary home.",
  "image": "Fire over mountain. The noble one is clear-minded and cautious in imposing penalties. Fire over mountain: the light reveals, but the mountain remains. The noble one learns: be clear-minded—see what is. Be cautious in imposing penalties—the wanderer has no local knowledge, no deep ties. Do not judge too quickly. In a strange place, mercy is wiser than strictness.",
  "lines": [
    "The wanderer is busy with trivial things. Thus he brings misfortune upon himself. The first mistake: fussing over small matters, losing sight of the larger context. The wanderer, anxious, busies himself with trifles and brings misfortune. Relax. See the whole.",
    "The wanderer comes to an inn. He has his possessions with him. He wins the heart of a young servant. The inn—a temporary home. Possessions—what he carries. The servant—a local connection. Good fortune because he finds shelter and a bond. The wanderer needs both: a place to rest and someone to trust.",
    "The wanderer's inn burns down. He loses the heart of his young servant. Danger. The inn destroyed, the bond broken. Danger because his supports are gone. The line does not offer comfort; it simply records. In wandering, losses come. The only response is to move on.",
    "The wanderer rests in a shelter. He has his possessions with him. But my heart is not glad. A shelter, not a home. Possessions, but not peace. The heart is not glad because the wandering itself is wearying. This line acknowledges the cost of the path. Even with necessities, the soul may ache.",
    "He shoots a pheasant. It drops with the first arrow. In the end, he gets praise and a mandate. A small success—the pheasant falls. But from this small act, he earns praise and a mandate. In wandering, small deeds can lead to recognition. Do not despise the small.",
    "The bird's nest burns up. The wanderer first laughs, then cries. He loses his cow. Misfortune. The final loss: the nest, the home, the cow—the resource. First laughter (denial? relief?), then tears. Misfortune because everything is gone. The wanderer must now wander with nothing. Yet even this is not the end; it is the deepest teaching of impermanence."
  ],
  "trigrams": {
    "lower": {
      "name": "Gèn (Mountain)",
      "nature": "Stillness, resting"
    },
    "upper": {
      "name": "Lí (Fire)",
      "nature": "Clinging, bright"
    },
    "description": "Mountain below, fire above. Fire rests on the mountain, bright but temporary. The wanderer is like this: a visitor, a guest. The mountain endures; the fire moves on. In wandering, accept that you are not the mountain. You are the fire, here today, gone tomorrow. Burn brightly while you stay."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The good traveler leaves no tracks.' Hexagram 56 is the traveler who leaves light tracks, who does not cling, who moves through the world like fire over mountain—bright, warm, and gone. The wanderer's path is the path of non-attachment. You have no permanent home, so you are at home everywhere. You have no fixed identity, so you can become anyone. The sage wanders through life as through a foreign country—curious, humble, free. And in the end, they leave no tracks because they never claimed any ground."
},
{
  "number": 57,
  "name": "The Gentle (巽 - Xùn)",
  "heart": "Wind over wind. Gentle, penetrating, persistent. The Gentle is the power of influence without force, of persuasion without argument. Wind does not break the tree; it bends it over time. It does not command the clouds; it moves them. In human life, the gentle approach is often the most powerful: a soft word turns away wrath, a steady presence changes hearts. The wise one does not push; they permeate.",
  "ancient": {
    "chinese": "巽。小亨，利有攸往，利見大人。",
    "rendering": "The Gentle. Success in small matters. It furthers one to undertake something. It furthers one to see the great person."
  },
  "judgment": "The gentle way succeeds in small matters—the daily interactions, the subtle influences. It furthers one to undertake something, because gentle action, persistently applied, accomplishes much. It furthers to see the great person—one who embodies this gentle power, who can teach you its ways. The wind does not strive; it simply moves. In its moving, it shapes mountains. So too, your gentle persistence will shape your world.",
  "image": "Winds following one another. The noble one spreads his commands and carries out his affairs. Wind after wind: influence compounding, messages spreading. The noble one learns: spread your commands—not by shouting, but by letting them be carried. Carry out your affairs—not by forcing, but by persistent gentle action. The winds do not tire; they simply continue. So too, the noble one.",
  "lines": [
    "Advancing and retreating. It furthers the perseverance of a warrior. The first movement of the gentle: advancing, then retreating—testing, feeling. This is not indecision; it is the warrior's reconnaissance. Perseverance in this probing furthers. Know the ground before you commit.",
    "The gentle beneath the bed. Priests and magicians are used in great number. Good fortune. No blame. The gentle so deep it goes under the bed—into the hidden, the unconscious. Priests and magicians—ritual, tradition—are used. Good fortune because you access the depths. No blame because you use what works.",
    "Repeatedly entering the gentle. Humiliation. To be too gentle, too yielding, too compliant—repeatedly entering the gentle—brings humiliation. The wind that always bends breaks nothing. Know when to be firm.",
    "Regret disappears. In the hunt, you catch three kinds of game. The gentle applied with purpose: regret disappears because you act effectively. In the hunt, you catch three kinds of game—success in multiple areas. The gentle way, when rightly directed, achieves much.",
    "Perseverance brings good fortune. Regret disappears. Nothing that does not further. No beginning, but an end. Before the change, three days. After the change, three days. Good fortune. The culmination: perseverance brings good fortune, regret dissolves, everything furthers. There is no beginning—you cannot trace the start of the gentle influence. But there is an end—a clear result. Three days before and after—the cycle of preparation and integration. Good fortune because the gentle way has become natural, effortless.",
    "The gentle beneath the bed. He loses his possessions and his axe. Perseverance brings misfortune. Too deep, too far: under the bed, he loses his tools—his axe, his means of acting. Perseverance in this hiddenness brings misfortune. Even the gentle must sometimes emerge."
  ],
  "trigrams": {
    "lower": {
      "name": "Xùn (Wind)",
      "nature": "Gentle, penetrating"
    },
    "upper": {
      "name": "Xùn (Wind)",
      "nature": "Gentle, penetrating"
    },
    "description": "Wind over wind. Influence upon influence. The Gentle is not a single breeze; it is the constant wind that shapes landscapes. It does not force; it persists. The wise one learns that the softest thing in the world can overcome the hardest, simply by continuing."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The softest thing in the world rides over the hardest thing in the world. That which has no substance enters where there is no space.' Hexagram 57 is the softest thing made manifest. The wind cannot be grasped, yet it moves mountains. The gentle cannot be resisted, yet it changes hearts. The sage does not argue, does not fight, does not insist. They simply continue, like wind over wind, and in time, all things yield."
},
{
  "number": 58,
  "name": "The Joyous (兌 - Duì)",
  "heart": "Lake over lake. Water reflecting water, joy upon joy. The Joyous is the power of authentic happiness—not the fleeting pleasure of acquisition, but the deep joy of connection, of presence, of being fully alive. True joy is contagious; it spreads like ripples on a lake. The wise one does not seek joy; they become a source of it, and others are refreshed.",
  "ancient": {
    "chinese": "兌。亨，利貞。",
    "rendering": "The Joyous. Success. Perseverance furthers."
  },
  "judgment": "Joy succeeds because it opens hearts. When you are genuinely joyful, others are drawn to you, and together you create more joy. Perseverance in this authentic happiness furthers all things. But beware: joy can be counterfeited. Flattery, empty cheer, forced smiles—these are not the Joyous; they are its shadow. True joy is rooted in sincerity, in the deep satisfaction of being alive and connected. Cultivate that root, and the fruit will be sweet.",
  "image": "Lakes resting one on another. The noble one discusses things with friends. Lakes together: they reflect each other, deepen each other. The noble one learns: discuss things with friends. Joy is amplified in companionship. Not shallow chatter, but deep exchange—the meeting of minds and hearts. In such discussion, joy is born and nourished.",
  "lines": [
    "Joy that is inward and quiet. Good fortune. The first joy: inward, quiet, not dependent on others. This is the root of all true happiness. Good fortune because it cannot be taken away.",
    "Joy that is sincere. Good fortune. Regret disappears. Sincere joy, expressed genuinely, brings good fortune. Regret disappears because you are not pretending. Your joy is real, and the world receives it.",
    "Joy that comes from outside. Misfortune. Joy dependent on externals—on praise, on possessions, on events—brings misfortune because it cannot last. When the outside changes, the joy vanishes. Do not build your happiness on sand.",
    "Joy that is not yet decided. The boundary is in motion. There is no rest. If you are sincere, danger will leave. Joy that wavers, that cannot settle. The boundary moves; there is no rest. But if you are sincere—if you stay true to your deepest self—danger will leave. The wavering joy finds its center.",
    "Joy in what is genuine. Danger. But perseverance in what is right brings good fortune. To find joy in what is genuine is right, but it may bring danger because the world often fears the real. Persevere in this right joy, and good fortune follows.",
    "Joy that is seductive and leads others on. The joy that uses others, that manipulates, that seduces—this is the corruption of the Joyous. It may work for a time, but in the end, it brings misfortune. True joy never uses; it shares."
  ],
  "trigrams": {
    "lower": {
      "name": "Duì (Lake)",
      "nature": "Joyful, reflecting"
    },
    "upper": {
      "name": "Duì (Lake)",
      "nature": "Joyful, reflecting"
    },
    "description": "Lake over lake. Joy reflecting joy. The lakes mirror each other, their depths multiplying. This is the Joyous: not a single happiness, but happiness shared, reflected, amplified. In true joy, there is no taking; there is only giving and receiving, like lakes exchanging their reflections."
  },
  "taoist_reflection": "The Tao Te Ching says: 'I have three treasures that I hold and keep. The first is compassion. The second is frugality. The third is not daring to be ahead of the world.' Hexagram 58 is the treasure of compassion made manifest. True joy is compassionate; it does not seek its own at the expense of others. It is frugal; it does not need excess to be happy. It does not dare to be ahead; it is content to be with. In this, it is like the lake: deep, still, reflecting all, asking nothing."
},
{
  "number": 59,
  "name": "Dispersion (渙 - Huàn)",
  "heart": "Wind over water. Wind scatters the clouds, disperses the mist. Dispersion is the breaking up of what has become stagnant—rigid thoughts, frozen feelings, blocked energy. Not destruction, but release. The wind does not destroy the water; it moves it, clears it, refreshes it. In human life, dispersion comes when we need to let go, to forgive, to release what no longer serves. The wise one welcomes the wind that clears the heart.",
  "ancient": {
    "chinese": "渙。亨。王假有廟，利涉大川，利貞。",
    "rendering": "Dispersion. Success. The king approaches his temple. It furthers one to cross the great water. Perseverance furthers."
  },
  "judgment": "Dispersion brings success because it clears the way. The king approaches his temple—the center, the sacred—after the dispersion of what distracted him. It furthers one to cross the great water—the great difficulty—because the obstacles have been scattered. Perseverance in this clearing furthers all things. Do not cling to what must disperse. Let the wind do its work, and you will find yourself lighter, clearer, ready for the crossing.",
  "image": "Wind over water. The ancient kings sacrificed to the Lord and built temples. Wind over water: the wind moves the water, clears the surface. The ancient kings learned: sacrifice to the Lord—offer thanks for the clearing. Build temples—create spaces where the sacred can be encountered. Dispersion is not just loss; it is the condition for new connection. After the scattering, gather at the temple.",
  "lines": [
    "He brings help with strong horses. Good fortune. At the first sign of dispersion, strong horses—energy, resources—arrive to help. Good fortune because you are supported. The dispersion is not abandonment; it is redistribution.",
    "During dispersion, he hurries to his support. Regret disappears. When the scattering begins, hurry to what supports you—friends, practice, truth. Regret disappears because you do not wait until you are scattered too far.",
    "He disperses his own self. No regret. The deepest dispersion: letting go of the self, the ego, the fixed identity. No regret because what remains is more real than what was lost. The self was the last obstacle.",
    "He disperses his group. Great good fortune. The group—the tribe, the identity—disperses. This seems like loss, but it is great good fortune because the group was a barrier to larger connection. After dispersion, you can belong to all.",
    "Dispersion leads to sweaty announcements. Perseverance brings good fortune. The dispersion is so intense that it produces sweat—effort, release. Announcements—truths that must be spoken—come forth. Perseverance in this sweaty clearing brings good fortune.",
    "He disperses the blood. Dispersing, leaving, departing—no blame. Blood—the deepest ties, the most visceral bonds. To disperse even these, to leave, to depart—no blame because some bonds must be released for life to continue. The final line acknowledges the hardest letting go."
  ],
  "trigrams": {
    "lower": {
      "name": "Kǎn (Water)",
      "nature": "Abysmal, dangerous"
    },
    "upper": {
      "name": "Xùn (Wind)",
      "nature": "Gentle, penetrating"
    },
    "description": "Water below, wind above. Wind over water—the surface stirs, the mist clears. Dispersion is this: the gentle force that moves what is stagnant, that breaks up what has frozen. The water does not resist; it ripples. The wind does not force; it moves. Together, they create clarity."
  },
  "taoist_reflection": "The Tao Te Ching says: 'To obtain, one must first give. To learn, one must first unlearn.' Hexagram 59 is the great unlearning, the great giving away. Dispersion is not loss; it is the clearing that allows new growth. The wind that scatters the clouds also reveals the sun. The sage who lets go of the self finds the true self. In dispersion, there is no blame—only the spaciousness of a heart that has released its hold."
},
{
  "number": 60,
  "name": "Limitation (節 - Jié)",
  "heart": "Water over lake. The lake fills, but the water stops at its banks. Limitation is not deprivation; it is form. Without banks, the lake would spread and disappear. Without limits, life would dissipate. The wise one accepts limitation as the condition of all meaningful existence. Not to be constrained, but to be shaped. A river without banks is a flood; a life without limits is chaos.",
  "ancient": {
    "chinese": "節。亨。苦節不可貞。",
    "rendering": "Limitation. Success. Bitter limitation should not be persevered in."
  },
  "judgment": "Limitation succeeds because it gives form to energy. The lake's banks allow it to be deep, to reflect, to sustain life. So too, your limits allow you to be present, to focus, to create. But bitter limitation—restriction that chafes, that crushes—should not be persevered in. Know the difference between the bank that holds and the bank that imprisons. The wise one accepts the first and resists the second.",
  "image": "Water over lake. The noble one creates number and measure, and examines virtue and conduct. Water over lake: the level is fixed, the measure clear. The noble one learns: create number and measure—standards, limits, forms. Examine virtue and conduct—see if they fit within the measure. Limitation is not arbitrary; it is the wisdom of appropriateness. What fits, flourishes. What does not, must change.",
  "lines": [
    "Not going out of the door and the courtyard. No blame. The first limitation: staying home, within bounds. No blame because you are not yet ready for wider movement. Know your limits and respect them.",
    "Not going out of the gate and the courtyard brings misfortune. The same action, but now it is too late. Staying within when you should go out brings misfortune. Limitation must be appropriate to time. The line warns: do not cling to limits that have outlived their use.",
    "He who knows no limitation will have cause to lament. No blame. The one without limits laments—because life without form is chaos. But the line says no blame—perhaps because they did not know better. Yet the lament itself is the teacher.",
    "Contented limitation. Good fortune. The ideal: limitation that is accepted, even embraced. Not bitter, not restrictive—contented. Good fortune because the limits fit like a well-made garment. They do not bind; they support.",
    "Sweet limitation brings good fortune. Going forward brings esteem. Limitation that is sweet—pleasant, welcome—brings good fortune. To go forward within these sweet limits brings esteem. Others see that you have found the balance between freedom and form.",
    "Bitter limitation. Perseverance brings misfortune. Regret disappears. The final warning: bitter limitation, if persevered in, brings misfortune. But regret disappears if you recognize it and let it go. The line offers a way out: see the bitterness, and release the limit that causes it."
  ],
  "trigrams": {
    "lower": {
      "name": "Duì (Lake)",
      "nature": "Joyful, reflecting"
    },
    "upper": {
      "name": "Kǎn (Water)",
      "nature": "Abysmal, dangerous"
    },
    "description": "Lake below, water above. The lake has its banks; the water has its channel. Limitation is this: the forms that contain and direct energy. The lake does not resent its banks; they make it deep. The water does not curse its channel; it makes it flow. So too, the wise one honors the limits that give life form."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The thirty spokes unite in one hub. It is the empty space that makes the wagon useful.' Hexagram 60 is the spokes and the hub—the limits that create the emptiness that is useful. Without spokes, no wheel. Without limits, no space. The sage does not fight limitation; they use it to create the container for what matters. The banks make the lake; the channel makes the river. Limitation is not the enemy of life; it is the midwife."
},
{
  "number": 61,
  "name": "Inner Truth (中孚 - Zhōng Fú)",
  "heart": "Wind over lake. Wind moves, lake reflects—both responding, both true. Inner Truth is the quality of being real at the core, of having a center that cannot be shaken. The wind does not pretend to be still; the lake does not pretend to be deep. They are what they are, and in their truth, they interact harmoniously. The wise one cultivates this inner truth: a heart so sincere that it needs no defense, no pretense, no mask.",
  "ancient": {
    "chinese": "中孚。豚魚吉，利涉大川，利貞。",
    "rendering": "Inner Truth. It brings good fortune even to pigs and fish. It furthers one to cross the great water. Perseverance furthers."
  },
  "judgment": "Inner truth is so powerful that it reaches even pigs and fish—the simplest, most unreflective beings. If you are truly sincere, your truth communicates itself to all, without words. It furthers one to cross the great water—the greatest difficulty—because inner truth is a boat that cannot sink. Perseverance in this sincerity furthers all things. The wind does not try to move the lake; it simply moves, and the lake responds. So too, you need only be true; the world will respond.",
  "image": "Wind over lake. The noble one discusses criminal cases in order to delay executions. Wind over lake: the wind stirs, the lake reflects. The noble one learns: in criminal cases, delay—not to avoid justice, but to ensure truth. Inner truth requires time to emerge. Rushed judgments miss it. The noble one waits, reflects, and only then decides.",
  "lines": [
    "Being prepared brings good fortune. If there are hidden motives, it is restless. The first step: prepare. Be ready for truth to emerge. If you have hidden motives, you will be restless, and the truth will not come. Prepare by being empty, open.",
    "A crane calling in the shade. Its young answer it. I have a good goblet. I will share it with you. The image of inner truth: the crane calls, and its young answer without seeing it. Truth communicates itself. The goblet shared is truth shared. No need for words; the heart speaks directly.",
    "He finds a comrade. Now he beats the drum, now he stops. Now he sobs, now he sings. Inner truth in relationship: the comrade found, the rhythm of connection—drumming and stopping, sobbing and singing. The full range of true feeling, expressed without pretense. No blame.",
    "The moon nearly full. The horses' mate is lost. No blame. The moon nearly full—truth almost complete. But the mate is lost—connection broken. Yet no blame because the truth itself is not diminished. Inner truth does not depend on others.",
    "He possesses truth. He has no blame. Simple, direct: he possesses truth. No blame because truth needs nothing else. The line is almost redundant; it simply states what is.",
    "Truth that crows. The cock crows, but it does not fly. Misfortune. Truth that is only noise, only display, not substance. The cock crows but cannot fly. This is not inner truth; it is its counterfeit. Misfortune because it will be found out."
  ],
  "trigrams": {
    "lower": {
      "name": "Duì (Lake)",
      "nature": "Joyful, reflecting"
    },
    "upper": {
      "name": "Xùn (Wind)",
      "nature": "Gentle, penetrating"
    },
    "description": "Lake below, wind above. The wind moves, the lake reflects—both in their true nature. Inner Truth is this: being so completely what you are that your presence communicates itself without effort. The lake does not try to reflect; it simply does. The wind does not try to move; it simply does. Be like them."
  },
  "taoist_reflection": "The Tao Te Ching says: 'He who knows does not speak; he who speaks does not know.' Hexagram 61 is the knowing that does not speak, the truth that communicates without words. The crane calls in the shade, and its young answer—not by sight, but by recognition. The sage, hidden, still influences all. Inner truth is not a message; it is a state of being. When you are true, the world cannot help but respond, because truth is the native language of all things."
},
{
  "number": 62,
  "name": "Preponderance of the Small (小過 - Xiǎo Guò)",
  "heart": "Thunder over mountain. The thunder is loud, but the mountain is still—a small excess of sound over substance. Preponderance of the Small is the condition where the small outweighs the great, where details overwhelm the whole. Not a crisis, but an imbalance. The wise one in such times attends to the small, corrects the excess, and restores harmony. Do not despise small things; they can tip the scale.",
  "ancient": {
    "chinese": "小過。亨，利貞。可小事，不可大事。飛鳥遺之音，不宜上宜下，大吉。",
    "rendering": "Preponderance of the Small. Success. Perseverance furthers. Small matters may be done; great matters should not be done. The flying bird leaves its song. It is better to descend than to ascend. Great good fortune."
  },
  "judgment": "In times when the small preponderates, success comes through attending to small matters. Great undertakings are not advisable; they will be thrown off by the imbalance. The flying bird leaves its song—a small thing, but it carries meaning. It is better to descend than to ascend. Stay low, stay humble, tend the details. Great good fortune follows because you do not attempt what you cannot yet sustain. The mountain does not try to be thunder; it simply rests, and the thunder passes.",
  "image": "Thunder over mountain. The noble one in his conduct is excessively humble. In mourning, he is excessively sorrowful. In his expenditures, he is excessively frugal. Thunder over mountain: a small excess of sound. The noble one learns: in conduct, be excessively humble—better too humble than too proud. In mourning, be excessively sorrowful—better to feel too much than too little. In expenditures, be excessively frugal—better to save too much than too little. When the small preponderates, lean into the small virtues. They will balance the scale.",
  "lines": [
    "The bird meets with misfortune through flying. The bird that flies too high, that seeks the great when the small preponderates, meets misfortune. Stay low.",
    "She passes by her ancestor and meets her ancestress. He does not reach his ruler and meets his minister. No blame. To pass by the greater and meet the lesser—this is the way of the small preponderance. No blame because it is appropriate to the time.",
    "If you are not excessively careful, you may be attacked from behind. Danger. The small preponderance requires extra care. If you are not careful enough, danger comes. The line warns: in small matters, vigilance is protection.",
    "No blame. He meets him without passing by. Going brings danger. One must be on guard. Do not act. Perseverance brings good fortune. Meeting without passing—finding the right balance. Going forward now brings danger; be on guard. Do not act; simply persevere in awareness. Good fortune follows.",
    "Dense clouds, no rain from our western region. The prince shoots and hits him in the cave. The image from hexagram 9 returns: clouds gather, but no rain. The small preponderance has not yet become the great. The prince shoots and hits—a small action, precise, effective. In the cave, in hiddenness, the small act achieves what great force could not.",
    "He passes by, does not meet. The flying bird leaves him. Misfortune. This means calamity and injury. To pass by and not meet, to fly and miss connection—this is the misfortune of the small preponderance when it is not rightly handled. The bird leaves; the song is lost. Calamity and injury follow because the small was not attended to in time."
  ],
  "trigrams": {
    "lower": {
      "name": "Gèn (Mountain)",
      "nature": "Stillness, resting"
    },
    "upper": {
      "name": "Zhèn (Thunder)",
      "nature": "Arousing, moving"
    },
    "description": "Mountain below, thunder above. Thunder over mountain—a small excess, a momentary imbalance. The mountain does not try to match the thunder; it remains still. The wise one in times of small preponderance does not attempt great things; they tend the small, correct the little imbalances, and wait for the thunder to pass."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The heavy is the root of the light. The still is the master of the restless.' Hexagram 62 is the light and restless in excess, the heavy and still as the remedy. When the small preponderates, return to the heavy, the still, the low. Descend, do not ascend. The bird that flies too high meets misfortune; the bird that stays near the earth hears its own song. The sage in times of imbalance does not seek to dominate; they become more humble, more careful, more still. In this, they become the root that stabilizes all."
},
{
  "number": 63,
  "name": "After Completion (既濟 - Jì Jì)",
  "heart": "Water over fire. The fire has heated the water; the water has tempered the fire. Their work is done; balance is achieved. After Completion is the moment of success, of fulfillment, of harmony. But the hexagram warns: this moment is also the beginning of decline. The fire will dim, the water will cool. After completion, the wise one does not rest on achievement; they prepare for what comes next. The crossing is complete, but the river still flows.",
  "ancient": {
    "chinese": "既濟。亨小，利貞。初吉終亂。",
    "rendering": "After Completion. Success in small matters. Perseverance furthers. At the beginning, good fortune; at the end, disorder."
  },
  "judgment": "After completion, success is in small matters—maintaining, adjusting, fine-tuning. Perseverance in this careful tending furthers. At the beginning, good fortune; at the end, disorder. This is the law of all achievement: what is made will unmake; what is completed will be undone. The wise one does not despair at this; they accept it as natural. They enjoy the completion while it lasts, and they prepare for the inevitable change. The fire and water have done their work; now they rest. You too, after completion, rest—but stay awake.",
  "image": "Water over fire. The noble one takes thought of misfortune and arms himself against it in advance. Water over fire: balance achieved, but the water may quench the fire, the fire may boil the water. The noble one learns: think of misfortune. Arm against it in advance. Not from fear, but from wisdom. After completion, the seeds of disorder are already present. The wise one sees them and prepares. Not to prevent the inevitable, but to meet it with grace.",
  "lines": [
    "He brakes his wheels. He gets his tail in the water. No blame. The first step after completion: slow down. Brake the wheels. The tail gets wet—a small consequence, not fatal. No blame because you are cautious. Completion is not a time for speed.",
    "The woman loses her curtain. Do not go in pursuit. In seven days you will get it back. After completion, small losses occur. The curtain—privacy, modesty—is lost. Do not chase it. In seven days—a full cycle—it will return. Patience restores what is truly yours.",
    "The high ancestor attacks the demon region. After three years, he subdues it. Inferior people should not be employed. Great tasks after completion take time—three years to subdue the demon. The warning: inferior people—those who would exploit the success—should not be employed. Completion is vulnerable to corruption. Guard it with good people.",
    "The finest cloth may become rags. Be careful all day long. The finest things decay. Completion is not permanent. Be careful all day long—attention, not anxiety. Watch for the signs of decay, and tend them early.",
    "The neighbor in the east who slaughters an ox does not attain as much blessing as the neighbor in the west with his small offering. In after completion, small sincerity outdoes large ritual. The east slaughters an ox—great sacrifice, but perhaps performed without heart. The west offers a small gift, but with true feeling. He attains blessing. After completion, quality matters more than quantity.",
    "He gets his head in the water. Danger. The final immersion: head in water, the completion overwhelmed. Danger because the balance is lost. The line does not offer hope; it simply records. After completion, there is also after. The cycle continues."
  ],
  "trigrams": {
    "lower": {
      "name": "Lí (Fire)",
      "nature": "Clinging, bright"
    },
    "upper": {
      "name": "Kǎn (Water)",
      "nature": "Abysmal, dangerous"
    },
    "description": "Fire below, water above. The water and fire have found balance—neither overcomes the other. This is after completion: the moment of perfect harmony. But the hexagram's position—63 of 64—reminds us that after completion comes dissolution. The fire will dim, the water will cool. Enjoy the harmony, but do not cling."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The Tao that can be told is not the eternal Tao. The name that can be named is not the eternal name.' Hexagram 63 is the completion that can be completed—and therefore, it is not eternal. After completion, there is always another hexagram. The sage does not seek permanent success; they seek right action in each moment. The fire and water will separate; that is their nature. But for now, they are in balance. Be grateful, be careful, and let the next moment come."
},
{
  "number": 64,
  "name": "Before Completion (未濟 - Wèi Jì)",
  "heart": "Fire over water. The fire rises, the water sinks—they move apart, not yet in harmony. Before Completion is the final hexagram, the last of sixty-four, yet it points forward. Nothing is ever truly finished. After every completion, there is a new beginning. The young fox has almost crossed the stream, but its tail gets wet. Almost, but not yet. This is the human condition: always approaching, never fully arriving. And this is not failure; it is the way.",
  "ancient": {
    "chinese": "未濟。亨。小狐汔濟，濡其尾，无攸利。",
    "rendering": "Before Completion. Success. But the little fox, after almost crossing, gets its tail wet. Nothing that would further."
  },
  "judgment": "Before completion, success is still possible—but not yet. The little fox almost crosses, then wets its tail. The crossing is not complete. Nothing furthers at this moment because the time is not ripe. Yet this hexagram is not despair; it is the most hopeful of all. It is the last, but it points to the first. After 63, before 64, the cycle begins again. The fire and water are separate, but they will meet. The fox will cross. Not now, but soon. Persevere in the approach; the completion will come.",
  "image": "Fire over water. The noble one is careful in distinguishing things and giving them their places. Fire over water: they are separate, not yet in relation. The noble one learns: be careful in distinguishing things. Give them their places. Not yet union, but preparation. Know what each thing is, where it belongs, and the conditions for their meeting. Before completion, clarity is the foundation. When the time comes, you will be ready.",
  "lines": [
    "He gets his tail wet. Humiliation. The first step, and already a mishap—the tail wet. Humiliation because the crossing is not yet successful. But it is only the tail; the fox itself is not submerged. A small failure, a lesson.",
    "He brakes his wheels. Perseverance brings good fortune. After the wet tail, slow down. Brake the wheels. Perseverance in this caution brings good fortune. The crossing can wait; better to arrive late than not at all.",
    "Before completion, setting forth brings misfortune. It furthers one to cross the great water. The warning: setting forth now, in haste, brings misfortune. Yet it furthers to cross the great water—the great task—but only when the time is right. Discernment is all.",
    "Perseverance brings good fortune. Regret disappears. Shock, thus to discipline the kingdom. For three years, invest in great regions. After the caution, after the waiting, perseverance brings good fortune. Regret disappears. Now use the shock—the energy—to discipline the kingdom, to invest in great regions. The time for action approaches.",
    "Perseverance brings good fortune. No regret. The light of the noble one is true. Good fortune. At the threshold: perseverance still brings good fortune, now without regret. The noble one's light is true—clear, steady. Good fortune because you are ready.",
    "He drinks wine. No blame. But if he gets his head wet, he loses it, in truth. The final line: at the very end, you may relax—drink wine. No blame in that. But if you get your head wet—if you go too far, lose yourself—you lose it, in truth. Before completion, even at the last step, stay aware. The crossing is almost done, but not yet. Do not drown at the shore."
  ],
  "trigrams": {
    "lower": {
      "name": "Kǎn (Water)",
      "nature": "Abysmal, dangerous"
    },
    "upper": {
      "name": "Lí (Fire)",
      "nature": "Clinging, bright"
    },
    "description": "Water below, fire above. They move apart, not yet in harmony. Before Completion is the state of potential, of approaching, of almost. The fire and water will meet—they always do. But not yet. The wise one in this state waits, prepares, and trusts the process. The crossing will be made. The cycle will continue."
  },
  "taoist_reflection": "The Tao Te Ching says: 'The Tao is hidden and nameless. Yet it alone nourishes and completes all things.' Hexagram 64 is the hidden Tao, the completion that is not yet complete, the name that cannot be named. After sixty-three stages, we return to the beginning. The fox almost crosses; the cycle almost ends. But there is no end. The Tao flows on, eternally before completion, eternally approaching. The wise one does not demand arrival; they find peace in the approach, joy in the almost. The tail is wet, but the crossing continues. And that is enough."
}
]
